yuer-12342/sx1280-test/mcu/common/hc32l021.h
typedef struct
{
    __IO uint32_t ARR                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_arr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_cnt_field_t;

typedef struct
{
    __IO uint32_t STEP                      : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t ETRFLT                    : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t SRC                       : 3;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_cr0_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t MD                        : 2;
    __IO uint32_t AUTO                      : 1;
    __IO uint32_t PRS                       : 4;
    __IO uint32_t OST                       : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_cr1_field_t;

typedef struct
{
    __IO uint32_t UD                        : 1;
    __IO uint32_t END                       : 1;
    __IO uint32_t PS                        : 1;
    __IO uint32_t MISS                      : 1;
    __IO uint32_t OV                        : 1;
    __IO uint32_t OK                        : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_ier_field_t;

typedef struct
{
    __IO uint32_t UD                        : 1;
    __IO uint32_t END                       : 1;
    __IO uint32_t PS                        : 1;
    __IO uint32_t MISS                      : 1;
    __IO uint32_t OV                        : 1;
    __IO uint32_t OK                        : 1;
    __IO uint32_t DIR                       : 1;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_isr_field_t;

typedef struct
{
    __IO uint32_t UD                        : 1;
    __IO uint32_t END                       : 1;
    __IO uint32_t PS                        : 1;
    __IO uint32_t MISS                      : 1;
    __IO uint32_t OV                        : 1;
    __IO uint32_t OK                        : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_icr_field_t;

typedef struct
{
    __IO uint32_t FCAP                      :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_fcap_field_t;

typedef struct
{
    __IO uint32_t TVAL                      :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_tval_field_t;

typedef struct
{
    __IO uint32_t FLIM                      :12;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_ctrim_flim_field_t;

typedef struct
{
    __IO uint32_t OP                        : 2;
    __IO uint32_t WAIT                      : 2;
    __IO uint32_t BUSY                      : 1;
    __IO uint32_t IE                        : 2;
    uint32_t RESERVED7                      : 2;
    __IO uint32_t DPSTB_EN                  : 1;
    __IO uint32_t CONTP                     : 1;
    __IO uint32_t RO                        : 1;
    __IO uint32_t RSV                       :20;
} stc_flash_cr_field_t;

typedef struct
{
    __IO uint32_t PC                        : 1;
    __IO uint32_t PROT                      : 1;
    __IO uint32_t RSV                       :30;
} stc_flash_ifr_field_t;

typedef struct
{
    __IO uint32_t PC                        : 1;
    __IO uint32_t PROT                      : 1;
    __IO uint32_t RSV                       :30;
} stc_flash_iclr_field_t;

typedef struct
{
    __IO uint32_t BYSEQ                     :16;
    __IO uint32_t RSV                       :16;
} stc_flash_bypass_field_t;

typedef struct
{
    __IO uint32_t SLOCK                     :32;
} stc_flash_slock0_field_t;

typedef struct
{
    __IO uint32_t LOCK_ST                   : 2;
    __IO uint32_t RSV                       :30;
} stc_flash_lock_st_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin00_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin01_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin02_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin03_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin04_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin05_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin06_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin07_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin08_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin09_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin10_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin11_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin12_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin13_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin14_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pin15_sel_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_dir_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_in_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_out_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_ads_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_bset_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_bclr_field_t;

typedef struct
{
    __IO uint32_t BCLRPIN00                 : 1;
    __IO uint32_t BCLRPIN01                 : 1;
    __IO uint32_t BCLRPIN02                 : 1;
    __IO uint32_t BCLRPIN03                 : 1;
    __IO uint32_t BCLRPIN04                 : 1;
    __IO uint32_t BCLRPIN05                 : 1;
    __IO uint32_t BCLRPIN06                 : 1;
    __IO uint32_t BCLRPIN07                 : 1;
    __IO uint32_t BCLRPIN08                 : 1;
    __IO uint32_t BCLRPIN09                 : 1;
    __IO uint32_t BCLRPIN10                 : 1;
    __IO uint32_t BCLRPIN11                 : 1;
    __IO uint32_t BCLRPIN12                 : 1;
    __IO uint32_t BCLRPIN13                 : 1;
    __IO uint32_t BCLRPIN14                 : 1;
    __IO uint32_t BCLRPIN15                 : 1;
    __IO uint32_t BSETPIN00                 : 1;
    __IO uint32_t BSETPIN01                 : 1;
    __IO uint32_t BSETPIN02                 : 1;
    __IO uint32_t BSETPIN03                 : 1;
    __IO uint32_t BSETPIN04                 : 1;
    __IO uint32_t BSETPIN05                 : 1;
    __IO uint32_t BSETPIN06                 : 1;
    __IO uint32_t BSETPIN07                 : 1;
    __IO uint32_t BSETPIN08                 : 1;
    __IO uint32_t BSETPIN09                 : 1;
    __IO uint32_t BSETPIN10                 : 1;
    __IO uint32_t BSETPIN11                 : 1;
    __IO uint32_t BSETPIN12                 : 1;
    __IO uint32_t BSETPIN13                 : 1;
    __IO uint32_t BSETPIN14                 : 1;
    __IO uint32_t BSETPIN15                 : 1;
} stc_gpio_bsetclr_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_pu_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_od_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_hie_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_lie_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_rie_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_fie_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_stat_field_t;

typedef struct
{
    __IO uint32_t PIN00                     : 1;
    __IO uint32_t PIN01                     : 1;
    __IO uint32_t PIN02                     : 1;
    __IO uint32_t PIN03                     : 1;
    __IO uint32_t PIN04                     : 1;
    __IO uint32_t PIN05                     : 1;
    __IO uint32_t PIN06                     : 1;
    __IO uint32_t PIN07                     : 1;
    __IO uint32_t PIN08                     : 1;
    __IO uint32_t PIN09                     : 1;
    __IO uint32_t PIN10                     : 1;
    __IO uint32_t PIN11                     : 1;
    __IO uint32_t PIN12                     : 1;
    __IO uint32_t PIN13                     : 1;
    __IO uint32_t PIN14                     : 1;
    __IO uint32_t PIN15                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpio_iclr_field_t;

typedef struct
{
    uint32_t RESERVED0                      :14;
    __IO uint32_t IR_POL                    : 1;
    __IO uint32_t HSI2C_LSEL                : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gpioaux_ctrl1_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t TCLK_SEL                  : 2;
    __IO uint32_t TCLK_DIV                  : 2;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_gpioaux_ctrl2_field_t;

typedef struct
{
    __IO uint32_t CTIM0_E                   : 2;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t CTIM1_E                   : 2;
    uint32_t RESERVED5                      : 4;
    __IO uint32_t ATIM3_E                   : 3;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_gpioaux_times_field_t;

typedef struct
{
    __IO uint32_t CTIM0_C0                  : 2;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t CTIM1_C0                  : 2;
    uint32_t RESERVED5                      : 4;
    __IO uint32_t ATIM3_C0A                 : 2;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_gpioaux_timcps_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 5;
    __IO uint32_t PB0FLT_EN                 : 1;
    __IO uint32_t PA8FLT_EN                 : 1;
    __IO uint32_t PA0FLT_EN                 : 1;
    __IO uint32_t FCLK_DIV                  : 2;
    __IO uint32_t FCLK_SEL                  : 1;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_gpioaux_fltcfg_field_t;

typedef struct
{
    __IO uint32_t ARR                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gtim_arr_field_t;

