yuer-12342/sx1280-test/mcu/common/hc32l021.h
typedef struct
{
    __IO uint32_t CNT                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gtim_cnt_field_t;

typedef struct
{
    __IO uint32_t CC0M                      : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t CC1M                      : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t CC2M                      : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t CC3M                      : 3;
    uint32_t RESERVED15                     :16;
    __IO uint32_t RSV                       : 1;
} stc_gtim_cmmr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t ETRFLT                    : 3;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_gtim_cr1_field_t;

typedef struct
{
    __IO uint32_t CEN                       : 1;
    __IO uint32_t MD                        : 2;
    __IO uint32_t TOGEN                     : 1;
    __IO uint32_t PRS                       : 4;
    __IO uint32_t OST                       : 1;
    __IO uint32_t TRS                       : 2;
    __IO uint32_t ETP                       : 1;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_gtim_cr0_field_t;

typedef struct
{
    __IO uint32_t UI                        : 1;
    __IO uint32_t TI                        : 1;
    __IO uint32_t CC0                       : 1;
    __IO uint32_t CC1                       : 1;
    __IO uint32_t CC2                       : 1;
    __IO uint32_t CC3                       : 1;
    uint32_t RESERVED6                      : 4;
    __IO uint32_t OVTRAD                    : 1;
    __IO uint32_t C0TRAD                    : 1;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_gtim_ier_field_t;

typedef struct
{
    __IO uint32_t UI                        : 1;
    __IO uint32_t TI                        : 1;
    __IO uint32_t CC0                       : 1;
    __IO uint32_t CC1                       : 1;
    __IO uint32_t CC2                       : 1;
    __IO uint32_t CC3                       : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_gtim_ifr_field_t;

typedef struct
{
    __IO uint32_t UI                        : 1;
    __IO uint32_t TI                        : 1;
    __IO uint32_t CC0                       : 1;
    __IO uint32_t CC1                       : 1;
    __IO uint32_t CC2                       : 1;
    __IO uint32_t CC3                       : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_gtim_icr_field_t;

typedef struct
{
    __IO uint32_t CCR                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gtim_ccr0_field_t;

typedef struct
{
    __IO uint32_t CCR                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gtim_ccr1_field_t;

typedef struct
{
    __IO uint32_t CCR                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gtim_ccr2_field_t;

typedef struct
{
    __IO uint32_t CCR                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_gtim_ccr3_field_t;

typedef struct
{
    __IO uint32_t MEN                       : 1;
    __IO uint32_t RST                       : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t DBGEN                     : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mcr_field_t;

typedef struct
{
    __IO uint32_t TDF                       : 1;
    __IO uint32_t RDF                       : 1;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t EPF                       : 1;
    __IO uint32_t SDF                       : 1;
    __IO uint32_t NDF                       : 1;
    __IO uint32_t ALF                       : 1;
    __IO uint32_t FEF                       : 1;
    __IO uint32_t PLTF                      : 1;
    __IO uint32_t DMF                       : 1;
    uint32_t RESERVED15                     : 9;
    __IO uint32_t MBF                       : 1;
    __IO uint32_t BBF                       : 1;
    uint32_t RESERVED26                     : 5;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_msr_field_t;

typedef struct
{
    __IO uint32_t TDIE                      : 1;
    __IO uint32_t RDIE                      : 1;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t EPIE                      : 1;
    __IO uint32_t SDIE                      : 1;
    __IO uint32_t NDIE                      : 1;
    __IO uint32_t ALIE                      : 1;
    __IO uint32_t FEIE                      : 1;
    __IO uint32_t PLTIE                     : 1;
    __IO uint32_t DMIE                      : 1;
    uint32_t RESERVED15                     :16;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mier_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 8;
    __IO uint32_t EPC                       : 1;
    __IO uint32_t SDC                       : 1;
    __IO uint32_t NDC                       : 1;
    __IO uint32_t ALC                       : 1;
    __IO uint32_t FEC                       : 1;
    __IO uint32_t PLTC                      : 1;
    __IO uint32_t DMC                       : 1;
    uint32_t RESERVED15                     :16;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mscr_field_t;

typedef struct
{
    __IO uint32_t PRESCALE                  : 3;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t AUTOSTOP                  : 1;
    __IO uint32_t IGNACK                    : 1;
    __IO uint32_t TIMECFG                   : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t RDMO                      : 1;
    __IO uint32_t MATCFG                    : 3;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mcfgr1_field_t;

typedef struct
{
    __IO uint32_t BUSIDLE                   :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t FILTSCL                   : 4;
    uint32_t RESERVED20                     : 3;
    __IO uint32_t FILTBPSCL                 : 1;
    __IO uint32_t FILTSDA                   : 4;
    uint32_t RESERVED28                     : 3;
    __IO uint32_t FILTBPSDA                 : 1;
} stc_hsi2c_mcfgr2_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 8;
    __IO uint32_t PINLOW                    :12;
    uint32_t RESERVED20                     :11;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mcfgr3_field_t;

typedef struct
{
    __IO uint32_t CLKLO                     : 6;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t CLKHI                     : 6;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t SETHOLD                   : 6;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t DATAVD                    : 6;
    uint32_t RESERVED30                     : 1;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mccr0_field_t;

typedef struct
{
    __IO uint32_t CLKLO                     : 6;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t CLKHI                     : 6;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t SETHOLD                   : 6;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t DATAVD                    : 6;
    uint32_t RESERVED30                     : 1;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mccr1_field_t;

typedef struct
{
    __IO uint32_t DATA                      : 8;
    __IO uint32_t CMD                       : 3;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mtdr_field_t;

typedef struct
{
    __IO uint32_t DATA                      : 8;
    uint32_t RESERVED8                      : 6;
    __IO uint32_t RXEMPTY                   : 1;
    uint32_t RESERVED15                     :16;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mrdr_field_t;

typedef struct
{
    __IO uint32_t MATCH0                    : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t MATCH1                    : 8;
    uint32_t RESERVED24                     : 7;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_mdmr_field_t;

typedef struct
{
    __IO uint32_t SEN                       : 1;
    __IO uint32_t RST                       : 1;
    uint32_t RESERVED2                      :29;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_scr0_field_t;

typedef struct
{
    __IO uint32_t TDF                       : 1;
    __IO uint32_t RDF                       : 1;
    __IO uint32_t AVF                       : 1;
    __IO uint32_t TAF                       : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t RSF                       : 1;
    __IO uint32_t SDF                       : 1;
    __IO uint32_t BEF                       : 1;
    __IO uint32_t FEF                       : 1;
    __IO uint32_t AM0F                      : 1;
    __IO uint32_t AM1F                      : 1;
    __IO uint32_t GCF                       : 1;
    __IO uint32_t SARF                      : 1;
    uint32_t RESERVED16                     : 8;
    __IO uint32_t SBF                       : 1;
    __IO uint32_t BBF                       : 1;
    uint32_t RESERVED26                     : 5;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_ssr_field_t;

typedef struct
{
    __IO uint32_t TDIE                      : 1;
    __IO uint32_t RDIE                      : 1;
    __IO uint32_t AVIE                      : 1;
    __IO uint32_t TAIE                      : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t RSIE                      : 1;
    __IO uint32_t SDIE                      : 1;
    __IO uint32_t BEIE                      : 1;
    __IO uint32_t FEIE                      : 1;
    __IO uint32_t AM0IE                     : 1;
    __IO uint32_t AM1IE                     : 1;
    __IO uint32_t GCIE                      : 1;
    __IO uint32_t SARIE                     : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_sier_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 8;
    __IO uint32_t RSC                       : 1;
    __IO uint32_t SDC                       : 1;
    __IO uint32_t BEC                       : 1;
    __IO uint32_t FEC                       : 1;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_sscr_field_t;

typedef struct
{
    __IO uint32_t ADRSTALL                  : 1;
    __IO uint32_t RXSTALL                   : 1;
    __IO uint32_t TXDSTALL                  : 1;
    __IO uint32_t ACKSTALL                  : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t GCEN                      : 1;
    __IO uint32_t SAEN                      : 1;
    __IO uint32_t TXCFG                     : 1;
    __IO uint32_t RXCFG                     : 1;
    __IO uint32_t IGNACK                    : 1;
    __IO uint32_t HSMEN                     : 1;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t ADDRMODE                  : 3;
    uint32_t RESERVED19                     :12;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_scr1_field_t;

typedef struct
{
    __IO uint32_t CLKHOLD                   : 4;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t DATAVD                    : 6;
    __IO uint32_t FILTEN                    : 1;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t FILTSCL                   : 4;
    __IO uint32_t FILTSDA                   : 4;
    uint32_t RESERVED24                     : 7;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_scr2_field_t;

typedef struct
{
    __IO uint32_t TXNACK                    : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_star_field_t;

typedef struct
{
    __IO uint32_t DATA                      : 8;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_stdr_field_t;

typedef struct
{
    __IO uint32_t DATA                      : 8;
    uint32_t RESERVED8                      : 6;
    __IO uint32_t REMP                      : 1;
    __IO uint32_t SOF                       : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_srdr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t ADDR0                     :10;
    uint32_t RESERVED11                     : 6;
    __IO uint32_t ADDR1                     :10;
    uint32_t RESERVED27                     : 4;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_saddr_field_t;

typedef struct
{
    __IO uint32_t RADDR                     :11;
    uint32_t RESERVED11                     : 3;
    __IO uint32_t ANV                       : 1;
    uint32_t RESERVED15                     :16;
    __IO uint32_t RSV                       : 1;
} stc_hsi2c_sasr_field_t;

typedef struct
{
    __IO uint32_t KR                        :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_iwdt_kr_field_t;

typedef struct
{
    __IO uint32_t PRS                       : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t ACTION                    : 1;
    __IO uint32_t PAUSE                     : 1;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_iwdt_cr_field_t;

typedef struct
{
    __IO uint32_t ARR                       :12;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_iwdt_arr_field_t;

typedef struct
{
    __IO uint32_t CRF                       : 1;
    __IO uint32_t ARRF                      : 1;
    __IO uint32_t WINRF                     : 1;
    __IO uint32_t OV                        : 1;
    __IO uint32_t RUN                       : 1;
    uint32_t RESERVED5                      :26;
    __IO uint32_t RSV                       : 1;
} stc_iwdt_sr_field_t;

typedef struct
{
    __IO uint32_t WINR                      :12;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_iwdt_winr_field_t;

typedef struct
{
    __IO uint32_t DATA                      : 8;
    __IO uint32_t DATA8                     : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_sbuf_field_t;

typedef struct
{
    __IO uint32_t RCIE                      : 1;
    __IO uint32_t TCIE                      : 1;
    __IO uint32_t B8CONT                    : 2;
    __IO uint32_t REN                       : 1;
    __IO uint32_t ADRDET                    : 1;
    __IO uint32_t SM                        : 2;
    __IO uint32_t TXEIE                     : 1;
    __IO uint32_t OVER                      : 2;
    __IO uint32_t SCLKSEL                   : 2;
    __IO uint32_t PEIE                      : 1;
    __IO uint32_t STOPBIT                   : 2;
    uint32_t RESERVED16                     : 2;
    __IO uint32_t RTSEN                     : 1;
    __IO uint32_t CTSEN                     : 1;
    __IO uint32_t CTSIE                     : 1;
    __IO uint32_t FEIE                      : 1;
    __IO uint32_t HDSEL                     : 1;
    uint32_t RESERVED23                     : 8;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_scon_field_t;

typedef struct
{
    __IO uint32_t ADDR                      : 8;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_saddr_field_t;

typedef struct
{
    __IO uint32_t MASK                      : 8;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_saden_field_t;

typedef struct
{
    __IO uint32_t RC                        : 1;
    __IO uint32_t TC                        : 1;
    __IO uint32_t FE                        : 1;
    __IO uint32_t TXE                       : 1;
    __IO uint32_t PE                        : 1;
    __IO uint32_t CTSIF                     : 1;
    __IO uint32_t CTS                       : 1;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_isr_field_t;

typedef struct
{
    __IO uint32_t RCCF                      : 1;
    __IO uint32_t TCCF                      : 1;
    __IO uint32_t FECF                      : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t PECF                      : 1;
    __IO uint32_t CTSIFCF                   : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_icr_field_t;

typedef struct
{
    __IO uint32_t SCNT                      :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_scnt_field_t;

typedef struct
{
    __IO uint32_t BSEL                      : 2;
    uint32_t RESERVED2                      :29;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_bsel_field_t;

typedef struct
{
    __IO uint32_t MODU                      :12;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_lpuart_modu_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t ACT                       : 1;
    __IO uint32_t SOURCE                    : 2;
    __IO uint32_t VTDS                      : 4;
    __IO uint32_t DEBOUNCE_TIME             : 4;
    __IO uint32_t FTEN                      : 1;
    __IO uint32_t RTEN                      : 1;
    __IO uint32_t HTEN                      : 1;
    __IO uint32_t IE                        : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t FLT_MODE                  : 2;
    uint32_t RESERVED19                     :12;
    __IO uint32_t RSV                       : 1;
} stc_lvd_cr_field_t;

typedef struct
{
    __IO uint32_t INTF                      : 1;
    __IO uint32_t FLTV                      : 1;
    uint32_t RESERVED2                      :29;
    __IO uint32_t RSV                       : 1;
} stc_lvd_sr_field_t;

typedef struct
{
    __IO uint32_t PRDS                      : 3;
    __IO uint32_t AMPM                      : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t HZ1OE                     : 1;
    __IO uint32_t HZ1SEL                    : 1;
    __IO uint32_t START                     : 1;
    __IO uint32_t PRDX                      : 6;
    __IO uint32_t PRDSEL                    : 1;
    uint32_t RESERVED15                     :16;
    __IO uint32_t RSV                       : 1;
} stc_rtc_cr0_field_t;

typedef struct
{
    __IO uint32_t WAIT                      : 1;
    __IO uint32_t WAITF                     : 1;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t CKSEL                     : 3;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_rtc_cr1_field_t;

typedef struct
{
    __IO uint32_t SECL                      : 4;
    __IO uint32_t SECH                      : 3;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_rtc_sec_field_t;

typedef struct
{
    __IO uint32_t MINL                      : 4;
    __IO uint32_t MINH                      : 3;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_rtc_min_field_t;

typedef struct
{
    __IO uint32_t HOURL                     : 4;
    __IO uint32_t HOURH                     : 2;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_rtc_hour_field_t;

typedef struct
{
    __IO uint32_t WEEK                      : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_rtc_week_field_t;

typedef struct
{
    __IO uint32_t DAYL                      : 4;
    __IO uint32_t DAYH                      : 2;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_rtc_day_field_t;

typedef struct
{
    __IO uint32_t MON                       : 5;
    uint32_t RESERVED5                      :26;
    __IO uint32_t RSV                       : 1;
} stc_rtc_mon_field_t;

typedef struct
{
    __IO uint32_t YEARL                     : 4;
    __IO uint32_t YEARH                     : 4;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_rtc_year_field_t;

typedef struct
{
    __IO uint32_t CR                        :13;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t CSTEPS                    : 1;
    __IO uint32_t EN                        : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_rtc_compen_field_t;

typedef struct
{
    __IO uint32_t PARA                      : 6;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RSV                       : 1;
} stc_rtc_hcomp_field_t;

typedef struct
{
    __IO uint32_t WUCKSEL                   : 3;
    __IO uint32_t TSEDG                     : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t TSE                       : 1;
    __IO uint32_t WUTE                      : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ALMAE                     : 1;
    __IO uint32_t ALMBE                     : 1;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_rtc_cr2_field_t;

typedef struct
{
    __IO uint32_t SECL                      : 4;
    __IO uint32_t SECH                      : 3;
    __IO uint32_t MSKS                      : 1;
    __IO uint32_t MINL                      : 4;
    __IO uint32_t MINH                      : 3;
    __IO uint32_t MSKM                      : 1;
    __IO uint32_t HOURL                     : 4;
    __IO uint32_t HOURH                     : 2;
    uint32_t RESERVED22                     : 1;
    __IO uint32_t MSKH                      : 1;
    __IO uint32_t WEEK                      : 7;
    __IO uint32_t RSV                       : 1;
} stc_rtc_alma_field_t;

typedef struct
{
    __IO uint32_t SECL                      : 4;
    __IO uint32_t SECH                      : 3;
    __IO uint32_t MSKS                      : 1;
    __IO uint32_t MINL                      : 4;
    __IO uint32_t MINH                      : 3;
    __IO uint32_t MSKM                      : 1;
    __IO uint32_t HOURL                     : 4;
    __IO uint32_t HOURH                     : 2;
    uint32_t RESERVED22                     : 1;
    __IO uint32_t MSKH                      : 1;
    __IO uint32_t WEEK                      : 7;
    __IO uint32_t RSV                       : 1;
} stc_rtc_almb_field_t;

