yuer-12342/sx1280-test/mcu/common/hc32l021.h
typedef struct
{
    __IO uint32_t SECL                      : 4;
    __IO uint32_t SECH                      : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t MINL                      : 4;
    __IO uint32_t MINH                      : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t HOURL                     : 4;
    __IO uint32_t HOURH                     : 2;
    uint32_t RESERVED22                     : 9;
    __IO uint32_t RSV                       : 1;
} stc_rtc_tstr_field_t;

typedef struct
{
    __IO uint32_t DAYL                      : 4;
    __IO uint32_t DAYH                      : 2;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t MON                       : 5;
    __IO uint32_t WEEK                      : 3;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_rtc_tsdr_field_t;

typedef struct
{
    __IO uint32_t ARR                       :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_rtc_wutr_field_t;

typedef struct
{
    __IO uint32_t ALMA                      : 1;
    __IO uint32_t ALMB                      : 1;
    __IO uint32_t WU                        : 1;
    __IO uint32_t TS                        : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PRD                       : 1;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_rtc_ier_field_t;

typedef struct
{
    __IO uint32_t ALMA                      : 1;
    __IO uint32_t ALMB                      : 1;
    __IO uint32_t WU                        : 1;
    __IO uint32_t TS                        : 1;
    __IO uint32_t TSOV                      : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t PRD                       : 1;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_rtc_ifr_field_t;

typedef struct
{
    __IO uint32_t ALMA                      : 1;
    __IO uint32_t ALMB                      : 1;
    __IO uint32_t WU                        : 1;
    __IO uint32_t TS                        : 1;
    __IO uint32_t TSOV                      : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t PRD                       : 1;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RSV                       : 1;
} stc_rtc_icr_field_t;

typedef struct
{
    __IO uint32_t WPR                       : 8;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_rtc_wpr_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t BRR                       : 3;
    __IO uint32_t CPHA                      : 1;
    __IO uint32_t CPOL                      : 1;
    __IO uint32_t MSTR                      : 1;
    __IO uint32_t LSBF                      : 1;
    __IO uint32_t WIDTH                     : 4;
    __IO uint32_t SSM                       : 1;
    __IO uint32_t CM                        : 2;
    __IO uint32_t SMP                       : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_spi_cr0_field_t;

typedef struct
{
    __IO uint32_t TXEIE                     : 1;
    __IO uint32_t RXNEIE                    : 1;
    __IO uint32_t SSFIE                     : 1;
    __IO uint32_t SSRIE                     : 1;
    __IO uint32_t UDFIE                     : 1;
    __IO uint32_t OVFIE                     : 1;
    __IO uint32_t SSERRIE                   : 1;
    __IO uint32_t MODFIE                    : 1;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_spi_cr1_field_t;

typedef struct
{
    __IO uint32_t HDOE                      : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RSV                       : 1;
} stc_spi_hdoe_field_t;

typedef struct
{
    __IO uint32_t SSI                       : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RSV                       : 1;
} stc_spi_ssi_field_t;

typedef struct
{
    __IO uint32_t TXE                       : 1;
    __IO uint32_t RXNE                      : 1;
    __IO uint32_t SSF                       : 1;
    __IO uint32_t SSR                       : 1;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t OVF                       : 1;
    __IO uint32_t SSERR                     : 1;
    __IO uint32_t MODF                      : 1;
    __IO uint32_t BUSY                      : 1;
    __IO uint32_t SSLVL                     : 1;
    uint32_t RESERVED10                     :21;
    __IO uint32_t RSV                       : 1;
} stc_spi_sr_field_t;

typedef struct
{
    __IO uint32_t TXE                       : 1;
    __IO uint32_t RXNE                      : 1;
    __IO uint32_t SSF                       : 1;
    __IO uint32_t SSR                       : 1;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t OVF                       : 1;
    __IO uint32_t SSERR                     : 1;
    __IO uint32_t MODF                      : 1;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_spi_icr_field_t;

typedef struct
{
    __IO uint32_t DR                        :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_spi_dr_field_t;

typedef struct
{
    __IO uint32_t RC48M_EN                  : 1;
    uint32_t RESERVED1                      : 1;
    __IO uint32_t RCL_EN                    : 1;
    __IO uint32_t XTL_EN                    : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t CLKSW                     : 3;
    __IO uint32_t HCLK_PRS                  : 3;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t WAKEUP_BYRC48M            : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_sysctrl0_field_t;

typedef struct
{
    __IO uint32_t RESET_USE_IO              : 1;
    __IO uint32_t EXTH_EN                   : 1;
    __IO uint32_t EXTL_EN                   : 1;
    __IO uint32_t XTL_ALWAYS_ON             : 1;
    __IO uint32_t CLOCK_FAULT_EN            : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t LOCKUP_EN                 : 1;
    __IO uint32_t SPI_PCTRL                 : 1;
    __IO uint32_t SWD_USE_IO                : 1;
    __IO uint32_t CTIMER0_FUN_SEL           : 1;
    __IO uint32_t CTIMER1_FUN_SEL           : 1;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_sysctrl1_field_t;

typedef struct
{
    __IO uint32_t SYSCTRL2                  :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_sysctrl2_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t TRIMF                     : 6;
    __IO uint32_t TRIMC                     : 8;
    __IO uint32_t FSEL                      : 2;
    uint32_t RESERVED18                     :13;
    __IO uint32_t STABLE                    : 1;
} stc_sysctrl_rc48m_cr_field_t;

typedef struct
{
    __IO uint32_t TRIM                      :10;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t STABLE                    : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t MSEL                      : 1;
    uint32_t RESERVED17                     :14;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_rcl_cr_field_t;

typedef struct
{
    __IO uint32_t DRIVER                    : 2;
    __IO uint32_t AMP_SEL                   : 2;
    __IO uint32_t STARTUP                   : 2;
    __IO uint32_t STABLE                    : 1;
    __IO uint32_t DETIE                     : 1;
    __IO uint32_t DETTIME                   : 1;
    __IO uint32_t DETEN                     : 1;
    __IO uint32_t FAULT_STATE               : 1;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_xtl_cr_field_t;

typedef struct
{
    __IO uint32_t POR5V                     : 1;
    __IO uint32_t POR15V                    : 1;
    __IO uint32_t LVD_FLAG                  : 1;
    __IO uint32_t IWDT_FLAG                 : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t LOCKUP                    : 1;
    __IO uint32_t SYSREQ                    : 1;
    __IO uint32_t RSTB                      : 1;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_reset_flag_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LPUART0_EN                : 1;
    __IO uint32_t LPUART1_EN                : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t SPI_EN                    : 1;
    uint32_t RESERVED7                      : 4;
    __IO uint32_t ATIM3_EN                  : 1;
    uint32_t RESERVED12                     : 3;
    __IO uint32_t IWDT_EN                   : 1;
    __IO uint32_t ADC_EN                    : 1;
    __IO uint32_t VC_EN                     : 1;
    __IO uint32_t TRNG_EN                   : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t RTC_EN                    : 1;
    uint32_t RESERVED21                     : 7;
    __IO uint32_t GPIO_EN                   : 1;
    uint32_t RESERVED29                     : 1;
    __IO uint32_t HSI2C_EN                  : 1;
    __IO uint32_t FLASH_EN                  : 1;
} stc_sysctrl_peri_clken0_field_t;

typedef struct
{
    __IO uint32_t CTIM0_EN                  : 1;
    __IO uint32_t CTIM1_EN                  : 1;
    __IO uint32_t CTRIM_EN                  : 1;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_peri_clken1_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LPUART0_RST               : 1;
    __IO uint32_t LPUART1_RST               : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t SPI_RST                   : 1;
    uint32_t RESERVED7                      : 4;
    __IO uint32_t ATIM3_RST                 : 1;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t ADC_RST                   : 1;
    __IO uint32_t VC_RST                    : 1;
    __IO uint32_t TRNG_RST                  : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t RTC_RST                   : 1;
    uint32_t RESERVED21                     : 7;
    __IO uint32_t GPIO_RST                  : 1;
    uint32_t RESERVED29                     : 1;
    __IO uint32_t HSI2C_RST                 : 1;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_peri_reset0_field_t;

typedef struct
{
    __IO uint32_t CTIM0_RST                 : 1;
    __IO uint32_t CTIM1_RST                 : 1;
    __IO uint32_t CTRIM_RST                 : 1;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_peri_reset1_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 8;
    __IO uint32_t IWDT_DEBUG                : 1;
    __IO uint32_t RTC_DEBUG                 : 1;
    uint32_t RESERVED10                     : 1;
    __IO uint32_t ATIM3_DEBUG               : 1;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t CTIM0_DEBUG               : 1;
    __IO uint32_t CTIM1_DEBUG               : 1;
    uint32_t RESERVED18                     :13;
    __IO uint32_t RSV                       : 1;
} stc_sysctrl_debug_active_field_t;

typedef struct
{
    __IO uint32_t RNGCIR_EN                 : 1;
    __IO uint32_t RNG_RUN                   : 1;
    uint32_t RESERVED2                      :29;
    __IO uint32_t RSV                       : 1;
} stc_trng_cr_field_t;

typedef struct
{
    __IO uint32_t LOAD                      : 1;
    __IO uint32_t FDBK                      : 1;
    __IO uint32_t CNT                       : 3;
    uint32_t RESERVED5                      :26;
    __IO uint32_t RSV                       : 1;
} stc_trng_mode_field_t;

typedef struct
{
    __IO uint32_t DATA0                     :32;
} stc_trng_data0_field_t;

typedef struct
{
    __IO uint32_t DATA1                     :32;
} stc_trng_data1_field_t;

typedef struct
{
    __IO uint32_t DIV                       : 6;
    __IO uint32_t DIV_EN                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BIAS                      : 2;
    __IO uint32_t HYS                       : 2;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc0_cr0_field_t;

typedef struct
{
    __IO uint32_t PSEL                      : 4;
    __IO uint32_t NSEL                      : 4;
    __IO uint32_t FLTTIME                   : 4;
    __IO uint32_t FALLING                   : 1;
    __IO uint32_t RISING                    : 1;
    __IO uint32_t LEVEL                     : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t EN                        : 1;
    __IO uint32_t FLTCLK                    : 1;
    __IO uint32_t FLT_MODE                  : 2;
    uint32_t RESERVED20                     :11;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc0_cr1_field_t;

typedef struct
{
    __IO uint32_t POL                       : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t ATIM3CLR                  : 1;
    __IO uint32_t ATIMBK                    : 1;
    __IO uint32_t WINDOW                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BLANK                     : 3;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc0_cr2_field_t;

typedef struct
{
    __IO uint32_t INTF                      : 1;
    __IO uint32_t FLTV                      : 1;
    uint32_t RESERVED2                      :29;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc0_sr_field_t;

typedef struct
{
    __IO uint32_t DIV                       : 6;
    __IO uint32_t DIV_EN                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BIAS                      : 2;
    __IO uint32_t HYS                       : 2;
    uint32_t RESERVED12                     :19;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc1_cr0_field_t;

typedef struct
{
    __IO uint32_t PSEL                      : 4;
    __IO uint32_t NSEL                      : 4;
    __IO uint32_t FLTTIME                   : 4;
    __IO uint32_t FALLING                   : 1;
    __IO uint32_t RISING                    : 1;
    __IO uint32_t LEVEL                     : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t EN                        : 1;
    __IO uint32_t FLTCLK                    : 1;
    __IO uint32_t FLT_MODE                  : 2;
    uint32_t RESERVED20                     :11;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc1_cr1_field_t;

typedef struct
{
    __IO uint32_t POL                       : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t ATIM3CLR                  : 1;
    __IO uint32_t ATIMBK                    : 1;
    __IO uint32_t WINDOW                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BLANK                     : 3;
    uint32_t RESERVED11                     :20;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc1_cr2_field_t;

typedef struct
{
    __IO uint32_t INTF                      : 1;
    __IO uint32_t FLTV                      : 1;
    uint32_t RESERVED2                      :29;
    __IO uint32_t RSV                       : 1;
} stc_vc_vc1_sr_field_t;

typedef struct
{
    __IO uint32_t TRIM0                     : 4;
    __IO uint32_t TRIM1                     : 4;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RSV                       : 1;
} stc_vc_trim_field_t;


typedef struct
{
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t CR0;
        stc_adc_cr0_field_t CR0_f;
    };
    uint8_t RESERVED1[56];
    union
    {
        __IO uint32_t SQR0;
        stc_adc_sqr0_field_t SQR0_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint32_t SQR1;
        stc_adc_sqr1_field_t SQR1_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint32_t SQRRESULT0;
        stc_adc_sqrresult0_field_t SQRRESULT0_f;
    };
    union
    {
        __IO uint32_t SQRRESULT1;
        stc_adc_sqrresult1_field_t SQRRESULT1_f;
    };
    union
    {
        __IO uint32_t SQRRESULT2;
        stc_adc_sqrresult2_field_t SQRRESULT2_f;
    };
    union
    {
        __IO uint32_t SQRRESULT3;
        stc_adc_sqrresult3_field_t SQRRESULT3_f;
    };
    uint8_t RESERVED7[80];
    union
    {
        __IO uint32_t IFR;
        stc_adc_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_adc_icr_field_t ICR_f;
    };
    union
    {
        __IO uint32_t EXTTRIGGER;
        stc_adc_exttrigger_field_t EXTTRIGGER_f;
    };
    uint8_t RESERVED10[8];
    union
    {
        __IO uint32_t SQRSTART;
        stc_adc_sqrstart_field_t SQRSTART_f;
    };
}ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ARR;
        stc_atim3_mode0_arr_field_t ARR_f;
    };
    union
    {
        __IO uint32_t CNT;
        stc_atim3_mode0_cnt_field_t CNT_f;
    };
    union
    {
        __IO uint32_t CNT32;
        stc_atim3_mode0_cnt32_field_t CNT32_f;
    };
    union
    {
        __IO uint32_t M0CR;
        stc_atim3_mode0_m0cr_field_t M0CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_atim3_mode0_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_atim3_mode0_iclr_field_t ICLR_f;
    };
    uint8_t RESERVED6[24];
    union
    {
        __IO uint32_t DTR;
        stc_atim3_mode0_dtr_field_t DTR_f;
    };
}ATIM3_MODE0_TypeDef;

typedef struct
{
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t CNT;
        stc_atim3_mode1_cnt_field_t CNT_f;
    };
    uint8_t RESERVED1[4];
    union
    {
        __IO uint32_t M1CR;
        stc_atim3_mode1_m1cr_field_t M1CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_atim3_mode1_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_atim3_mode1_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t MSCR;
        stc_atim3_mode1_mscr_field_t MSCR_f;
    };
    union
    {
        __IO uint32_t FLTR;
        stc_atim3_mode1_fltr_field_t FLTR_f;
    };
    uint8_t RESERVED6[4];
    union
    {
        __IO uint32_t CR0;
        stc_atim3_mode1_cr0_field_t CR0_f;
    };
    uint8_t RESERVED7[20];
    union
    {
        __IO uint32_t CCR0A;
        stc_atim3_mode1_ccr0a_field_t CCR0A_f;
    };
}ATIM3_MODE1_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ARR;
        stc_atim3_mode23_arr_field_t ARR_f;
    };
    union
    {
        __IO uint32_t CNT;
        stc_atim3_mode23_cnt_field_t CNT_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint32_t M23CR;
        stc_atim3_mode23_m23cr_field_t M23CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_atim3_mode23_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_atim3_mode23_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t MSCR;
        stc_atim3_mode23_mscr_field_t MSCR_f;
    };
    union
    {
        __IO uint32_t FLTR;
        stc_atim3_mode23_fltr_field_t FLTR_f;
    };
    union
    {
        __IO uint32_t ADTR;
        stc_atim3_mode23_adtr_field_t ADTR_f;
    };
    union
    {
        __IO uint32_t CRCH0;
        stc_atim3_mode23_crch0_field_t CRCH0_f;
    };
    union
    {
        __IO uint32_t CRCH1;
        stc_atim3_mode23_crch1_field_t CRCH1_f;
    };
    union
    {
        __IO uint32_t CRCH2;
        stc_atim3_mode23_crch2_field_t CRCH2_f;
    };
    union
    {
        __IO uint32_t DTR;
        stc_atim3_mode23_dtr_field_t DTR_f;
    };
    union
    {
        __IO uint32_t RCR;
        stc_atim3_mode23_rcr_field_t RCR_f;
    };
    union
    {
        __IO uint32_t ARRDM;
        stc_atim3_mode23_arrdm_field_t ARRDM_f;
    };
    union
    {
        __IO uint32_t CCR0A;
        stc_atim3_mode23_ccr0a_field_t CCR0A_f;
    };
    union
    {
        __IO uint32_t CCR0B;
        stc_atim3_mode23_ccr0b_field_t CCR0B_f;
    };
    union
    {
        __IO uint32_t CCR1A;
        stc_atim3_mode23_ccr1a_field_t CCR1A_f;
    };
    union
    {
        __IO uint32_t CCR1B;
        stc_atim3_mode23_ccr1b_field_t CCR1B_f;
    };
    union
    {
        __IO uint32_t CCR2A;
        stc_atim3_mode23_ccr2a_field_t CCR2A_f;
    };
    union
    {
        __IO uint32_t CCR2B;
        stc_atim3_mode23_ccr2b_field_t CCR2B_f;
    };
}ATIM3_MODE23_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ARR;
        stc_btim_arr_field_t ARR_f;
    };
    union
    {
        __IO uint32_t CNT;
        stc_btim_cnt_field_t CNT_f;
    };
    uint8_t RESERVED2[8];
    union
    {
        __IO uint32_t CR;
        stc_btim_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t IER;
        stc_btim_ier_field_t IER_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_btim_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_btim_icr_field_t ICR_f;
    };
    uint8_t RESERVED6[40];
    union
    {
        __IO uint32_t AIFR;
        stc_btim_aifr_field_t AIFR_f;
    };
    union
    {
        __IO uint32_t AICR;
        stc_btim_aicr_field_t AICR_f;
    };
}BTIM_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ARR;
        stc_ctrim_arr_field_t ARR_f;
    };
    union
    {
        __IO uint32_t CNT;
        stc_ctrim_cnt_field_t CNT_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint32_t CR0;
        stc_ctrim_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_ctrim_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t IER;
        stc_ctrim_ier_field_t IER_f;
    };
    union
    {
        __IO uint32_t ISR;
        stc_ctrim_isr_field_t ISR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_ctrim_icr_field_t ICR_f;
    };
    union
    {
        __IO uint32_t FCAP;
        stc_ctrim_fcap_field_t FCAP_f;
    };
    union
    {
        __IO uint32_t TVAL;
        stc_ctrim_tval_field_t TVAL_f;
    };
    union
    {
        __IO uint32_t FLIM;
        stc_ctrim_flim_field_t FLIM_f;
    };
}CTRIM_TypeDef;

typedef struct
{
    uint8_t RESERVED0[32];
    union
    {
        __IO uint32_t CR;
        stc_flash_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_flash_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_flash_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t BYPASS;
        stc_flash_bypass_field_t BYPASS_f;
    };
    union
    {
        __IO uint32_t SLOCK0;
        stc_flash_slock0_field_t SLOCK0_f;
    };
    uint8_t RESERVED5[56];
    union
    {
        __IO uint32_t LOCK_ST;
        stc_flash_lock_st_field_t LOCK_ST_f;
    };
}FLASH_TypeDef;

