yuer-12342/sx1280-test/mcu/common/hc32l021.h
typedef struct
{
    union
    {
        __IO uint32_t PIN00_SEL;
        stc_gpio_pin00_sel_field_t PIN00_SEL_f;
    };
    union
    {
        __IO uint32_t PIN01_SEL;
        stc_gpio_pin01_sel_field_t PIN01_SEL_f;
    };
    union
    {
        __IO uint32_t PIN02_SEL;
        stc_gpio_pin02_sel_field_t PIN02_SEL_f;
    };
    union
    {
        __IO uint32_t PIN03_SEL;
        stc_gpio_pin03_sel_field_t PIN03_SEL_f;
    };
    union
    {
        __IO uint32_t PIN04_SEL;
        stc_gpio_pin04_sel_field_t PIN04_SEL_f;
    };
    union
    {
        __IO uint32_t PIN05_SEL;
        stc_gpio_pin05_sel_field_t PIN05_SEL_f;
    };
    union
    {
        __IO uint32_t PIN06_SEL;
        stc_gpio_pin06_sel_field_t PIN06_SEL_f;
    };
    union
    {
        __IO uint32_t PIN07_SEL;
        stc_gpio_pin07_sel_field_t PIN07_SEL_f;
    };
    union
    {
        __IO uint32_t PIN08_SEL;
        stc_gpio_pin08_sel_field_t PIN08_SEL_f;
    };
    union
    {
        __IO uint32_t PIN09_SEL;
        stc_gpio_pin09_sel_field_t PIN09_SEL_f;
    };
    union
    {
        __IO uint32_t PIN10_SEL;
        stc_gpio_pin10_sel_field_t PIN10_SEL_f;
    };
    union
    {
        __IO uint32_t PIN11_SEL;
        stc_gpio_pin11_sel_field_t PIN11_SEL_f;
    };
    union
    {
        __IO uint32_t PIN12_SEL;
        stc_gpio_pin12_sel_field_t PIN12_SEL_f;
    };
    union
    {
        __IO uint32_t PIN13_SEL;
        stc_gpio_pin13_sel_field_t PIN13_SEL_f;
    };
    union
    {
        __IO uint32_t PIN14_SEL;
        stc_gpio_pin14_sel_field_t PIN14_SEL_f;
    };
    union
    {
        __IO uint32_t PIN15_SEL;
        stc_gpio_pin15_sel_field_t PIN15_SEL_f;
    };
    uint8_t RESERVED16[192];
    union
    {
        __IO uint32_t DIR;
        stc_gpio_dir_field_t DIR_f;
    };
    union
    {
        __IO uint32_t IN;
        stc_gpio_in_field_t IN_f;
    };
    union
    {
        __IO uint32_t OUT;
        stc_gpio_out_field_t OUT_f;
    };
    union
    {
        __IO uint32_t ADS;
        stc_gpio_ads_field_t ADS_f;
    };
    union
    {
        __IO uint32_t BSET;
        stc_gpio_bset_field_t BSET_f;
    };
    union
    {
        __IO uint32_t BCLR;
        stc_gpio_bclr_field_t BCLR_f;
    };
    union
    {
        __IO uint32_t BSETCLR;
        stc_gpio_bsetclr_field_t BSETCLR_f;
    };
    uint8_t RESERVED23[4];
    union
    {
        __IO uint32_t PU;
        stc_gpio_pu_field_t PU_f;
    };
    uint8_t RESERVED24[8];
    union
    {
        __IO uint32_t OD;
        stc_gpio_od_field_t OD_f;
    };
    union
    {
        __IO uint32_t HIE;
        stc_gpio_hie_field_t HIE_f;
    };
    union
    {
        __IO uint32_t LIE;
        stc_gpio_lie_field_t LIE_f;
    };
    union
    {
        __IO uint32_t RIE;
        stc_gpio_rie_field_t RIE_f;
    };
    union
    {
        __IO uint32_t FIE;
        stc_gpio_fie_field_t FIE_f;
    };
    uint8_t RESERVED29[192];
    union
    {
        __IO uint32_t STAT;
        stc_gpio_stat_field_t STAT_f;
    };
    uint8_t RESERVED30[12];
    union
    {
        __IO uint32_t ICLR;
        stc_gpio_iclr_field_t ICLR_f;
    };
}GPIO_TypeDef;

typedef struct
{
    uint8_t RESERVED0[772];
    union
    {
        __IO uint32_t CTRL1;
        stc_gpioaux_ctrl1_field_t CTRL1_f;
    };
    union
    {
        __IO uint32_t CTRL2;
        stc_gpioaux_ctrl2_field_t CTRL2_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint32_t TIMES;
        stc_gpioaux_times_field_t TIMES_f;
    };
    union
    {
        __IO uint32_t TIMCPS;
        stc_gpioaux_timcps_field_t TIMCPS_f;
    };
    uint8_t RESERVED4[24];
    union
    {
        __IO uint32_t FLTCFG;
        stc_gpioaux_fltcfg_field_t FLTCFG_f;
    };
}GPIOAUX_TypeDef;

typedef struct
{
    uint8_t RESERVED0[768];
    union
    {
        __IO uint32_t ARR;
        stc_gtim_arr_field_t ARR_f;
    };
    union
    {
        __IO uint32_t CNT;
        stc_gtim_cnt_field_t CNT_f;
    };
    union
    {
        __IO uint32_t CMMR;
        stc_gtim_cmmr_field_t CMMR_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_gtim_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t CR0;
        stc_gtim_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t IER;
        stc_gtim_ier_field_t IER_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_gtim_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_gtim_icr_field_t ICR_f;
    };
    union
    {
        __IO uint32_t CCR0;
        stc_gtim_ccr0_field_t CCR0_f;
    };
    union
    {
        __IO uint32_t CCR1;
        stc_gtim_ccr1_field_t CCR1_f;
    };
    union
    {
        __IO uint32_t CCR2;
        stc_gtim_ccr2_field_t CCR2_f;
    };
    union
    {
        __IO uint32_t CCR3;
        stc_gtim_ccr3_field_t CCR3_f;
    };
}GTIM_TypeDef;

typedef struct
{
    uint8_t RESERVED0[16];
    union
    {
        __IO uint32_t MCR;
        stc_hsi2c_mcr_field_t MCR_f;
    };
    union
    {
        __IO uint32_t MSR;
        stc_hsi2c_msr_field_t MSR_f;
    };
    union
    {
        __IO uint32_t MIER;
        stc_hsi2c_mier_field_t MIER_f;
    };
    union
    {
        __IO uint32_t MSCR;
        stc_hsi2c_mscr_field_t MSCR_f;
    };
    uint8_t RESERVED4[4];
    union
    {
        __IO uint32_t MCFGR1;
        stc_hsi2c_mcfgr1_field_t MCFGR1_f;
    };
    union
    {
        __IO uint32_t MCFGR2;
        stc_hsi2c_mcfgr2_field_t MCFGR2_f;
    };
    union
    {
        __IO uint32_t MCFGR3;
        stc_hsi2c_mcfgr3_field_t MCFGR3_f;
    };
    union
    {
        __IO uint32_t MCCR0;
        stc_hsi2c_mccr0_field_t MCCR0_f;
    };
    union
    {
        __IO uint32_t MCCR1;
        stc_hsi2c_mccr1_field_t MCCR1_f;
    };
    union
    {
        __IO uint32_t MTDR;
        stc_hsi2c_mtdr_field_t MTDR_f;
    };
    union
    {
        __IO uint32_t MRDR;
        stc_hsi2c_mrdr_field_t MRDR_f;
    };
    union
    {
        __IO uint32_t MDMR;
        stc_hsi2c_mdmr_field_t MDMR_f;
    };
    uint8_t RESERVED12[204];
    union
    {
        __IO uint32_t SCR0;
        stc_hsi2c_scr0_field_t SCR0_f;
    };
    union
    {
        __IO uint32_t SSR;
        stc_hsi2c_ssr_field_t SSR_f;
    };
    union
    {
        __IO uint32_t SIER;
        stc_hsi2c_sier_field_t SIER_f;
    };
    union
    {
        __IO uint32_t SSCR;
        stc_hsi2c_sscr_field_t SSCR_f;
    };
    union
    {
        __IO uint32_t SCR1;
        stc_hsi2c_scr1_field_t SCR1_f;
    };
    union
    {
        __IO uint32_t SCR2;
        stc_hsi2c_scr2_field_t SCR2_f;
    };
    union
    {
        __IO uint32_t STAR;
        stc_hsi2c_star_field_t STAR_f;
    };
    union
    {
        __IO uint32_t STDR;
        stc_hsi2c_stdr_field_t STDR_f;
    };
    union
    {
        __IO uint32_t SRDR;
        stc_hsi2c_srdr_field_t SRDR_f;
    };
    uint8_t RESERVED21[12];
    union
    {
        __IO uint32_t SADDR;
        stc_hsi2c_saddr_field_t SADDR_f;
    };
    uint8_t RESERVED22[12];
    union
    {
        __IO uint32_t SASR;
        stc_hsi2c_sasr_field_t SASR_f;
    };
}HSI2C_TypeDef;

typedef struct
{
    uint8_t RESERVED0[128];
    union
    {
        __IO uint32_t KR;
        stc_iwdt_kr_field_t KR_f;
    };
    union
    {
        __IO uint32_t CR;
        stc_iwdt_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t ARR;
        stc_iwdt_arr_field_t ARR_f;
    };
    union
    {
        __IO uint32_t SR;
        stc_iwdt_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t WINR;
        stc_iwdt_winr_field_t WINR_f;
    };
}IWDT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t SBUF;
        stc_lpuart_sbuf_field_t SBUF_f;
    };
    union
    {
        __IO uint32_t SCON;
        stc_lpuart_scon_field_t SCON_f;
    };
    union
    {
        __IO uint32_t SADDR;
        stc_lpuart_saddr_field_t SADDR_f;
    };
    union
    {
        __IO uint32_t SADEN;
        stc_lpuart_saden_field_t SADEN_f;
    };
    union
    {
        __IO uint32_t ISR;
        stc_lpuart_isr_field_t ISR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_lpuart_icr_field_t ICR_f;
    };
    union
    {
        __IO uint32_t SCNT;
        stc_lpuart_scnt_field_t SCNT_f;
    };
    union
    {
        __IO uint32_t BSEL;
        stc_lpuart_bsel_field_t BSEL_f;
    };
    union
    {
        __IO uint32_t MODU;
        stc_lpuart_modu_field_t MODU_f;
    };
}LPUART_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_lvd_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t SR;
        stc_lvd_sr_field_t SR_f;
    };
}LVD_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR0;
        stc_rtc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_rtc_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t SEC;
        stc_rtc_sec_field_t SEC_f;
    };
    union
    {
        __IO uint32_t MIN;
        stc_rtc_min_field_t MIN_f;
    };
    union
    {
        __IO uint32_t HOUR;
        stc_rtc_hour_field_t HOUR_f;
    };
    union
    {
        __IO uint32_t WEEK;
        stc_rtc_week_field_t WEEK_f;
    };
    union
    {
        __IO uint32_t DAY;
        stc_rtc_day_field_t DAY_f;
    };
    union
    {
        __IO uint32_t MON;
        stc_rtc_mon_field_t MON_f;
    };
    union
    {
        __IO uint32_t YEAR;
        stc_rtc_year_field_t YEAR_f;
    };
    uint8_t RESERVED9[12];
    union
    {
        __IO uint32_t COMPEN;
        stc_rtc_compen_field_t COMPEN_f;
    };
    union
    {
        __IO uint32_t HCOMP;
        stc_rtc_hcomp_field_t HCOMP_f;
    };
    uint8_t RESERVED11[4];
    union
    {
        __IO uint32_t CR2;
        stc_rtc_cr2_field_t CR2_f;
    };
    union
    {
        __IO uint32_t ALMA;
        stc_rtc_alma_field_t ALMA_f;
    };
    union
    {
        __IO uint32_t ALMB;
        stc_rtc_almb_field_t ALMB_f;
    };
    union
    {
        __IO uint32_t TSTR;
        stc_rtc_tstr_field_t TSTR_f;
    };
    union
    {
        __IO uint32_t TSDR;
        stc_rtc_tsdr_field_t TSDR_f;
    };
    union
    {
        __IO uint32_t WUTR;
        stc_rtc_wutr_field_t WUTR_f;
    };
    union
    {
        __IO uint32_t IER;
        stc_rtc_ier_field_t IER_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_rtc_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_rtc_icr_field_t ICR_f;
    };
    union
    {
        __IO uint32_t WPR;
        stc_rtc_wpr_field_t WPR_f;
    };
}RTC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR0;
        stc_spi_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_spi_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t HDOE;
        stc_spi_hdoe_field_t HDOE_f;
    };
    union
    {
        __IO uint32_t SSI;
        stc_spi_ssi_field_t SSI_f;
    };
    union
    {
        __IO uint32_t SR;
        stc_spi_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_spi_icr_field_t ICR_f;
    };
    union
    {
        __IO uint32_t DR;
        stc_spi_dr_field_t DR_f;
    };
}SPI_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t SYSCTRL0;
        stc_sysctrl_sysctrl0_field_t SYSCTRL0_f;
    };
    union
    {
        __IO uint32_t SYSCTRL1;
        stc_sysctrl_sysctrl1_field_t SYSCTRL1_f;
    };
    union
    {
        __IO uint32_t SYSCTRL2;
        stc_sysctrl_sysctrl2_field_t SYSCTRL2_f;
    };
    union
    {
        __IO uint32_t RC48M_CR;
        stc_sysctrl_rc48m_cr_field_t RC48M_CR_f;
    };
    uint8_t RESERVED4[4];
    union
    {
        __IO uint32_t RCL_CR;
        stc_sysctrl_rcl_cr_field_t RCL_CR_f;
    };
    union
    {
        __IO uint32_t XTL_CR;
        stc_sysctrl_xtl_cr_field_t XTL_CR_f;
    };
    union
    {
        __IO uint32_t RESET_FLAG;
        stc_sysctrl_reset_flag_field_t RESET_FLAG_f;
    };
    union
    {
        __IO uint32_t PERI_CLKEN0;
        stc_sysctrl_peri_clken0_field_t PERI_CLKEN0_f;
    };
    union
    {
        __IO uint32_t PERI_CLKEN1;
        stc_sysctrl_peri_clken1_field_t PERI_CLKEN1_f;
    };
    union
    {
        __IO uint32_t PERI_RESET0;
        stc_sysctrl_peri_reset0_field_t PERI_RESET0_f;
    };
    union
    {
        __IO uint32_t PERI_RESET1;
        stc_sysctrl_peri_reset1_field_t PERI_RESET1_f;
    };
    uint8_t RESERVED11[8];
    union
    {
        __IO uint32_t DEBUG_ACTIVE;
        stc_sysctrl_debug_active_field_t DEBUG_ACTIVE_f;
    };
}SYSCTRL_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_trng_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t MODE;
        stc_trng_mode_field_t MODE_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint32_t DATA0;
        stc_trng_data0_field_t DATA0_f;
    };
    union
    {
        __IO uint32_t DATA1;
        stc_trng_data1_field_t DATA1_f;
    };
}TRNG_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t VC0_CR0;
        stc_vc_vc0_cr0_field_t VC0_CR0_f;
    };
    union
    {
        __IO uint32_t VC0_CR1;
        stc_vc_vc0_cr1_field_t VC0_CR1_f;
    };
    union
    {
        __IO uint32_t VC0_CR2;
        stc_vc_vc0_cr2_field_t VC0_CR2_f;
    };
    union
    {
        __IO uint32_t VC0_SR;
        stc_vc_vc0_sr_field_t VC0_SR_f;
    };
    union
    {
        __IO uint32_t VC1_CR0;
        stc_vc_vc1_cr0_field_t VC1_CR0_f;
    };
    union
    {
        __IO uint32_t VC1_CR1;
        stc_vc_vc1_cr1_field_t VC1_CR1_f;
    };
    union
    {
        __IO uint32_t VC1_CR2;
        stc_vc_vc1_cr2_field_t VC1_CR2_f;
    };
    union
    {
        __IO uint32_t VC1_SR;
        stc_vc_vc1_sr_field_t VC1_SR_f;
    };
    union
    {
        __IO uint32_t VC_TRIM;
        stc_vc_trim_field_t VC_TRIM_f;
    };
}VC_TypeDef;



#define PERIPH_BASE                        (0x40000000UL)
#define ADC_BASE                               (PERIPH_BASE + 0x00002400UL)
#define ATIM3_MODE0_BASE                       (PERIPH_BASE + 0x00009800UL)
#define ATIM3_MODE1_BASE                       (PERIPH_BASE + 0x00009800UL)
#define ATIM3_MODE23_BASE                      (PERIPH_BASE + 0x00009800UL)
#define BTIM0_BASE                             (PERIPH_BASE + 0x00001800UL)
#define BTIM1_BASE                             (PERIPH_BASE + 0x00001900UL)
#define BTIM2_BASE                             (PERIPH_BASE + 0x00001A00UL)
#define BTIM3_BASE                             (PERIPH_BASE + 0x00001C00UL)
#define BTIM4_BASE                             (PERIPH_BASE + 0x00001D00UL)
#define BTIM5_BASE                             (PERIPH_BASE + 0x00001E00UL)
#define CTRIM_BASE                             (PERIPH_BASE + 0x00009000UL)
#define FLASH_BASE                             (PERIPH_BASE + 0x00020000UL)
#define GPIOA_BASE                             (PERIPH_BASE + 0x00020C00UL)
#define GPIOAUX_BASE                           (PERIPH_BASE + 0x00020C00UL)
#define GPIOB_BASE                             (PERIPH_BASE + 0x00020C40UL)
#define GTIM0_BASE                             (PERIPH_BASE + 0x00001800UL)
#define GTIM1_BASE                             (PERIPH_BASE + 0x00001C00UL)
#define HSI2C_BASE                             (PERIPH_BASE + 0x0000BC00UL)
#define IWDT_BASE                              (PERIPH_BASE + 0x00001000UL)
#define LPUART0_BASE                           (PERIPH_BASE + 0x00000000UL)
#define LPUART1_BASE                           (PERIPH_BASE + 0x00008000UL)
#define LVD_BASE                               (PERIPH_BASE + 0x00002C00UL)
#define RTC_BASE                               (PERIPH_BASE + 0x00001400UL)
#define SPI_BASE                               (PERIPH_BASE + 0x00000800UL)
#define SYSCTRL_BASE                           (PERIPH_BASE + 0x00021800UL)
#define TRNG_BASE                              (PERIPH_BASE + 0x00008C00UL)
#define VC_BASE                                (PERIPH_BASE + 0x00002800UL)


#define ADC                                    ((ADC_TypeDef *)0x40002400UL)
#define ATIM3_MODE0                            ((ATIM3_MODE0_TypeDef *)0x40009800UL)
#define ATIM3_MODE1                            ((ATIM3_MODE1_TypeDef *)0x40009800UL)
#define ATIM3_MODE23                           ((ATIM3_MODE23_TypeDef *)0x40009800UL)
#define BTIM0                                  ((BTIM_TypeDef *)0x40001800UL)
#define BTIM1                                  ((BTIM_TypeDef *)0x40001900UL)
#define BTIM2                                  ((BTIM_TypeDef *)0x40001A00UL)
#define BTIM3                                  ((BTIM_TypeDef *)0x40001C00UL)
#define BTIM4                                  ((BTIM_TypeDef *)0x40001D00UL)
#define BTIM5                                  ((BTIM_TypeDef *)0x40001E00UL)
#define CTRIM                                  ((CTRIM_TypeDef *)0x40009000UL)
#define FLASH                                  ((FLASH_TypeDef *)0x40020000UL)
#define GPIOA                                  ((GPIO_TypeDef *)0x40020C00UL)
#define GPIOAUX                                ((GPIOAUX_TypeDef *)0x40020C00UL)
#define GPIOB                                  ((GPIO_TypeDef *)0x40020C40UL)
#define GTIM0                                  ((GTIM_TypeDef *)0x40001800UL)
#define GTIM1                                  ((GTIM_TypeDef *)0x40001C00UL)
#define HSI2C                                  ((HSI2C_TypeDef *)0x4000BC00UL)
#define IWDT                                   ((IWDT_TypeDef *)0x40001000UL)
#define LPUART0                                ((LPUART_TypeDef *)0x40000000UL)
#define LPUART1                                ((LPUART_TypeDef *)0x40008000UL)
#define LVD                                    ((LVD_TypeDef *)0x40002C00UL)
#define RTC                                    ((RTC_TypeDef *)0x40001400UL)
#define SPI                                    ((SPI_TypeDef *)0x40000800UL)
#define SYSCTRL                                ((SYSCTRL_TypeDef *)0x40021800UL)
#define TRNG                                   ((TRNG_TypeDef *)0x40008C00UL)
#define VC                                     ((VC_TypeDef *)0x40002800UL)


