yuer-12342/sx1280-test/mcu/common/hc32l021.h
//********************    Bits Define For Peripheral ADC    ********************//
// ADC_CR0
#define ADC_CR0_EN_Pos                                      (0U)
#define ADC_CR0_EN_Msk                                      (0x1UL << ADC_CR0_EN_Pos)
#define ADC_CR0_EN                                          ADC_CR0_EN_Msk
#define ADC_CR0_CLKDIV_Pos                                  (2U)
#define ADC_CR0_CLKDIV_Msk                                  (0x3UL << ADC_CR0_CLKDIV_Pos)
#define ADC_CR0_CLKDIV                                      ADC_CR0_CLKDIV_Msk
#define ADC_CR0_REF_Pos                                     (9U)
#define ADC_CR0_REF_Msk                                     (0x1UL << ADC_CR0_REF_Pos)
#define ADC_CR0_REF                                         ADC_CR0_REF_Msk
#define ADC_CR0_IBSEL_Pos                                   (12U)
#define ADC_CR0_IBSEL_Msk                                   (0x3UL << ADC_CR0_IBSEL_Pos)
#define ADC_CR0_IBSEL                                       ADC_CR0_IBSEL_Msk
#define ADC_CR0_IE_Pos                                      (15U)
#define ADC_CR0_IE_Msk                                      (0x1UL << ADC_CR0_IE_Pos)
#define ADC_CR0_IE                                          ADC_CR0_IE_Msk
#define ADC_CR0_SAM_Pos                                     (17U)
#define ADC_CR0_SAM_Msk                                     (0xFUL << ADC_CR0_SAM_Pos)
#define ADC_CR0_SAM                                         ADC_CR0_SAM_Msk

// ADC_SQR0
#define ADC_SQR0_CH0MUX_Pos                                 (0U)
#define ADC_SQR0_CH0MUX_Msk                                 (0xFUL << ADC_SQR0_CH0MUX_Pos)
#define ADC_SQR0_CH0MUX                                     ADC_SQR0_CH0MUX_Msk
#define ADC_SQR0_CH1MUX_Pos                                 (5U)
#define ADC_SQR0_CH1MUX_Msk                                 (0xFUL << ADC_SQR0_CH1MUX_Pos)
#define ADC_SQR0_CH1MUX                                     ADC_SQR0_CH1MUX_Msk
#define ADC_SQR0_CH2MUX_Pos                                 (10U)
#define ADC_SQR0_CH2MUX_Msk                                 (0xFUL << ADC_SQR0_CH2MUX_Pos)
#define ADC_SQR0_CH2MUX                                     ADC_SQR0_CH2MUX_Msk
#define ADC_SQR0_CH3MUX_Pos                                 (15U)
#define ADC_SQR0_CH3MUX_Msk                                 (0xFUL << ADC_SQR0_CH3MUX_Pos)
#define ADC_SQR0_CH3MUX                                     ADC_SQR0_CH3MUX_Msk

// ADC_SQR1
#define ADC_SQR1_CNT_Pos                                    (0U)
#define ADC_SQR1_CNT_Msk                                    (0x3UL << ADC_SQR1_CNT_Pos)
#define ADC_SQR1_CNT                                        ADC_SQR1_CNT_Msk

// ADC_SQRRESULT0
#define ADC_SQRRESULT0_RESULT_Pos                           (0U)
#define ADC_SQRRESULT0_RESULT_Msk                           (0xFFFUL << ADC_SQRRESULT0_RESULT_Pos)
#define ADC_SQRRESULT0_RESULT                               ADC_SQRRESULT0_RESULT_Msk

// ADC_SQRRESULT1
#define ADC_SQRRESULT1_RESULT_Pos                           (0U)
#define ADC_SQRRESULT1_RESULT_Msk                           (0xFFFUL << ADC_SQRRESULT1_RESULT_Pos)
#define ADC_SQRRESULT1_RESULT                               ADC_SQRRESULT1_RESULT_Msk

// ADC_SQRRESULT2
#define ADC_SQRRESULT2_RESULT_Pos                           (0U)
#define ADC_SQRRESULT2_RESULT_Msk                           (0xFFFUL << ADC_SQRRESULT2_RESULT_Pos)
#define ADC_SQRRESULT2_RESULT                               ADC_SQRRESULT2_RESULT_Msk

// ADC_SQRRESULT3
#define ADC_SQRRESULT3_RESULT_Pos                           (0U)
#define ADC_SQRRESULT3_RESULT_Msk                           (0xFFFUL << ADC_SQRRESULT3_RESULT_Pos)
#define ADC_SQRRESULT3_RESULT                               ADC_SQRRESULT3_RESULT_Msk

// ADC_IFR
#define ADC_IFR_SQRIF_Pos                                   (0U)
#define ADC_IFR_SQRIF_Msk                                   (0x1UL << ADC_IFR_SQRIF_Pos)
#define ADC_IFR_SQRIF                                       ADC_IFR_SQRIF_Msk

// ADC_ICR
#define ADC_ICR_SQRIC_Pos                                   (0U)
#define ADC_ICR_SQRIC_Msk                                   (0x1UL << ADC_ICR_SQRIC_Pos)
#define ADC_ICR_SQRIC                                       ADC_ICR_SQRIC_Msk

// ADC_EXTTRIGGER
#define ADC_EXTTRIGGER_EXT_TRIG_EN_Pos                      (0U)
#define ADC_EXTTRIGGER_EXT_TRIG_EN_Msk                      (0xFUL << ADC_EXTTRIGGER_EXT_TRIG_EN_Pos)
#define ADC_EXTTRIGGER_EXT_TRIG_EN                          ADC_EXTTRIGGER_EXT_TRIG_EN_Msk

// ADC_SQRSTART
#define ADC_SQRSTART_START_Pos                              (0U)
#define ADC_SQRSTART_START_Msk                              (0x1UL << ADC_SQRSTART_START_Pos)
#define ADC_SQRSTART_START                                  ADC_SQRSTART_START_Msk



//********************    Bits Define For Peripheral ATIM3_MODE0    ********************//
// ATIM3_MODE0_ARR
#define ATIM3_MODE0_ARR_ARR_Pos                             (0U)
#define ATIM3_MODE0_ARR_ARR_Msk                             (0xFFFFUL << ATIM3_MODE0_ARR_ARR_Pos)
#define ATIM3_MODE0_ARR_ARR                                 ATIM3_MODE0_ARR_ARR_Msk

// ATIM3_MODE0_CNT
#define ATIM3_MODE0_CNT_CNT_Pos                             (0U)
#define ATIM3_MODE0_CNT_CNT_Msk                             (0xFFFFUL << ATIM3_MODE0_CNT_CNT_Pos)
#define ATIM3_MODE0_CNT_CNT                                 ATIM3_MODE0_CNT_CNT_Msk

// ATIM3_MODE0_CNT32
#define ATIM3_MODE0_CNT32_CNT32_Pos                         (0U)
#define ATIM3_MODE0_CNT32_CNT32_Msk                         (0xFFFFFFFFUL << ATIM3_MODE0_CNT32_CNT32_Pos)
#define ATIM3_MODE0_CNT32_CNT32                             ATIM3_MODE0_CNT32_CNT32_Msk

// ATIM3_MODE0_M0CR
#define ATIM3_MODE0_M0CR_CTEN_Pos                           (0U)
#define ATIM3_MODE0_M0CR_CTEN_Msk                           (0x1UL << ATIM3_MODE0_M0CR_CTEN_Pos)
#define ATIM3_MODE0_M0CR_CTEN                               ATIM3_MODE0_M0CR_CTEN_Msk
#define ATIM3_MODE0_M0CR_MD_Pos                             (1U)
#define ATIM3_MODE0_M0CR_MD_Msk                             (0x1UL << ATIM3_MODE0_M0CR_MD_Pos)
#define ATIM3_MODE0_M0CR_MD                                 ATIM3_MODE0_M0CR_MD_Msk
#define ATIM3_MODE0_M0CR_CT_Pos                             (2U)
#define ATIM3_MODE0_M0CR_CT_Msk                             (0x1UL << ATIM3_MODE0_M0CR_CT_Pos)
#define ATIM3_MODE0_M0CR_CT                                 ATIM3_MODE0_M0CR_CT_Msk
#define ATIM3_MODE0_M0CR_TOGEN_Pos                          (3U)
#define ATIM3_MODE0_M0CR_TOGEN_Msk                          (0x1UL << ATIM3_MODE0_M0CR_TOGEN_Pos)
#define ATIM3_MODE0_M0CR_TOGEN                              ATIM3_MODE0_M0CR_TOGEN_Msk
#define ATIM3_MODE0_M0CR_PRS_Pos                            (4U)
#define ATIM3_MODE0_M0CR_PRS_Msk                            (0x7UL << ATIM3_MODE0_M0CR_PRS_Pos)
#define ATIM3_MODE0_M0CR_PRS                                ATIM3_MODE0_M0CR_PRS_Msk
#define ATIM3_MODE0_M0CR_GATE_Pos                           (8U)
#define ATIM3_MODE0_M0CR_GATE_Msk                           (0x1UL << ATIM3_MODE0_M0CR_GATE_Pos)
#define ATIM3_MODE0_M0CR_GATE                               ATIM3_MODE0_M0CR_GATE_Msk
#define ATIM3_MODE0_M0CR_GATEP_Pos                          (9U)
#define ATIM3_MODE0_M0CR_GATEP_Msk                          (0x1UL << ATIM3_MODE0_M0CR_GATEP_Pos)
#define ATIM3_MODE0_M0CR_GATEP                              ATIM3_MODE0_M0CR_GATEP_Msk
#define ATIM3_MODE0_M0CR_UIE_Pos                            (10U)
#define ATIM3_MODE0_M0CR_UIE_Msk                            (0x1UL << ATIM3_MODE0_M0CR_UIE_Pos)
#define ATIM3_MODE0_M0CR_UIE                                ATIM3_MODE0_M0CR_UIE_Msk
#define ATIM3_MODE0_M0CR_MODE_Pos                           (12U)
#define ATIM3_MODE0_M0CR_MODE_Msk                           (0x3UL << ATIM3_MODE0_M0CR_MODE_Pos)
#define ATIM3_MODE0_M0CR_MODE                               ATIM3_MODE0_M0CR_MODE_Msk

// ATIM3_MODE0_IFR
#define ATIM3_MODE0_IFR_UIF_Pos                             (0U)
#define ATIM3_MODE0_IFR_UIF_Msk                             (0x1UL << ATIM3_MODE0_IFR_UIF_Pos)
#define ATIM3_MODE0_IFR_UIF                                 ATIM3_MODE0_IFR_UIF_Msk

