yuer-12342/sx1280-test/mcu/common/hc32l021.h
// ATIM3_MODE0_ICLR
#define ATIM3_MODE0_ICLR_UIF_Pos                            (0U)
#define ATIM3_MODE0_ICLR_UIF_Msk                            (0x1UL << ATIM3_MODE0_ICLR_UIF_Pos)
#define ATIM3_MODE0_ICLR_UIF                                ATIM3_MODE0_ICLR_UIF_Msk

// ATIM3_MODE0_DTR
#define ATIM3_MODE0_DTR_MOE_Pos                             (12U)
#define ATIM3_MODE0_DTR_MOE_Msk                             (0x1UL << ATIM3_MODE0_DTR_MOE_Pos)
#define ATIM3_MODE0_DTR_MOE                                 ATIM3_MODE0_DTR_MOE_Msk



//********************    Bits Define For Peripheral ATIM3_MODE1    ********************//
// ATIM3_MODE1_CNT
#define ATIM3_MODE1_CNT_CNT_Pos                             (0U)
#define ATIM3_MODE1_CNT_CNT_Msk                             (0xFFFFUL << ATIM3_MODE1_CNT_CNT_Pos)
#define ATIM3_MODE1_CNT_CNT                                 ATIM3_MODE1_CNT_CNT_Msk

// ATIM3_MODE1_M1CR
#define ATIM3_MODE1_M1CR_CTEN_Pos                           (0U)
#define ATIM3_MODE1_M1CR_CTEN_Msk                           (0x1UL << ATIM3_MODE1_M1CR_CTEN_Pos)
#define ATIM3_MODE1_M1CR_CTEN                               ATIM3_MODE1_M1CR_CTEN_Msk
#define ATIM3_MODE1_M1CR_CT_Pos                             (2U)
#define ATIM3_MODE1_M1CR_CT_Msk                             (0x1UL << ATIM3_MODE1_M1CR_CT_Pos)
#define ATIM3_MODE1_M1CR_CT                                 ATIM3_MODE1_M1CR_CT_Msk
#define ATIM3_MODE1_M1CR_PRS_Pos                            (4U)
#define ATIM3_MODE1_M1CR_PRS_Msk                            (0x7UL << ATIM3_MODE1_M1CR_PRS_Pos)
#define ATIM3_MODE1_M1CR_PRS                                ATIM3_MODE1_M1CR_PRS_Msk
#define ATIM3_MODE1_M1CR_EDG1ST_Pos                         (8U)
#define ATIM3_MODE1_M1CR_EDG1ST_Msk                         (0x1UL << ATIM3_MODE1_M1CR_EDG1ST_Pos)
#define ATIM3_MODE1_M1CR_EDG1ST                             ATIM3_MODE1_M1CR_EDG1ST_Msk
#define ATIM3_MODE1_M1CR_EDG2ND_Pos                         (9U)
#define ATIM3_MODE1_M1CR_EDG2ND_Msk                         (0x1UL << ATIM3_MODE1_M1CR_EDG2ND_Pos)
#define ATIM3_MODE1_M1CR_EDG2ND                             ATIM3_MODE1_M1CR_EDG2ND_Msk
#define ATIM3_MODE1_M1CR_UIE_Pos                            (10U)
#define ATIM3_MODE1_M1CR_UIE_Msk                            (0x1UL << ATIM3_MODE1_M1CR_UIE_Pos)
#define ATIM3_MODE1_M1CR_UIE                                ATIM3_MODE1_M1CR_UIE_Msk
#define ATIM3_MODE1_M1CR_MODE_Pos                           (12U)
#define ATIM3_MODE1_M1CR_MODE_Msk                           (0x3UL << ATIM3_MODE1_M1CR_MODE_Pos)
#define ATIM3_MODE1_M1CR_MODE                               ATIM3_MODE1_M1CR_MODE_Msk
#define ATIM3_MODE1_M1CR_ONESHOT_Pos                        (14U)
#define ATIM3_MODE1_M1CR_ONESHOT_Msk                        (0x1UL << ATIM3_MODE1_M1CR_ONESHOT_Pos)
#define ATIM3_MODE1_M1CR_ONESHOT                            ATIM3_MODE1_M1CR_ONESHOT_Msk

// ATIM3_MODE1_IFR
#define ATIM3_MODE1_IFR_UIF_Pos                             (0U)
#define ATIM3_MODE1_IFR_UIF_Msk                             (0x1UL << ATIM3_MODE1_IFR_UIF_Pos)
#define ATIM3_MODE1_IFR_UIF                                 ATIM3_MODE1_IFR_UIF_Msk
#define ATIM3_MODE1_IFR_CA0F_Pos                            (2U)
#define ATIM3_MODE1_IFR_CA0F_Msk                            (0x1UL << ATIM3_MODE1_IFR_CA0F_Pos)
#define ATIM3_MODE1_IFR_CA0F                                ATIM3_MODE1_IFR_CA0F_Msk

// ATIM3_MODE1_ICLR
#define ATIM3_MODE1_ICLR_UIF_Pos                            (0U)
#define ATIM3_MODE1_ICLR_UIF_Msk                            (0x1UL << ATIM3_MODE1_ICLR_UIF_Pos)
#define ATIM3_MODE1_ICLR_UIF                                ATIM3_MODE1_ICLR_UIF_Msk
#define ATIM3_MODE1_ICLR_CA0F_Pos                           (2U)
#define ATIM3_MODE1_ICLR_CA0F_Msk                           (0x1UL << ATIM3_MODE1_ICLR_CA0F_Pos)
#define ATIM3_MODE1_ICLR_CA0F                               ATIM3_MODE1_ICLR_CA0F_Msk

// ATIM3_MODE1_MSCR
#define ATIM3_MODE1_MSCR_TS_Pos                             (5U)
#define ATIM3_MODE1_MSCR_TS_Msk                             (0x7UL << ATIM3_MODE1_MSCR_TS_Pos)
#define ATIM3_MODE1_MSCR_TS                                 ATIM3_MODE1_MSCR_TS_Msk
#define ATIM3_MODE1_MSCR_IA0S_Pos                           (11U)
#define ATIM3_MODE1_MSCR_IA0S_Msk                           (0x1UL << ATIM3_MODE1_MSCR_IA0S_Pos)
#define ATIM3_MODE1_MSCR_IA0S                               ATIM3_MODE1_MSCR_IA0S_Msk
#define ATIM3_MODE1_MSCR_IB0S_Pos                           (12U)
#define ATIM3_MODE1_MSCR_IB0S_Msk                           (0x1UL << ATIM3_MODE1_MSCR_IB0S_Pos)
#define ATIM3_MODE1_MSCR_IB0S                               ATIM3_MODE1_MSCR_IB0S_Msk

// ATIM3_MODE1_FLTR
#define ATIM3_MODE1_FLTR_FLTA0_Pos                          (0U)
#define ATIM3_MODE1_FLTR_FLTA0_Msk                          (0x7UL << ATIM3_MODE1_FLTR_FLTA0_Pos)
#define ATIM3_MODE1_FLTR_FLTA0                              ATIM3_MODE1_FLTR_FLTA0_Msk
#define ATIM3_MODE1_FLTR_FLTB0_Pos                          (4U)
#define ATIM3_MODE1_FLTR_FLTB0_Msk                          (0x7UL << ATIM3_MODE1_FLTR_FLTB0_Pos)
#define ATIM3_MODE1_FLTR_FLTB0                              ATIM3_MODE1_FLTR_FLTB0_Msk
#define ATIM3_MODE1_FLTR_FLTET_Pos                          (28U)
#define ATIM3_MODE1_FLTR_FLTET_Msk                          (0x7UL << ATIM3_MODE1_FLTR_FLTET_Pos)
#define ATIM3_MODE1_FLTR_FLTET                              ATIM3_MODE1_FLTR_FLTET_Msk
#define ATIM3_MODE1_FLTR_ETP_Pos                            (31U)
#define ATIM3_MODE1_FLTR_ETP_Msk                            (0x1UL << ATIM3_MODE1_FLTR_ETP_Pos)
#define ATIM3_MODE1_FLTR_ETP                                ATIM3_MODE1_FLTR_ETP_Msk

// ATIM3_MODE1_CR0
#define ATIM3_MODE1_CR0_CSA_Pos                             (4U)
#define ATIM3_MODE1_CR0_CSA_Msk                             (0x1UL << ATIM3_MODE1_CR0_CSA_Pos)
#define ATIM3_MODE1_CR0_CSA                                 ATIM3_MODE1_CR0_CSA_Msk
#define ATIM3_MODE1_CR0_CSB_Pos                             (5U)
#define ATIM3_MODE1_CR0_CSB_Msk                             (0x1UL << ATIM3_MODE1_CR0_CSB_Pos)
#define ATIM3_MODE1_CR0_CSB                                 ATIM3_MODE1_CR0_CSB_Msk
#define ATIM3_MODE1_CR0_CIEA_Pos                            (8U)
#define ATIM3_MODE1_CR0_CIEA_Msk                            (0x1UL << ATIM3_MODE1_CR0_CIEA_Pos)
#define ATIM3_MODE1_CR0_CIEA                                ATIM3_MODE1_CR0_CIEA_Msk

// ATIM3_MODE1_CCR0A
#define ATIM3_MODE1_CCR0A_CCR0A_Pos                         (0U)
#define ATIM3_MODE1_CCR0A_CCR0A_Msk                         (0xFFFFUL << ATIM3_MODE1_CCR0A_CCR0A_Pos)
#define ATIM3_MODE1_CCR0A_CCR0A                             ATIM3_MODE1_CCR0A_CCR0A_Msk



//********************    Bits Define For Peripheral ATIM3_MODE23    ********************//
// ATIM3_MODE23_ARR
#define ATIM3_MODE23_ARR_ARR_Pos                            (0U)
#define ATIM3_MODE23_ARR_ARR_Msk                            (0xFFFFUL << ATIM3_MODE23_ARR_ARR_Pos)
#define ATIM3_MODE23_ARR_ARR                                ATIM3_MODE23_ARR_ARR_Msk

// ATIM3_MODE23_CNT
#define ATIM3_MODE23_CNT_CNT_Pos                            (0U)
#define ATIM3_MODE23_CNT_CNT_Msk                            (0xFFFFUL << ATIM3_MODE23_CNT_CNT_Pos)
#define ATIM3_MODE23_CNT_CNT                                ATIM3_MODE23_CNT_CNT_Msk

// ATIM3_MODE23_M23CR
#define ATIM3_MODE23_M23CR_CTEN_Pos                         (0U)
#define ATIM3_MODE23_M23CR_CTEN_Msk                         (0x1UL << ATIM3_MODE23_M23CR_CTEN_Pos)
#define ATIM3_MODE23_M23CR_CTEN                             ATIM3_MODE23_M23CR_CTEN_Msk
#define ATIM3_MODE23_M23CR_COMP_Pos                         (1U)
#define ATIM3_MODE23_M23CR_COMP_Msk                         (0x1UL << ATIM3_MODE23_M23CR_COMP_Pos)
#define ATIM3_MODE23_M23CR_COMP                             ATIM3_MODE23_M23CR_COMP_Msk
#define ATIM3_MODE23_M23CR_CT_Pos                           (2U)
#define ATIM3_MODE23_M23CR_CT_Msk                           (0x1UL << ATIM3_MODE23_M23CR_CT_Pos)
#define ATIM3_MODE23_M23CR_CT                               ATIM3_MODE23_M23CR_CT_Msk
#define ATIM3_MODE23_M23CR_PWM2S_Pos                        (3U)
#define ATIM3_MODE23_M23CR_PWM2S_Msk                        (0x1UL << ATIM3_MODE23_M23CR_PWM2S_Pos)
#define ATIM3_MODE23_M23CR_PWM2S                            ATIM3_MODE23_M23CR_PWM2S_Msk
#define ATIM3_MODE23_M23CR_PRS_Pos                          (4U)
#define ATIM3_MODE23_M23CR_PRS_Msk                          (0x7UL << ATIM3_MODE23_M23CR_PRS_Pos)
#define ATIM3_MODE23_M23CR_PRS                              ATIM3_MODE23_M23CR_PRS_Msk
#define ATIM3_MODE23_M23CR_BUFPEN_Pos                       (7U)
#define ATIM3_MODE23_M23CR_BUFPEN_Msk                       (0x1UL << ATIM3_MODE23_M23CR_BUFPEN_Pos)
#define ATIM3_MODE23_M23CR_BUFPEN                           ATIM3_MODE23_M23CR_BUFPEN_Msk
#define ATIM3_MODE23_M23CR_CRG_Pos                          (8U)
#define ATIM3_MODE23_M23CR_CRG_Msk                          (0x1UL << ATIM3_MODE23_M23CR_CRG_Pos)
#define ATIM3_MODE23_M23CR_CRG                              ATIM3_MODE23_M23CR_CRG_Msk
#define ATIM3_MODE23_M23CR_CFG_Pos                          (9U)
#define ATIM3_MODE23_M23CR_CFG_Msk                          (0x1UL << ATIM3_MODE23_M23CR_CFG_Pos)
#define ATIM3_MODE23_M23CR_CFG                              ATIM3_MODE23_M23CR_CFG_Msk
#define ATIM3_MODE23_M23CR_UIE_Pos                          (10U)
#define ATIM3_MODE23_M23CR_UIE_Msk                          (0x1UL << ATIM3_MODE23_M23CR_UIE_Pos)
#define ATIM3_MODE23_M23CR_UIE                              ATIM3_MODE23_M23CR_UIE_Msk
#define ATIM3_MODE23_M23CR_UDE_Pos                          (11U)
#define ATIM3_MODE23_M23CR_UDE_Msk                          (0x1UL << ATIM3_MODE23_M23CR_UDE_Pos)
#define ATIM3_MODE23_M23CR_UDE                              ATIM3_MODE23_M23CR_UDE_Msk
#define ATIM3_MODE23_M23CR_MODE_Pos                         (12U)
#define ATIM3_MODE23_M23CR_MODE_Msk                         (0x3UL << ATIM3_MODE23_M23CR_MODE_Pos)
#define ATIM3_MODE23_M23CR_MODE                             ATIM3_MODE23_M23CR_MODE_Msk
#define ATIM3_MODE23_M23CR_ONESHOT_Pos                      (14U)
#define ATIM3_MODE23_M23CR_ONESHOT_Msk                      (0x1UL << ATIM3_MODE23_M23CR_ONESHOT_Pos)
#define ATIM3_MODE23_M23CR_ONESHOT                          ATIM3_MODE23_M23CR_ONESHOT_Msk
#define ATIM3_MODE23_M23CR_CSG_Pos                          (15U)
#define ATIM3_MODE23_M23CR_CSG_Msk                          (0x1UL << ATIM3_MODE23_M23CR_CSG_Pos)
#define ATIM3_MODE23_M23CR_CSG                              ATIM3_MODE23_M23CR_CSG_Msk
#define ATIM3_MODE23_M23CR_OCCS_Pos                         (16U)
#define ATIM3_MODE23_M23CR_OCCS_Msk                         (0x1UL << ATIM3_MODE23_M23CR_OCCS_Pos)
#define ATIM3_MODE23_M23CR_OCCS                             ATIM3_MODE23_M23CR_OCCS_Msk
#define ATIM3_MODE23_M23CR_URS_Pos                          (17U)
#define ATIM3_MODE23_M23CR_URS_Msk                          (0x1UL << ATIM3_MODE23_M23CR_URS_Pos)
#define ATIM3_MODE23_M23CR_URS                              ATIM3_MODE23_M23CR_URS_Msk
#define ATIM3_MODE23_M23CR_TDE_Pos                          (18U)
#define ATIM3_MODE23_M23CR_TDE_Msk                          (0x1UL << ATIM3_MODE23_M23CR_TDE_Pos)
#define ATIM3_MODE23_M23CR_TDE                              ATIM3_MODE23_M23CR_TDE_Msk
#define ATIM3_MODE23_M23CR_TIE_Pos                          (19U)
#define ATIM3_MODE23_M23CR_TIE_Msk                          (0x1UL << ATIM3_MODE23_M23CR_TIE_Pos)
#define ATIM3_MODE23_M23CR_TIE                              ATIM3_MODE23_M23CR_TIE_Msk
#define ATIM3_MODE23_M23CR_BIE_Pos                          (20U)
#define ATIM3_MODE23_M23CR_BIE_Msk                          (0x1UL << ATIM3_MODE23_M23CR_BIE_Pos)
#define ATIM3_MODE23_M23CR_BIE                              ATIM3_MODE23_M23CR_BIE_Msk
#define ATIM3_MODE23_M23CR_CIS_Pos                          (21U)
#define ATIM3_MODE23_M23CR_CIS_Msk                          (0x3UL << ATIM3_MODE23_M23CR_CIS_Pos)
#define ATIM3_MODE23_M23CR_CIS                              ATIM3_MODE23_M23CR_CIS_Msk
#define ATIM3_MODE23_M23CR_OCCE_Pos                         (23U)
#define ATIM3_MODE23_M23CR_OCCE_Msk                         (0x1UL << ATIM3_MODE23_M23CR_OCCE_Pos)
#define ATIM3_MODE23_M23CR_OCCE                             ATIM3_MODE23_M23CR_OCCE_Msk
#define ATIM3_MODE23_M23CR_TG_Pos                           (24U)
#define ATIM3_MODE23_M23CR_TG_Msk                           (0x1UL << ATIM3_MODE23_M23CR_TG_Pos)
#define ATIM3_MODE23_M23CR_TG                               ATIM3_MODE23_M23CR_TG_Msk
#define ATIM3_MODE23_M23CR_UG_Pos                           (25U)
#define ATIM3_MODE23_M23CR_UG_Msk                           (0x1UL << ATIM3_MODE23_M23CR_UG_Pos)
#define ATIM3_MODE23_M23CR_UG                               ATIM3_MODE23_M23CR_UG_Msk
#define ATIM3_MODE23_M23CR_BG_Pos                           (26U)
#define ATIM3_MODE23_M23CR_BG_Msk                           (0x1UL << ATIM3_MODE23_M23CR_BG_Pos)
#define ATIM3_MODE23_M23CR_BG                               ATIM3_MODE23_M23CR_BG_Msk
#define ATIM3_MODE23_M23CR_DIR_Pos                          (27U)
#define ATIM3_MODE23_M23CR_DIR_Msk                          (0x1UL << ATIM3_MODE23_M23CR_DIR_Pos)
#define ATIM3_MODE23_M23CR_DIR                              ATIM3_MODE23_M23CR_DIR_Msk
#define ATIM3_MODE23_M23CR_OVE_Pos                          (28U)
#define ATIM3_MODE23_M23CR_OVE_Msk                          (0x1UL << ATIM3_MODE23_M23CR_OVE_Pos)
#define ATIM3_MODE23_M23CR_OVE                              ATIM3_MODE23_M23CR_OVE_Msk
#define ATIM3_MODE23_M23CR_UNDE_Pos                         (29U)
#define ATIM3_MODE23_M23CR_UNDE_Msk                         (0x1UL << ATIM3_MODE23_M23CR_UNDE_Pos)
#define ATIM3_MODE23_M23CR_UNDE                             ATIM3_MODE23_M23CR_UNDE_Msk

