yuer-12342/sx1280-test/mcu/common/hc32l021.h
// ATIM3_MODE23_IFR
#define ATIM3_MODE23_IFR_UIF_Pos                            (0U)
#define ATIM3_MODE23_IFR_UIF_Msk                            (0x1UL << ATIM3_MODE23_IFR_UIF_Pos)
#define ATIM3_MODE23_IFR_UIF                                ATIM3_MODE23_IFR_UIF_Msk
#define ATIM3_MODE23_IFR_CA0F_Pos                           (2U)
#define ATIM3_MODE23_IFR_CA0F_Msk                           (0x1UL << ATIM3_MODE23_IFR_CA0F_Pos)
#define ATIM3_MODE23_IFR_CA0F                               ATIM3_MODE23_IFR_CA0F_Msk
#define ATIM3_MODE23_IFR_CA1F_Pos                           (3U)
#define ATIM3_MODE23_IFR_CA1F_Msk                           (0x1UL << ATIM3_MODE23_IFR_CA1F_Pos)
#define ATIM3_MODE23_IFR_CA1F                               ATIM3_MODE23_IFR_CA1F_Msk
#define ATIM3_MODE23_IFR_CA2F_Pos                           (4U)
#define ATIM3_MODE23_IFR_CA2F_Msk                           (0x1UL << ATIM3_MODE23_IFR_CA2F_Pos)
#define ATIM3_MODE23_IFR_CA2F                               ATIM3_MODE23_IFR_CA2F_Msk
#define ATIM3_MODE23_IFR_CB0F_Pos                           (5U)
#define ATIM3_MODE23_IFR_CB0F_Msk                           (0x1UL << ATIM3_MODE23_IFR_CB0F_Pos)
#define ATIM3_MODE23_IFR_CB0F                               ATIM3_MODE23_IFR_CB0F_Msk
#define ATIM3_MODE23_IFR_CB1F_Pos                           (6U)
#define ATIM3_MODE23_IFR_CB1F_Msk                           (0x1UL << ATIM3_MODE23_IFR_CB1F_Pos)
#define ATIM3_MODE23_IFR_CB1F                               ATIM3_MODE23_IFR_CB1F_Msk
#define ATIM3_MODE23_IFR_CB2F_Pos                           (7U)
#define ATIM3_MODE23_IFR_CB2F_Msk                           (0x1UL << ATIM3_MODE23_IFR_CB2F_Pos)
#define ATIM3_MODE23_IFR_CB2F                               ATIM3_MODE23_IFR_CB2F_Msk
#define ATIM3_MODE23_IFR_CA0E_Pos                           (8U)
#define ATIM3_MODE23_IFR_CA0E_Msk                           (0x1UL << ATIM3_MODE23_IFR_CA0E_Pos)
#define ATIM3_MODE23_IFR_CA0E                               ATIM3_MODE23_IFR_CA0E_Msk
#define ATIM3_MODE23_IFR_CA1E_Pos                           (9U)
#define ATIM3_MODE23_IFR_CA1E_Msk                           (0x1UL << ATIM3_MODE23_IFR_CA1E_Pos)
#define ATIM3_MODE23_IFR_CA1E                               ATIM3_MODE23_IFR_CA1E_Msk
#define ATIM3_MODE23_IFR_CA2E_Pos                           (10U)
#define ATIM3_MODE23_IFR_CA2E_Msk                           (0x1UL << ATIM3_MODE23_IFR_CA2E_Pos)
#define ATIM3_MODE23_IFR_CA2E                               ATIM3_MODE23_IFR_CA2E_Msk
#define ATIM3_MODE23_IFR_CB0E_Pos                           (11U)
#define ATIM3_MODE23_IFR_CB0E_Msk                           (0x1UL << ATIM3_MODE23_IFR_CB0E_Pos)
#define ATIM3_MODE23_IFR_CB0E                               ATIM3_MODE23_IFR_CB0E_Msk
#define ATIM3_MODE23_IFR_CB1E_Pos                           (12U)
#define ATIM3_MODE23_IFR_CB1E_Msk                           (0x1UL << ATIM3_MODE23_IFR_CB1E_Pos)
#define ATIM3_MODE23_IFR_CB1E                               ATIM3_MODE23_IFR_CB1E_Msk
#define ATIM3_MODE23_IFR_CB2E_Pos                           (13U)
#define ATIM3_MODE23_IFR_CB2E_Msk                           (0x1UL << ATIM3_MODE23_IFR_CB2E_Pos)
#define ATIM3_MODE23_IFR_CB2E                               ATIM3_MODE23_IFR_CB2E_Msk
#define ATIM3_MODE23_IFR_BIF_Pos                            (14U)
#define ATIM3_MODE23_IFR_BIF_Msk                            (0x1UL << ATIM3_MODE23_IFR_BIF_Pos)
#define ATIM3_MODE23_IFR_BIF                                ATIM3_MODE23_IFR_BIF_Msk
#define ATIM3_MODE23_IFR_TIF_Pos                            (15U)
#define ATIM3_MODE23_IFR_TIF_Msk                            (0x1UL << ATIM3_MODE23_IFR_TIF_Pos)
#define ATIM3_MODE23_IFR_TIF                                ATIM3_MODE23_IFR_TIF_Msk
#define ATIM3_MODE23_IFR_OVF_Pos                            (16U)
#define ATIM3_MODE23_IFR_OVF_Msk                            (0x1UL << ATIM3_MODE23_IFR_OVF_Pos)
#define ATIM3_MODE23_IFR_OVF                                ATIM3_MODE23_IFR_OVF_Msk
#define ATIM3_MODE23_IFR_UNDF_Pos                           (17U)
#define ATIM3_MODE23_IFR_UNDF_Msk                           (0x1UL << ATIM3_MODE23_IFR_UNDF_Pos)
#define ATIM3_MODE23_IFR_UNDF                               ATIM3_MODE23_IFR_UNDF_Msk

// ATIM3_MODE23_ICLR
#define ATIM3_MODE23_ICLR_UIF_Pos                           (0U)
#define ATIM3_MODE23_ICLR_UIF_Msk                           (0x1UL << ATIM3_MODE23_ICLR_UIF_Pos)
#define ATIM3_MODE23_ICLR_UIF                               ATIM3_MODE23_ICLR_UIF_Msk
#define ATIM3_MODE23_ICLR_CA0F_Pos                          (2U)
#define ATIM3_MODE23_ICLR_CA0F_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CA0F_Pos)
#define ATIM3_MODE23_ICLR_CA0F                              ATIM3_MODE23_ICLR_CA0F_Msk
#define ATIM3_MODE23_ICLR_CA1F_Pos                          (3U)
#define ATIM3_MODE23_ICLR_CA1F_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CA1F_Pos)
#define ATIM3_MODE23_ICLR_CA1F                              ATIM3_MODE23_ICLR_CA1F_Msk
#define ATIM3_MODE23_ICLR_CA2F_Pos                          (4U)
#define ATIM3_MODE23_ICLR_CA2F_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CA2F_Pos)
#define ATIM3_MODE23_ICLR_CA2F                              ATIM3_MODE23_ICLR_CA2F_Msk
#define ATIM3_MODE23_ICLR_CB0F_Pos                          (5U)
#define ATIM3_MODE23_ICLR_CB0F_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CB0F_Pos)
#define ATIM3_MODE23_ICLR_CB0F                              ATIM3_MODE23_ICLR_CB0F_Msk
#define ATIM3_MODE23_ICLR_CB1F_Pos                          (6U)
#define ATIM3_MODE23_ICLR_CB1F_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CB1F_Pos)
#define ATIM3_MODE23_ICLR_CB1F                              ATIM3_MODE23_ICLR_CB1F_Msk
#define ATIM3_MODE23_ICLR_CB2F_Pos                          (7U)
#define ATIM3_MODE23_ICLR_CB2F_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CB2F_Pos)
#define ATIM3_MODE23_ICLR_CB2F                              ATIM3_MODE23_ICLR_CB2F_Msk
#define ATIM3_MODE23_ICLR_CA0E_Pos                          (8U)
#define ATIM3_MODE23_ICLR_CA0E_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CA0E_Pos)
#define ATIM3_MODE23_ICLR_CA0E                              ATIM3_MODE23_ICLR_CA0E_Msk
#define ATIM3_MODE23_ICLR_CA1E_Pos                          (9U)
#define ATIM3_MODE23_ICLR_CA1E_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CA1E_Pos)
#define ATIM3_MODE23_ICLR_CA1E                              ATIM3_MODE23_ICLR_CA1E_Msk
#define ATIM3_MODE23_ICLR_CA2E_Pos                          (10U)
#define ATIM3_MODE23_ICLR_CA2E_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CA2E_Pos)
#define ATIM3_MODE23_ICLR_CA2E                              ATIM3_MODE23_ICLR_CA2E_Msk
#define ATIM3_MODE23_ICLR_CB0E_Pos                          (11U)
#define ATIM3_MODE23_ICLR_CB0E_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CB0E_Pos)
#define ATIM3_MODE23_ICLR_CB0E                              ATIM3_MODE23_ICLR_CB0E_Msk
#define ATIM3_MODE23_ICLR_CB1E_Pos                          (12U)
#define ATIM3_MODE23_ICLR_CB1E_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CB1E_Pos)
#define ATIM3_MODE23_ICLR_CB1E                              ATIM3_MODE23_ICLR_CB1E_Msk
#define ATIM3_MODE23_ICLR_CB2E_Pos                          (13U)
#define ATIM3_MODE23_ICLR_CB2E_Msk                          (0x1UL << ATIM3_MODE23_ICLR_CB2E_Pos)
#define ATIM3_MODE23_ICLR_CB2E                              ATIM3_MODE23_ICLR_CB2E_Msk
#define ATIM3_MODE23_ICLR_BIF_Pos                           (14U)
#define ATIM3_MODE23_ICLR_BIF_Msk                           (0x1UL << ATIM3_MODE23_ICLR_BIF_Pos)
#define ATIM3_MODE23_ICLR_BIF                               ATIM3_MODE23_ICLR_BIF_Msk
#define ATIM3_MODE23_ICLR_TIF_Pos                           (15U)
#define ATIM3_MODE23_ICLR_TIF_Msk                           (0x1UL << ATIM3_MODE23_ICLR_TIF_Pos)
#define ATIM3_MODE23_ICLR_TIF                               ATIM3_MODE23_ICLR_TIF_Msk
#define ATIM3_MODE23_ICLR_OVF_Pos                           (16U)
#define ATIM3_MODE23_ICLR_OVF_Msk                           (0x1UL << ATIM3_MODE23_ICLR_OVF_Pos)
#define ATIM3_MODE23_ICLR_OVF                               ATIM3_MODE23_ICLR_OVF_Msk
#define ATIM3_MODE23_ICLR_UNDF_Pos                          (17U)
#define ATIM3_MODE23_ICLR_UNDF_Msk                          (0x1UL << ATIM3_MODE23_ICLR_UNDF_Pos)
#define ATIM3_MODE23_ICLR_UNDF                              ATIM3_MODE23_ICLR_UNDF_Msk

// ATIM3_MODE23_MSCR
#define ATIM3_MODE23_MSCR_MMS_Pos                           (0U)
#define ATIM3_MODE23_MSCR_MMS_Msk                           (0x7UL << ATIM3_MODE23_MSCR_MMS_Pos)
#define ATIM3_MODE23_MSCR_MMS                               ATIM3_MODE23_MSCR_MMS_Msk
#define ATIM3_MODE23_MSCR_MSM_Pos                           (4U)
#define ATIM3_MODE23_MSCR_MSM_Msk                           (0x1UL << ATIM3_MODE23_MSCR_MSM_Pos)
#define ATIM3_MODE23_MSCR_MSM                               ATIM3_MODE23_MSCR_MSM_Msk
#define ATIM3_MODE23_MSCR_TS_Pos                            (5U)
#define ATIM3_MODE23_MSCR_TS_Msk                            (0x7UL << ATIM3_MODE23_MSCR_TS_Pos)
#define ATIM3_MODE23_MSCR_TS                                ATIM3_MODE23_MSCR_TS_Msk
#define ATIM3_MODE23_MSCR_SMS_Pos                           (8U)
#define ATIM3_MODE23_MSCR_SMS_Msk                           (0x7UL << ATIM3_MODE23_MSCR_SMS_Pos)
#define ATIM3_MODE23_MSCR_SMS                               ATIM3_MODE23_MSCR_SMS_Msk
#define ATIM3_MODE23_MSCR_IA0S_Pos                          (11U)
#define ATIM3_MODE23_MSCR_IA0S_Msk                          (0x1UL << ATIM3_MODE23_MSCR_IA0S_Pos)
#define ATIM3_MODE23_MSCR_IA0S                              ATIM3_MODE23_MSCR_IA0S_Msk
#define ATIM3_MODE23_MSCR_IB0S_Pos                          (12U)
#define ATIM3_MODE23_MSCR_IB0S_Msk                          (0x1UL << ATIM3_MODE23_MSCR_IB0S_Pos)
#define ATIM3_MODE23_MSCR_IB0S                              ATIM3_MODE23_MSCR_IB0S_Msk

// ATIM3_MODE23_FLTR
#define ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos                   (0U)
#define ATIM3_MODE23_FLTR_OCMA0_FLTA0_Msk                   (0x7UL << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos)
#define ATIM3_MODE23_FLTR_OCMA0_FLTA0                       ATIM3_MODE23_FLTR_OCMA0_FLTA0_Msk
#define ATIM3_MODE23_FLTR_CCPA0_Pos                         (3U)
#define ATIM3_MODE23_FLTR_CCPA0_Msk                         (0x1UL << ATIM3_MODE23_FLTR_CCPA0_Pos)
#define ATIM3_MODE23_FLTR_CCPA0                             ATIM3_MODE23_FLTR_CCPA0_Msk
#define ATIM3_MODE23_FLTR_OCMB0_FLTB0_Pos                   (4U)
#define ATIM3_MODE23_FLTR_OCMB0_FLTB0_Msk                   (0x7UL << ATIM3_MODE23_FLTR_OCMB0_FLTB0_Pos)
#define ATIM3_MODE23_FLTR_OCMB0_FLTB0                       ATIM3_MODE23_FLTR_OCMB0_FLTB0_Msk
#define ATIM3_MODE23_FLTR_CCPB0_Pos                         (7U)
#define ATIM3_MODE23_FLTR_CCPB0_Msk                         (0x1UL << ATIM3_MODE23_FLTR_CCPB0_Pos)
#define ATIM3_MODE23_FLTR_CCPB0                             ATIM3_MODE23_FLTR_CCPB0_Msk
#define ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos                   (8U)
#define ATIM3_MODE23_FLTR_OCMA1_FLTA1_Msk                   (0x7UL << ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos)
#define ATIM3_MODE23_FLTR_OCMA1_FLTA1                       ATIM3_MODE23_FLTR_OCMA1_FLTA1_Msk
#define ATIM3_MODE23_FLTR_CCPA1_Pos                         (11U)
#define ATIM3_MODE23_FLTR_CCPA1_Msk                         (0x1UL << ATIM3_MODE23_FLTR_CCPA1_Pos)
#define ATIM3_MODE23_FLTR_CCPA1                             ATIM3_MODE23_FLTR_CCPA1_Msk
#define ATIM3_MODE23_FLTR_OCMB1_FLTB1_Pos                   (12U)
#define ATIM3_MODE23_FLTR_OCMB1_FLTB1_Msk                   (0x7UL << ATIM3_MODE23_FLTR_OCMB1_FLTB1_Pos)
#define ATIM3_MODE23_FLTR_OCMB1_FLTB1                       ATIM3_MODE23_FLTR_OCMB1_FLTB1_Msk
#define ATIM3_MODE23_FLTR_CCPB1_Pos                         (15U)
#define ATIM3_MODE23_FLTR_CCPB1_Msk                         (0x1UL << ATIM3_MODE23_FLTR_CCPB1_Pos)
#define ATIM3_MODE23_FLTR_CCPB1                             ATIM3_MODE23_FLTR_CCPB1_Msk
#define ATIM3_MODE23_FLTR_OCMA2_FLTA2_Pos                   (16U)
#define ATIM3_MODE23_FLTR_OCMA2_FLTA2_Msk                   (0x7UL << ATIM3_MODE23_FLTR_OCMA2_FLTA2_Pos)
#define ATIM3_MODE23_FLTR_OCMA2_FLTA2                       ATIM3_MODE23_FLTR_OCMA2_FLTA2_Msk
#define ATIM3_MODE23_FLTR_CCPA2_Pos                         (19U)
#define ATIM3_MODE23_FLTR_CCPA2_Msk                         (0x1UL << ATIM3_MODE23_FLTR_CCPA2_Pos)
#define ATIM3_MODE23_FLTR_CCPA2                             ATIM3_MODE23_FLTR_CCPA2_Msk
#define ATIM3_MODE23_FLTR_OCMB2_FLTB2_Pos                   (20U)
#define ATIM3_MODE23_FLTR_OCMB2_FLTB2_Msk                   (0x7UL << ATIM3_MODE23_FLTR_OCMB2_FLTB2_Pos)
#define ATIM3_MODE23_FLTR_OCMB2_FLTB2                       ATIM3_MODE23_FLTR_OCMB2_FLTB2_Msk
#define ATIM3_MODE23_FLTR_CCPB2_Pos                         (23U)
#define ATIM3_MODE23_FLTR_CCPB2_Msk                         (0x1UL << ATIM3_MODE23_FLTR_CCPB2_Pos)
#define ATIM3_MODE23_FLTR_CCPB2                             ATIM3_MODE23_FLTR_CCPB2_Msk
#define ATIM3_MODE23_FLTR_FLTBK_Pos                         (24U)
#define ATIM3_MODE23_FLTR_FLTBK_Msk                         (0x7UL << ATIM3_MODE23_FLTR_FLTBK_Pos)
#define ATIM3_MODE23_FLTR_FLTBK                             ATIM3_MODE23_FLTR_FLTBK_Msk
#define ATIM3_MODE23_FLTR_BKP_Pos                           (27U)
#define ATIM3_MODE23_FLTR_BKP_Msk                           (0x1UL << ATIM3_MODE23_FLTR_BKP_Pos)
#define ATIM3_MODE23_FLTR_BKP                               ATIM3_MODE23_FLTR_BKP_Msk
#define ATIM3_MODE23_FLTR_FLTET_Pos                         (28U)
#define ATIM3_MODE23_FLTR_FLTET_Msk                         (0x7UL << ATIM3_MODE23_FLTR_FLTET_Pos)
#define ATIM3_MODE23_FLTR_FLTET                             ATIM3_MODE23_FLTR_FLTET_Msk
#define ATIM3_MODE23_FLTR_ETP_Pos                           (31U)
#define ATIM3_MODE23_FLTR_ETP_Msk                           (0x1UL << ATIM3_MODE23_FLTR_ETP_Pos)
#define ATIM3_MODE23_FLTR_ETP                               ATIM3_MODE23_FLTR_ETP_Msk

