yuer-12342/sx1280-test/mcu/common/hc32l021.h
// ATIM3_MODE23_ADTR
#define ATIM3_MODE23_ADTR_UEVE_Pos                          (0U)
#define ATIM3_MODE23_ADTR_UEVE_Msk                          (0x1UL << ATIM3_MODE23_ADTR_UEVE_Pos)
#define ATIM3_MODE23_ADTR_UEVE                              ATIM3_MODE23_ADTR_UEVE_Msk
#define ATIM3_MODE23_ADTR_CMA0E_Pos                         (1U)
#define ATIM3_MODE23_ADTR_CMA0E_Msk                         (0x1UL << ATIM3_MODE23_ADTR_CMA0E_Pos)
#define ATIM3_MODE23_ADTR_CMA0E                             ATIM3_MODE23_ADTR_CMA0E_Msk
#define ATIM3_MODE23_ADTR_CMA1E_Pos                         (2U)
#define ATIM3_MODE23_ADTR_CMA1E_Msk                         (0x1UL << ATIM3_MODE23_ADTR_CMA1E_Pos)
#define ATIM3_MODE23_ADTR_CMA1E                             ATIM3_MODE23_ADTR_CMA1E_Msk
#define ATIM3_MODE23_ADTR_CMA2E_Pos                         (3U)
#define ATIM3_MODE23_ADTR_CMA2E_Msk                         (0x1UL << ATIM3_MODE23_ADTR_CMA2E_Pos)
#define ATIM3_MODE23_ADTR_CMA2E                             ATIM3_MODE23_ADTR_CMA2E_Msk
#define ATIM3_MODE23_ADTR_CMB0E_Pos                         (4U)
#define ATIM3_MODE23_ADTR_CMB0E_Msk                         (0x1UL << ATIM3_MODE23_ADTR_CMB0E_Pos)
#define ATIM3_MODE23_ADTR_CMB0E                             ATIM3_MODE23_ADTR_CMB0E_Msk
#define ATIM3_MODE23_ADTR_CMB1E_Pos                         (5U)
#define ATIM3_MODE23_ADTR_CMB1E_Msk                         (0x1UL << ATIM3_MODE23_ADTR_CMB1E_Pos)
#define ATIM3_MODE23_ADTR_CMB1E                             ATIM3_MODE23_ADTR_CMB1E_Msk
#define ATIM3_MODE23_ADTR_CMB2E_Pos                         (6U)
#define ATIM3_MODE23_ADTR_CMB2E_Msk                         (0x1UL << ATIM3_MODE23_ADTR_CMB2E_Pos)
#define ATIM3_MODE23_ADTR_CMB2E                             ATIM3_MODE23_ADTR_CMB2E_Msk
#define ATIM3_MODE23_ADTR_ADTE_Pos                          (7U)
#define ATIM3_MODE23_ADTR_ADTE_Msk                          (0x1UL << ATIM3_MODE23_ADTR_ADTE_Pos)
#define ATIM3_MODE23_ADTR_ADTE                              ATIM3_MODE23_ADTR_ADTE_Msk

// ATIM3_MODE23_CRCH0
#define ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos                 (0U)
#define ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Msk                 (0x3UL << ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos)
#define ATIM3_MODE23_CRCH0_CFA_CRA_BKSA                     ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Msk
#define ATIM3_MODE23_CRCH0_CFB_CRB_BKSB_Pos                 (2U)
#define ATIM3_MODE23_CRCH0_CFB_CRB_BKSB_Msk                 (0x3UL << ATIM3_MODE23_CRCH0_CFB_CRB_BKSB_Pos)
#define ATIM3_MODE23_CRCH0_CFB_CRB_BKSB                     ATIM3_MODE23_CRCH0_CFB_CRB_BKSB_Msk
#define ATIM3_MODE23_CRCH0_CSA_Pos                          (4U)
#define ATIM3_MODE23_CRCH0_CSA_Msk                          (0x1UL << ATIM3_MODE23_CRCH0_CSA_Pos)
#define ATIM3_MODE23_CRCH0_CSA                              ATIM3_MODE23_CRCH0_CSA_Msk
#define ATIM3_MODE23_CRCH0_CSB_Pos                          (5U)
#define ATIM3_MODE23_CRCH0_CSB_Msk                          (0x1UL << ATIM3_MODE23_CRCH0_CSB_Pos)
#define ATIM3_MODE23_CRCH0_CSB                              ATIM3_MODE23_CRCH0_CSB_Msk
#define ATIM3_MODE23_CRCH0_BUFEA_Pos                        (6U)
#define ATIM3_MODE23_CRCH0_BUFEA_Msk                        (0x1UL << ATIM3_MODE23_CRCH0_BUFEA_Pos)
#define ATIM3_MODE23_CRCH0_BUFEA                            ATIM3_MODE23_CRCH0_BUFEA_Msk
#define ATIM3_MODE23_CRCH0_BUFEB_Pos                        (7U)
#define ATIM3_MODE23_CRCH0_BUFEB_Msk                        (0x1UL << ATIM3_MODE23_CRCH0_BUFEB_Pos)
#define ATIM3_MODE23_CRCH0_BUFEB                            ATIM3_MODE23_CRCH0_BUFEB_Msk
#define ATIM3_MODE23_CRCH0_CIEA_Pos                         (8U)
#define ATIM3_MODE23_CRCH0_CIEA_Msk                         (0x1UL << ATIM3_MODE23_CRCH0_CIEA_Pos)
#define ATIM3_MODE23_CRCH0_CIEA                             ATIM3_MODE23_CRCH0_CIEA_Msk
#define ATIM3_MODE23_CRCH0_CIEB_Pos                         (9U)
#define ATIM3_MODE23_CRCH0_CIEB_Msk                         (0x1UL << ATIM3_MODE23_CRCH0_CIEB_Pos)
#define ATIM3_MODE23_CRCH0_CIEB                             ATIM3_MODE23_CRCH0_CIEB_Msk
#define ATIM3_MODE23_CRCH0_CISB_Pos                         (12U)
#define ATIM3_MODE23_CRCH0_CISB_Msk                         (0x3UL << ATIM3_MODE23_CRCH0_CISB_Pos)
#define ATIM3_MODE23_CRCH0_CISB                             ATIM3_MODE23_CRCH0_CISB_Msk
#define ATIM3_MODE23_CRCH0_CCGA_Pos                         (14U)
#define ATIM3_MODE23_CRCH0_CCGA_Msk                         (0x1UL << ATIM3_MODE23_CRCH0_CCGA_Pos)
#define ATIM3_MODE23_CRCH0_CCGA                             ATIM3_MODE23_CRCH0_CCGA_Msk
#define ATIM3_MODE23_CRCH0_CCGB_Pos                         (15U)
#define ATIM3_MODE23_CRCH0_CCGB_Msk                         (0x1UL << ATIM3_MODE23_CRCH0_CCGB_Pos)
#define ATIM3_MODE23_CRCH0_CCGB                             ATIM3_MODE23_CRCH0_CCGB_Msk

// ATIM3_MODE23_CRCH1
#define ATIM3_MODE23_CRCH1_CFA_CRA_BKSA_Pos                 (0U)
#define ATIM3_MODE23_CRCH1_CFA_CRA_BKSA_Msk                 (0x3UL << ATIM3_MODE23_CRCH1_CFA_CRA_BKSA_Pos)
#define ATIM3_MODE23_CRCH1_CFA_CRA_BKSA                     ATIM3_MODE23_CRCH1_CFA_CRA_BKSA_Msk
#define ATIM3_MODE23_CRCH1_CFB_CRB_BKSB_Pos                 (2U)
#define ATIM3_MODE23_CRCH1_CFB_CRB_BKSB_Msk                 (0x3UL << ATIM3_MODE23_CRCH1_CFB_CRB_BKSB_Pos)
#define ATIM3_MODE23_CRCH1_CFB_CRB_BKSB                     ATIM3_MODE23_CRCH1_CFB_CRB_BKSB_Msk
#define ATIM3_MODE23_CRCH1_CSA_Pos                          (4U)
#define ATIM3_MODE23_CRCH1_CSA_Msk                          (0x1UL << ATIM3_MODE23_CRCH1_CSA_Pos)
#define ATIM3_MODE23_CRCH1_CSA                              ATIM3_MODE23_CRCH1_CSA_Msk
#define ATIM3_MODE23_CRCH1_CSB_Pos                          (5U)
#define ATIM3_MODE23_CRCH1_CSB_Msk                          (0x1UL << ATIM3_MODE23_CRCH1_CSB_Pos)
#define ATIM3_MODE23_CRCH1_CSB                              ATIM3_MODE23_CRCH1_CSB_Msk
#define ATIM3_MODE23_CRCH1_BUFEA_Pos                        (6U)
#define ATIM3_MODE23_CRCH1_BUFEA_Msk                        (0x1UL << ATIM3_MODE23_CRCH1_BUFEA_Pos)
#define ATIM3_MODE23_CRCH1_BUFEA                            ATIM3_MODE23_CRCH1_BUFEA_Msk
#define ATIM3_MODE23_CRCH1_BUFEB_Pos                        (7U)
#define ATIM3_MODE23_CRCH1_BUFEB_Msk                        (0x1UL << ATIM3_MODE23_CRCH1_BUFEB_Pos)
#define ATIM3_MODE23_CRCH1_BUFEB                            ATIM3_MODE23_CRCH1_BUFEB_Msk
#define ATIM3_MODE23_CRCH1_CIEA_Pos                         (8U)
#define ATIM3_MODE23_CRCH1_CIEA_Msk                         (0x1UL << ATIM3_MODE23_CRCH1_CIEA_Pos)
#define ATIM3_MODE23_CRCH1_CIEA                             ATIM3_MODE23_CRCH1_CIEA_Msk
#define ATIM3_MODE23_CRCH1_CIEB_Pos                         (9U)
#define ATIM3_MODE23_CRCH1_CIEB_Msk                         (0x1UL << ATIM3_MODE23_CRCH1_CIEB_Pos)
#define ATIM3_MODE23_CRCH1_CIEB                             ATIM3_MODE23_CRCH1_CIEB_Msk
#define ATIM3_MODE23_CRCH1_CISB_Pos                         (12U)
#define ATIM3_MODE23_CRCH1_CISB_Msk                         (0x3UL << ATIM3_MODE23_CRCH1_CISB_Pos)
#define ATIM3_MODE23_CRCH1_CISB                             ATIM3_MODE23_CRCH1_CISB_Msk
#define ATIM3_MODE23_CRCH1_CCGA_Pos                         (14U)
#define ATIM3_MODE23_CRCH1_CCGA_Msk                         (0x1UL << ATIM3_MODE23_CRCH1_CCGA_Pos)
#define ATIM3_MODE23_CRCH1_CCGA                             ATIM3_MODE23_CRCH1_CCGA_Msk
#define ATIM3_MODE23_CRCH1_CCGB_Pos                         (15U)
#define ATIM3_MODE23_CRCH1_CCGB_Msk                         (0x1UL << ATIM3_MODE23_CRCH1_CCGB_Pos)
#define ATIM3_MODE23_CRCH1_CCGB                             ATIM3_MODE23_CRCH1_CCGB_Msk

// ATIM3_MODE23_CRCH2
#define ATIM3_MODE23_CRCH2_CFA_CRA_BKSA_Pos                 (0U)
#define ATIM3_MODE23_CRCH2_CFA_CRA_BKSA_Msk                 (0x3UL << ATIM3_MODE23_CRCH2_CFA_CRA_BKSA_Pos)
#define ATIM3_MODE23_CRCH2_CFA_CRA_BKSA                     ATIM3_MODE23_CRCH2_CFA_CRA_BKSA_Msk
#define ATIM3_MODE23_CRCH2_CFB_CRB_BKSB_Pos                 (2U)
#define ATIM3_MODE23_CRCH2_CFB_CRB_BKSB_Msk                 (0x3UL << ATIM3_MODE23_CRCH2_CFB_CRB_BKSB_Pos)
#define ATIM3_MODE23_CRCH2_CFB_CRB_BKSB                     ATIM3_MODE23_CRCH2_CFB_CRB_BKSB_Msk
#define ATIM3_MODE23_CRCH2_CSA_Pos                          (4U)
#define ATIM3_MODE23_CRCH2_CSA_Msk                          (0x1UL << ATIM3_MODE23_CRCH2_CSA_Pos)
#define ATIM3_MODE23_CRCH2_CSA                              ATIM3_MODE23_CRCH2_CSA_Msk
#define ATIM3_MODE23_CRCH2_CSB_Pos                          (5U)
#define ATIM3_MODE23_CRCH2_CSB_Msk                          (0x1UL << ATIM3_MODE23_CRCH2_CSB_Pos)
#define ATIM3_MODE23_CRCH2_CSB                              ATIM3_MODE23_CRCH2_CSB_Msk
#define ATIM3_MODE23_CRCH2_BUFEA_Pos                        (6U)
#define ATIM3_MODE23_CRCH2_BUFEA_Msk                        (0x1UL << ATIM3_MODE23_CRCH2_BUFEA_Pos)
#define ATIM3_MODE23_CRCH2_BUFEA                            ATIM3_MODE23_CRCH2_BUFEA_Msk
#define ATIM3_MODE23_CRCH2_BUFEB_Pos                        (7U)
#define ATIM3_MODE23_CRCH2_BUFEB_Msk                        (0x1UL << ATIM3_MODE23_CRCH2_BUFEB_Pos)
#define ATIM3_MODE23_CRCH2_BUFEB                            ATIM3_MODE23_CRCH2_BUFEB_Msk
#define ATIM3_MODE23_CRCH2_CIEA_Pos                         (8U)
#define ATIM3_MODE23_CRCH2_CIEA_Msk                         (0x1UL << ATIM3_MODE23_CRCH2_CIEA_Pos)
#define ATIM3_MODE23_CRCH2_CIEA                             ATIM3_MODE23_CRCH2_CIEA_Msk
#define ATIM3_MODE23_CRCH2_CIEB_Pos                         (9U)
#define ATIM3_MODE23_CRCH2_CIEB_Msk                         (0x1UL << ATIM3_MODE23_CRCH2_CIEB_Pos)
#define ATIM3_MODE23_CRCH2_CIEB                             ATIM3_MODE23_CRCH2_CIEB_Msk
#define ATIM3_MODE23_CRCH2_CISB_Pos                         (12U)
#define ATIM3_MODE23_CRCH2_CISB_Msk                         (0x3UL << ATIM3_MODE23_CRCH2_CISB_Pos)
#define ATIM3_MODE23_CRCH2_CISB                             ATIM3_MODE23_CRCH2_CISB_Msk
#define ATIM3_MODE23_CRCH2_CCGA_Pos                         (14U)
#define ATIM3_MODE23_CRCH2_CCGA_Msk                         (0x1UL << ATIM3_MODE23_CRCH2_CCGA_Pos)
#define ATIM3_MODE23_CRCH2_CCGA                             ATIM3_MODE23_CRCH2_CCGA_Msk
#define ATIM3_MODE23_CRCH2_CCGB_Pos                         (15U)
#define ATIM3_MODE23_CRCH2_CCGB_Msk                         (0x1UL << ATIM3_MODE23_CRCH2_CCGB_Pos)
#define ATIM3_MODE23_CRCH2_CCGB                             ATIM3_MODE23_CRCH2_CCGB_Msk

