yuer-12342/sx1280-test/mcu/common/hc32l021.h
// ATIM3_MODE23_DTR
#define ATIM3_MODE23_DTR_DTR_Pos                            (0U)
#define ATIM3_MODE23_DTR_DTR_Msk                            (0xFFUL << ATIM3_MODE23_DTR_DTR_Pos)
#define ATIM3_MODE23_DTR_DTR                                ATIM3_MODE23_DTR_DTR_Msk
#define ATIM3_MODE23_DTR_BKSEL_Pos                          (8U)
#define ATIM3_MODE23_DTR_BKSEL_Msk                          (0x1UL << ATIM3_MODE23_DTR_BKSEL_Pos)
#define ATIM3_MODE23_DTR_BKSEL                              ATIM3_MODE23_DTR_BKSEL_Msk
#define ATIM3_MODE23_DTR_DTEN_Pos                           (9U)
#define ATIM3_MODE23_DTR_DTEN_Msk                           (0x1UL << ATIM3_MODE23_DTR_DTEN_Pos)
#define ATIM3_MODE23_DTR_DTEN                               ATIM3_MODE23_DTR_DTEN_Msk
#define ATIM3_MODE23_DTR_BKE_Pos                            (10U)
#define ATIM3_MODE23_DTR_BKE_Msk                            (0x1UL << ATIM3_MODE23_DTR_BKE_Pos)
#define ATIM3_MODE23_DTR_BKE                                ATIM3_MODE23_DTR_BKE_Msk
#define ATIM3_MODE23_DTR_AOE_Pos                            (11U)
#define ATIM3_MODE23_DTR_AOE_Msk                            (0x1UL << ATIM3_MODE23_DTR_AOE_Pos)
#define ATIM3_MODE23_DTR_AOE                                ATIM3_MODE23_DTR_AOE_Msk
#define ATIM3_MODE23_DTR_MOE_Pos                            (12U)
#define ATIM3_MODE23_DTR_MOE_Msk                            (0x1UL << ATIM3_MODE23_DTR_MOE_Pos)
#define ATIM3_MODE23_DTR_MOE                                ATIM3_MODE23_DTR_MOE_Msk
#define ATIM3_MODE23_DTR_SAFEEN_Pos                         (13U)
#define ATIM3_MODE23_DTR_SAFEEN_Msk                         (0x1UL << ATIM3_MODE23_DTR_SAFEEN_Pos)
#define ATIM3_MODE23_DTR_SAFEEN                             ATIM3_MODE23_DTR_SAFEEN_Msk
#define ATIM3_MODE23_DTR_VCE_Pos                            (14U)
#define ATIM3_MODE23_DTR_VCE_Msk                            (0x1UL << ATIM3_MODE23_DTR_VCE_Pos)
#define ATIM3_MODE23_DTR_VCE                                ATIM3_MODE23_DTR_VCE_Msk

// ATIM3_MODE23_RCR
#define ATIM3_MODE23_RCR_RCR_Pos                            (0U)
#define ATIM3_MODE23_RCR_RCR_Msk                            (0xFFUL << ATIM3_MODE23_RCR_RCR_Pos)
#define ATIM3_MODE23_RCR_RCR                                ATIM3_MODE23_RCR_RCR_Msk
#define ATIM3_MODE23_RCR_OV_Pos                             (8U)
#define ATIM3_MODE23_RCR_OV_Msk                             (0x1UL << ATIM3_MODE23_RCR_OV_Pos)
#define ATIM3_MODE23_RCR_OV                                 ATIM3_MODE23_RCR_OV_Msk
#define ATIM3_MODE23_RCR_UND_Pos                            (9U)
#define ATIM3_MODE23_RCR_UND_Msk                            (0x1UL << ATIM3_MODE23_RCR_UND_Pos)
#define ATIM3_MODE23_RCR_UND                                ATIM3_MODE23_RCR_UND_Msk

// ATIM3_MODE23_ARRDM
#define ATIM3_MODE23_ARRDM_ARRDM_Pos                        (0U)
#define ATIM3_MODE23_ARRDM_ARRDM_Msk                        (0xFFFFUL << ATIM3_MODE23_ARRDM_ARRDM_Pos)
#define ATIM3_MODE23_ARRDM_ARRDM                            ATIM3_MODE23_ARRDM_ARRDM_Msk

// ATIM3_MODE23_CCR0A
#define ATIM3_MODE23_CCR0A_CCR0A_Pos                        (0U)
#define ATIM3_MODE23_CCR0A_CCR0A_Msk                        (0xFFFFUL << ATIM3_MODE23_CCR0A_CCR0A_Pos)
#define ATIM3_MODE23_CCR0A_CCR0A                            ATIM3_MODE23_CCR0A_CCR0A_Msk

// ATIM3_MODE23_CCR0B
#define ATIM3_MODE23_CCR0B_CCR0B_Pos                        (0U)
#define ATIM3_MODE23_CCR0B_CCR0B_Msk                        (0xFFFFUL << ATIM3_MODE23_CCR0B_CCR0B_Pos)
#define ATIM3_MODE23_CCR0B_CCR0B                            ATIM3_MODE23_CCR0B_CCR0B_Msk

// ATIM3_MODE23_CCR1A
#define ATIM3_MODE23_CCR1A_CCR1A_Pos                        (0U)
#define ATIM3_MODE23_CCR1A_CCR1A_Msk                        (0xFFFFUL << ATIM3_MODE23_CCR1A_CCR1A_Pos)
#define ATIM3_MODE23_CCR1A_CCR1A                            ATIM3_MODE23_CCR1A_CCR1A_Msk

// ATIM3_MODE23_CCR1B
#define ATIM3_MODE23_CCR1B_CCR1B_Pos                        (0U)
#define ATIM3_MODE23_CCR1B_CCR1B_Msk                        (0xFFFFUL << ATIM3_MODE23_CCR1B_CCR1B_Pos)
#define ATIM3_MODE23_CCR1B_CCR1B                            ATIM3_MODE23_CCR1B_CCR1B_Msk

// ATIM3_MODE23_CCR2A
#define ATIM3_MODE23_CCR2A_CCR2A_Pos                        (0U)
#define ATIM3_MODE23_CCR2A_CCR2A_Msk                        (0xFFFFUL << ATIM3_MODE23_CCR2A_CCR2A_Pos)
#define ATIM3_MODE23_CCR2A_CCR2A                            ATIM3_MODE23_CCR2A_CCR2A_Msk

// ATIM3_MODE23_CCR2B
#define ATIM3_MODE23_CCR2B_CCR2B_Pos                        (0U)
#define ATIM3_MODE23_CCR2B_CCR2B_Msk                        (0xFFFFUL << ATIM3_MODE23_CCR2B_CCR2B_Pos)
#define ATIM3_MODE23_CCR2B_CCR2B                            ATIM3_MODE23_CCR2B_CCR2B_Msk



//********************    Bits Define For Peripheral BTIM    ********************//
// BTIM_ARR
#define BTIM_ARR_ARR_Pos                                    (0U)
#define BTIM_ARR_ARR_Msk                                    (0xFFFFUL << BTIM_ARR_ARR_Pos)
#define BTIM_ARR_ARR                                        BTIM_ARR_ARR_Msk

// BTIM_CNT
#define BTIM_CNT_CNT_Pos                                    (0U)
#define BTIM_CNT_CNT_Msk                                    (0xFFFFUL << BTIM_CNT_CNT_Pos)
#define BTIM_CNT_CNT                                        BTIM_CNT_CNT_Msk

// BTIM_CR
#define BTIM_CR_CEN_Pos                                     (0U)
#define BTIM_CR_CEN_Msk                                     (0x1UL << BTIM_CR_CEN_Pos)
#define BTIM_CR_CEN                                         BTIM_CR_CEN_Msk
#define BTIM_CR_MD_Pos                                      (1U)
#define BTIM_CR_MD_Msk                                      (0x3UL << BTIM_CR_MD_Pos)
#define BTIM_CR_MD                                          BTIM_CR_MD_Msk
#define BTIM_CR_TOGEN_Pos                                   (3U)
#define BTIM_CR_TOGEN_Msk                                   (0x1UL << BTIM_CR_TOGEN_Pos)
#define BTIM_CR_TOGEN                                       BTIM_CR_TOGEN_Msk
#define BTIM_CR_PRS_Pos                                     (4U)
#define BTIM_CR_PRS_Msk                                     (0xFUL << BTIM_CR_PRS_Pos)
#define BTIM_CR_PRS                                         BTIM_CR_PRS_Msk
#define BTIM_CR_OST_Pos                                     (8U)
#define BTIM_CR_OST_Msk                                     (0x1UL << BTIM_CR_OST_Pos)
#define BTIM_CR_OST                                         BTIM_CR_OST_Msk
#define BTIM_CR_TRS_Pos                                     (9U)
#define BTIM_CR_TRS_Msk                                     (0x3UL << BTIM_CR_TRS_Pos)
#define BTIM_CR_TRS                                         BTIM_CR_TRS_Msk
#define BTIM_CR_ETP_Pos                                     (11U)
#define BTIM_CR_ETP_Msk                                     (0x1UL << BTIM_CR_ETP_Pos)
#define BTIM_CR_ETP                                         BTIM_CR_ETP_Msk

