yuer-12342/sx1280-test/mcu/common/hc32l021.h
// BTIM_IER
#define BTIM_IER_UI_Pos                                     (0U)
#define BTIM_IER_UI_Msk                                     (0x1UL << BTIM_IER_UI_Pos)
#define BTIM_IER_UI                                         BTIM_IER_UI_Msk
#define BTIM_IER_TI_Pos                                     (1U)
#define BTIM_IER_TI_Msk                                     (0x1UL << BTIM_IER_TI_Pos)
#define BTIM_IER_TI                                         BTIM_IER_TI_Msk

// BTIM_IFR
#define BTIM_IFR_UI_Pos                                     (0U)
#define BTIM_IFR_UI_Msk                                     (0x1UL << BTIM_IFR_UI_Pos)
#define BTIM_IFR_UI                                         BTIM_IFR_UI_Msk
#define BTIM_IFR_TI_Pos                                     (1U)
#define BTIM_IFR_TI_Msk                                     (0x1UL << BTIM_IFR_TI_Pos)
#define BTIM_IFR_TI                                         BTIM_IFR_TI_Msk

// BTIM_ICR
#define BTIM_ICR_UI_Pos                                     (0U)
#define BTIM_ICR_UI_Msk                                     (0x1UL << BTIM_ICR_UI_Pos)
#define BTIM_ICR_UI                                         BTIM_ICR_UI_Msk
#define BTIM_ICR_TI_Pos                                     (1U)
#define BTIM_ICR_TI_Msk                                     (0x1UL << BTIM_ICR_TI_Pos)
#define BTIM_ICR_TI                                         BTIM_ICR_TI_Msk

// BTIM_AIFR
#define BTIM_AIFR_UI03_Pos                                  (0U)
#define BTIM_AIFR_UI03_Msk                                  (0x1UL << BTIM_AIFR_UI03_Pos)
#define BTIM_AIFR_UI03                                      BTIM_AIFR_UI03_Msk
#define BTIM_AIFR_TI03_Pos                                  (1U)
#define BTIM_AIFR_TI03_Msk                                  (0x1UL << BTIM_AIFR_TI03_Pos)
#define BTIM_AIFR_TI03                                      BTIM_AIFR_TI03_Msk
#define BTIM_AIFR_UI14_Pos                                  (2U)
#define BTIM_AIFR_UI14_Msk                                  (0x1UL << BTIM_AIFR_UI14_Pos)
#define BTIM_AIFR_UI14                                      BTIM_AIFR_UI14_Msk
#define BTIM_AIFR_TI14_Pos                                  (3U)
#define BTIM_AIFR_TI14_Msk                                  (0x1UL << BTIM_AIFR_TI14_Pos)
#define BTIM_AIFR_TI14                                      BTIM_AIFR_TI14_Msk
#define BTIM_AIFR_UI25_Pos                                  (4U)
#define BTIM_AIFR_UI25_Msk                                  (0x1UL << BTIM_AIFR_UI25_Pos)
#define BTIM_AIFR_UI25                                      BTIM_AIFR_UI25_Msk
#define BTIM_AIFR_TI25_Pos                                  (5U)
#define BTIM_AIFR_TI25_Msk                                  (0x1UL << BTIM_AIFR_TI25_Pos)
#define BTIM_AIFR_TI25                                      BTIM_AIFR_TI25_Msk

// BTIM_AICR
#define BTIM_AICR_UI03_Pos                                  (0U)
#define BTIM_AICR_UI03_Msk                                  (0x1UL << BTIM_AICR_UI03_Pos)
#define BTIM_AICR_UI03                                      BTIM_AICR_UI03_Msk
#define BTIM_AICR_TI03_Pos                                  (1U)
#define BTIM_AICR_TI03_Msk                                  (0x1UL << BTIM_AICR_TI03_Pos)
#define BTIM_AICR_TI03                                      BTIM_AICR_TI03_Msk
#define BTIM_AICR_UI14_Pos                                  (2U)
#define BTIM_AICR_UI14_Msk                                  (0x1UL << BTIM_AICR_UI14_Pos)
#define BTIM_AICR_UI14                                      BTIM_AICR_UI14_Msk
#define BTIM_AICR_TI14_Pos                                  (3U)
#define BTIM_AICR_TI14_Msk                                  (0x1UL << BTIM_AICR_TI14_Pos)
#define BTIM_AICR_TI14                                      BTIM_AICR_TI14_Msk
#define BTIM_AICR_UI25_Pos                                  (4U)
#define BTIM_AICR_UI25_Msk                                  (0x1UL << BTIM_AICR_UI25_Pos)
#define BTIM_AICR_UI25                                      BTIM_AICR_UI25_Msk
#define BTIM_AICR_TI25_Pos                                  (5U)
#define BTIM_AICR_TI25_Msk                                  (0x1UL << BTIM_AICR_TI25_Pos)
#define BTIM_AICR_TI25                                      BTIM_AICR_TI25_Msk



//********************    Bits Define For Peripheral CTRIM    ********************//
// CTRIM_ARR
#define CTRIM_ARR_ARR_Pos                                   (0U)
#define CTRIM_ARR_ARR_Msk                                   (0xFFFFUL << CTRIM_ARR_ARR_Pos)
#define CTRIM_ARR_ARR                                       CTRIM_ARR_ARR_Msk

// CTRIM_CNT
#define CTRIM_CNT_CNT_Pos                                   (0U)
#define CTRIM_CNT_CNT_Msk                                   (0xFFFFUL << CTRIM_CNT_CNT_Pos)
#define CTRIM_CNT_CNT                                       CTRIM_CNT_CNT_Msk

// CTRIM_CR0
#define CTRIM_CR0_STEP_Pos                                  (0U)
#define CTRIM_CR0_STEP_Msk                                  (0x7UL << CTRIM_CR0_STEP_Pos)
#define CTRIM_CR0_STEP                                      CTRIM_CR0_STEP_Msk
#define CTRIM_CR0_ETRFLT_Pos                                (4U)
#define CTRIM_CR0_ETRFLT_Msk                                (0x7UL << CTRIM_CR0_ETRFLT_Pos)
#define CTRIM_CR0_ETRFLT                                    CTRIM_CR0_ETRFLT_Msk
#define CTRIM_CR0_SRC_Pos                                   (8U)
#define CTRIM_CR0_SRC_Msk                                   (0x7UL << CTRIM_CR0_SRC_Pos)
#define CTRIM_CR0_SRC                                       CTRIM_CR0_SRC_Msk

// CTRIM_CR1
#define CTRIM_CR1_EN_Pos                                    (0U)
#define CTRIM_CR1_EN_Msk                                    (0x1UL << CTRIM_CR1_EN_Pos)
#define CTRIM_CR1_EN                                        CTRIM_CR1_EN_Msk
#define CTRIM_CR1_MD_Pos                                    (1U)
#define CTRIM_CR1_MD_Msk                                    (0x3UL << CTRIM_CR1_MD_Pos)
#define CTRIM_CR1_MD                                        CTRIM_CR1_MD_Msk
#define CTRIM_CR1_AUTO_Pos                                  (3U)
#define CTRIM_CR1_AUTO_Msk                                  (0x1UL << CTRIM_CR1_AUTO_Pos)
#define CTRIM_CR1_AUTO                                      CTRIM_CR1_AUTO_Msk
#define CTRIM_CR1_PRS_Pos                                   (4U)
#define CTRIM_CR1_PRS_Msk                                   (0xFUL << CTRIM_CR1_PRS_Pos)
#define CTRIM_CR1_PRS                                       CTRIM_CR1_PRS_Msk
#define CTRIM_CR1_OST_Pos                                   (8U)
#define CTRIM_CR1_OST_Msk                                   (0x1UL << CTRIM_CR1_OST_Pos)
#define CTRIM_CR1_OST                                       CTRIM_CR1_OST_Msk

