yuer-12342/sx1280-test/mcu/common/hc32l021.h
// CTRIM_IER
#define CTRIM_IER_UD_Pos                                    (0U)
#define CTRIM_IER_UD_Msk                                    (0x1UL << CTRIM_IER_UD_Pos)
#define CTRIM_IER_UD                                        CTRIM_IER_UD_Msk
#define CTRIM_IER_END_Pos                                   (1U)
#define CTRIM_IER_END_Msk                                   (0x1UL << CTRIM_IER_END_Pos)
#define CTRIM_IER_END                                       CTRIM_IER_END_Msk
#define CTRIM_IER_PS_Pos                                    (2U)
#define CTRIM_IER_PS_Msk                                    (0x1UL << CTRIM_IER_PS_Pos)
#define CTRIM_IER_PS                                        CTRIM_IER_PS_Msk
#define CTRIM_IER_MISS_Pos                                  (3U)
#define CTRIM_IER_MISS_Msk                                  (0x1UL << CTRIM_IER_MISS_Pos)
#define CTRIM_IER_MISS                                      CTRIM_IER_MISS_Msk
#define CTRIM_IER_OV_Pos                                    (4U)
#define CTRIM_IER_OV_Msk                                    (0x1UL << CTRIM_IER_OV_Pos)
#define CTRIM_IER_OV                                        CTRIM_IER_OV_Msk
#define CTRIM_IER_OK_Pos                                    (5U)
#define CTRIM_IER_OK_Msk                                    (0x1UL << CTRIM_IER_OK_Pos)
#define CTRIM_IER_OK                                        CTRIM_IER_OK_Msk

// CTRIM_ISR
#define CTRIM_ISR_UD_Pos                                    (0U)
#define CTRIM_ISR_UD_Msk                                    (0x1UL << CTRIM_ISR_UD_Pos)
#define CTRIM_ISR_UD                                        CTRIM_ISR_UD_Msk
#define CTRIM_ISR_END_Pos                                   (1U)
#define CTRIM_ISR_END_Msk                                   (0x1UL << CTRIM_ISR_END_Pos)
#define CTRIM_ISR_END                                       CTRIM_ISR_END_Msk
#define CTRIM_ISR_PS_Pos                                    (2U)
#define CTRIM_ISR_PS_Msk                                    (0x1UL << CTRIM_ISR_PS_Pos)
#define CTRIM_ISR_PS                                        CTRIM_ISR_PS_Msk
#define CTRIM_ISR_MISS_Pos                                  (3U)
#define CTRIM_ISR_MISS_Msk                                  (0x1UL << CTRIM_ISR_MISS_Pos)
#define CTRIM_ISR_MISS                                      CTRIM_ISR_MISS_Msk
#define CTRIM_ISR_OV_Pos                                    (4U)
#define CTRIM_ISR_OV_Msk                                    (0x1UL << CTRIM_ISR_OV_Pos)
#define CTRIM_ISR_OV                                        CTRIM_ISR_OV_Msk
#define CTRIM_ISR_OK_Pos                                    (5U)
#define CTRIM_ISR_OK_Msk                                    (0x1UL << CTRIM_ISR_OK_Pos)
#define CTRIM_ISR_OK                                        CTRIM_ISR_OK_Msk
#define CTRIM_ISR_DIR_Pos                                   (6U)
#define CTRIM_ISR_DIR_Msk                                   (0x1UL << CTRIM_ISR_DIR_Pos)
#define CTRIM_ISR_DIR                                       CTRIM_ISR_DIR_Msk

// CTRIM_ICR
#define CTRIM_ICR_UD_Pos                                    (0U)
#define CTRIM_ICR_UD_Msk                                    (0x1UL << CTRIM_ICR_UD_Pos)
#define CTRIM_ICR_UD                                        CTRIM_ICR_UD_Msk
#define CTRIM_ICR_END_Pos                                   (1U)
#define CTRIM_ICR_END_Msk                                   (0x1UL << CTRIM_ICR_END_Pos)
#define CTRIM_ICR_END                                       CTRIM_ICR_END_Msk
#define CTRIM_ICR_PS_Pos                                    (2U)
#define CTRIM_ICR_PS_Msk                                    (0x1UL << CTRIM_ICR_PS_Pos)
#define CTRIM_ICR_PS                                        CTRIM_ICR_PS_Msk
#define CTRIM_ICR_MISS_Pos                                  (3U)
#define CTRIM_ICR_MISS_Msk                                  (0x1UL << CTRIM_ICR_MISS_Pos)
#define CTRIM_ICR_MISS                                      CTRIM_ICR_MISS_Msk
#define CTRIM_ICR_OV_Pos                                    (4U)
#define CTRIM_ICR_OV_Msk                                    (0x1UL << CTRIM_ICR_OV_Pos)
#define CTRIM_ICR_OV                                        CTRIM_ICR_OV_Msk
#define CTRIM_ICR_OK_Pos                                    (5U)
#define CTRIM_ICR_OK_Msk                                    (0x1UL << CTRIM_ICR_OK_Pos)
#define CTRIM_ICR_OK                                        CTRIM_ICR_OK_Msk

// CTRIM_FCAP
#define CTRIM_FCAP_FCAP_Pos                                 (0U)
#define CTRIM_FCAP_FCAP_Msk                                 (0xFFFFUL << CTRIM_FCAP_FCAP_Pos)
#define CTRIM_FCAP_FCAP                                     CTRIM_FCAP_FCAP_Msk

// CTRIM_TVAL
#define CTRIM_TVAL_TVAL_Pos                                 (0U)
#define CTRIM_TVAL_TVAL_Msk                                 (0xFFFFUL << CTRIM_TVAL_TVAL_Pos)
#define CTRIM_TVAL_TVAL                                     CTRIM_TVAL_TVAL_Msk

// CTRIM_FLIM
#define CTRIM_FLIM_FLIM_Pos                                 (0U)
#define CTRIM_FLIM_FLIM_Msk                                 (0xFFFUL << CTRIM_FLIM_FLIM_Pos)
#define CTRIM_FLIM_FLIM                                     CTRIM_FLIM_FLIM_Msk



//********************    Bits Define For Peripheral FLASH    ********************//
// FLASH_CR
#define FLASH_CR_OP_Pos                                     (0U)
#define FLASH_CR_OP_Msk                                     (0x3UL << FLASH_CR_OP_Pos)
#define FLASH_CR_OP                                         FLASH_CR_OP_Msk
#define FLASH_CR_WAIT_Pos                                   (2U)
#define FLASH_CR_WAIT_Msk                                   (0x3UL << FLASH_CR_WAIT_Pos)
#define FLASH_CR_WAIT                                       FLASH_CR_WAIT_Msk
#define FLASH_CR_BUSY_Pos                                   (4U)
#define FLASH_CR_BUSY_Msk                                   (0x1UL << FLASH_CR_BUSY_Pos)
#define FLASH_CR_BUSY                                       FLASH_CR_BUSY_Msk
#define FLASH_CR_IE_Pos                                     (5U)
#define FLASH_CR_IE_Msk                                     (0x3UL << FLASH_CR_IE_Pos)
#define FLASH_CR_IE                                         FLASH_CR_IE_Msk
#define FLASH_CR_DPSTB_EN_Pos                               (9U)
#define FLASH_CR_DPSTB_EN_Msk                               (0x1UL << FLASH_CR_DPSTB_EN_Pos)
#define FLASH_CR_DPSTB_EN                                   FLASH_CR_DPSTB_EN_Msk
#define FLASH_CR_CONTP_Pos                                  (10U)
#define FLASH_CR_CONTP_Msk                                  (0x1UL << FLASH_CR_CONTP_Pos)
#define FLASH_CR_CONTP                                      FLASH_CR_CONTP_Msk
#define FLASH_CR_RO_Pos                                     (11U)
#define FLASH_CR_RO_Msk                                     (0x1UL << FLASH_CR_RO_Pos)
#define FLASH_CR_RO                                         FLASH_CR_RO_Msk

