yuer-12342/sx1280-test/mcu/common/hc32l021.h
// FLASH_IFR
#define FLASH_IFR_PC_Pos                                    (0U)
#define FLASH_IFR_PC_Msk                                    (0x1UL << FLASH_IFR_PC_Pos)
#define FLASH_IFR_PC                                        FLASH_IFR_PC_Msk
#define FLASH_IFR_PROT_Pos                                  (1U)
#define FLASH_IFR_PROT_Msk                                  (0x1UL << FLASH_IFR_PROT_Pos)
#define FLASH_IFR_PROT                                      FLASH_IFR_PROT_Msk

// FLASH_ICLR
#define FLASH_ICLR_PC_Pos                                   (0U)
#define FLASH_ICLR_PC_Msk                                   (0x1UL << FLASH_ICLR_PC_Pos)
#define FLASH_ICLR_PC                                       FLASH_ICLR_PC_Msk
#define FLASH_ICLR_PROT_Pos                                 (1U)
#define FLASH_ICLR_PROT_Msk                                 (0x1UL << FLASH_ICLR_PROT_Pos)
#define FLASH_ICLR_PROT                                     FLASH_ICLR_PROT_Msk

// FLASH_BYPASS
#define FLASH_BYPASS_BYSEQ_Pos                              (0U)
#define FLASH_BYPASS_BYSEQ_Msk                              (0xFFFFUL << FLASH_BYPASS_BYSEQ_Pos)
#define FLASH_BYPASS_BYSEQ                                  FLASH_BYPASS_BYSEQ_Msk

// FLASH_SLOCK0
#define FLASH_SLOCK0_SLOCK_Pos                              (0U)
#define FLASH_SLOCK0_SLOCK_Msk                              (0xFFFFFFFFUL << FLASH_SLOCK0_SLOCK_Pos)
#define FLASH_SLOCK0_SLOCK                                  FLASH_SLOCK0_SLOCK_Msk

// FLASH_LOCK_ST
#define FLASH_LOCK_ST_LOCK_ST_Pos                           (0U)
#define FLASH_LOCK_ST_LOCK_ST_Msk                           (0x3UL << FLASH_LOCK_ST_LOCK_ST_Pos)
#define FLASH_LOCK_ST_LOCK_ST                               FLASH_LOCK_ST_LOCK_ST_Msk



//********************    Bits Define For Peripheral GPIO    ********************//
// GPIO_PIN00_SEL
#define GPIO_PIN00_SEL_SEL_Pos                              (0U)
#define GPIO_PIN00_SEL_SEL_Msk                              (0x7UL << GPIO_PIN00_SEL_SEL_Pos)
#define GPIO_PIN00_SEL_SEL                                  GPIO_PIN00_SEL_SEL_Msk

// GPIO_PIN01_SEL
#define GPIO_PIN01_SEL_SEL_Pos                              (0U)
#define GPIO_PIN01_SEL_SEL_Msk                              (0x7UL << GPIO_PIN01_SEL_SEL_Pos)
#define GPIO_PIN01_SEL_SEL                                  GPIO_PIN01_SEL_SEL_Msk

// GPIO_PIN02_SEL
#define GPIO_PIN02_SEL_SEL_Pos                              (0U)
#define GPIO_PIN02_SEL_SEL_Msk                              (0x7UL << GPIO_PIN02_SEL_SEL_Pos)
#define GPIO_PIN02_SEL_SEL                                  GPIO_PIN02_SEL_SEL_Msk

// GPIO_PIN03_SEL
#define GPIO_PIN03_SEL_SEL_Pos                              (0U)
#define GPIO_PIN03_SEL_SEL_Msk                              (0x7UL << GPIO_PIN03_SEL_SEL_Pos)
#define GPIO_PIN03_SEL_SEL                                  GPIO_PIN03_SEL_SEL_Msk

// GPIO_PIN04_SEL
#define GPIO_PIN04_SEL_SEL_Pos                              (0U)
#define GPIO_PIN04_SEL_SEL_Msk                              (0x7UL << GPIO_PIN04_SEL_SEL_Pos)
#define GPIO_PIN04_SEL_SEL                                  GPIO_PIN04_SEL_SEL_Msk

// GPIO_PIN05_SEL
#define GPIO_PIN05_SEL_SEL_Pos                              (0U)
#define GPIO_PIN05_SEL_SEL_Msk                              (0x7UL << GPIO_PIN05_SEL_SEL_Pos)
#define GPIO_PIN05_SEL_SEL                                  GPIO_PIN05_SEL_SEL_Msk

// GPIO_PIN06_SEL
#define GPIO_PIN06_SEL_SEL_Pos                              (0U)
#define GPIO_PIN06_SEL_SEL_Msk                              (0x7UL << GPIO_PIN06_SEL_SEL_Pos)
#define GPIO_PIN06_SEL_SEL                                  GPIO_PIN06_SEL_SEL_Msk

// GPIO_PIN07_SEL
#define GPIO_PIN07_SEL_SEL_Pos                              (0U)
#define GPIO_PIN07_SEL_SEL_Msk                              (0x7UL << GPIO_PIN07_SEL_SEL_Pos)
#define GPIO_PIN07_SEL_SEL                                  GPIO_PIN07_SEL_SEL_Msk

// GPIO_PIN08_SEL
#define GPIO_PIN08_SEL_SEL_Pos                              (0U)
#define GPIO_PIN08_SEL_SEL_Msk                              (0x7UL << GPIO_PIN08_SEL_SEL_Pos)
#define GPIO_PIN08_SEL_SEL                                  GPIO_PIN08_SEL_SEL_Msk

// GPIO_PIN09_SEL
#define GPIO_PIN09_SEL_SEL_Pos                              (0U)
#define GPIO_PIN09_SEL_SEL_Msk                              (0x7UL << GPIO_PIN09_SEL_SEL_Pos)
#define GPIO_PIN09_SEL_SEL                                  GPIO_PIN09_SEL_SEL_Msk

// GPIO_PIN10_SEL
#define GPIO_PIN10_SEL_SEL_Pos                              (0U)
#define GPIO_PIN10_SEL_SEL_Msk                              (0x7UL << GPIO_PIN10_SEL_SEL_Pos)
#define GPIO_PIN10_SEL_SEL                                  GPIO_PIN10_SEL_SEL_Msk

// GPIO_PIN11_SEL
#define GPIO_PIN11_SEL_SEL_Pos                              (0U)
#define GPIO_PIN11_SEL_SEL_Msk                              (0x7UL << GPIO_PIN11_SEL_SEL_Pos)
#define GPIO_PIN11_SEL_SEL                                  GPIO_PIN11_SEL_SEL_Msk

// GPIO_PIN12_SEL
#define GPIO_PIN12_SEL_SEL_Pos                              (0U)
#define GPIO_PIN12_SEL_SEL_Msk                              (0x7UL << GPIO_PIN12_SEL_SEL_Pos)
#define GPIO_PIN12_SEL_SEL                                  GPIO_PIN12_SEL_SEL_Msk

// GPIO_PIN13_SEL
#define GPIO_PIN13_SEL_SEL_Pos                              (0U)
#define GPIO_PIN13_SEL_SEL_Msk                              (0x7UL << GPIO_PIN13_SEL_SEL_Pos)
#define GPIO_PIN13_SEL_SEL                                  GPIO_PIN13_SEL_SEL_Msk

// GPIO_PIN14_SEL
#define GPIO_PIN14_SEL_SEL_Pos                              (0U)
#define GPIO_PIN14_SEL_SEL_Msk                              (0x7UL << GPIO_PIN14_SEL_SEL_Pos)
#define GPIO_PIN14_SEL_SEL                                  GPIO_PIN14_SEL_SEL_Msk

// GPIO_PIN15_SEL
#define GPIO_PIN15_SEL_SEL_Pos                              (0U)
#define GPIO_PIN15_SEL_SEL_Msk                              (0x7UL << GPIO_PIN15_SEL_SEL_Pos)
#define GPIO_PIN15_SEL_SEL                                  GPIO_PIN15_SEL_SEL_Msk

