yuer-12342/sx1280-test/mcu/common/hc32l021.h
// GPIO_DIR
#define GPIO_DIR_PIN00_Pos                                  (0U)
#define GPIO_DIR_PIN00_Msk                                  (0x1UL << GPIO_DIR_PIN00_Pos)
#define GPIO_DIR_PIN00                                      GPIO_DIR_PIN00_Msk
#define GPIO_DIR_PIN01_Pos                                  (1U)
#define GPIO_DIR_PIN01_Msk                                  (0x1UL << GPIO_DIR_PIN01_Pos)
#define GPIO_DIR_PIN01                                      GPIO_DIR_PIN01_Msk
#define GPIO_DIR_PIN02_Pos                                  (2U)
#define GPIO_DIR_PIN02_Msk                                  (0x1UL << GPIO_DIR_PIN02_Pos)
#define GPIO_DIR_PIN02                                      GPIO_DIR_PIN02_Msk
#define GPIO_DIR_PIN03_Pos                                  (3U)
#define GPIO_DIR_PIN03_Msk                                  (0x1UL << GPIO_DIR_PIN03_Pos)
#define GPIO_DIR_PIN03                                      GPIO_DIR_PIN03_Msk
#define GPIO_DIR_PIN04_Pos                                  (4U)
#define GPIO_DIR_PIN04_Msk                                  (0x1UL << GPIO_DIR_PIN04_Pos)
#define GPIO_DIR_PIN04                                      GPIO_DIR_PIN04_Msk
#define GPIO_DIR_PIN05_Pos                                  (5U)
#define GPIO_DIR_PIN05_Msk                                  (0x1UL << GPIO_DIR_PIN05_Pos)
#define GPIO_DIR_PIN05                                      GPIO_DIR_PIN05_Msk
#define GPIO_DIR_PIN06_Pos                                  (6U)
#define GPIO_DIR_PIN06_Msk                                  (0x1UL << GPIO_DIR_PIN06_Pos)
#define GPIO_DIR_PIN06                                      GPIO_DIR_PIN06_Msk
#define GPIO_DIR_PIN07_Pos                                  (7U)
#define GPIO_DIR_PIN07_Msk                                  (0x1UL << GPIO_DIR_PIN07_Pos)
#define GPIO_DIR_PIN07                                      GPIO_DIR_PIN07_Msk
#define GPIO_DIR_PIN08_Pos                                  (8U)
#define GPIO_DIR_PIN08_Msk                                  (0x1UL << GPIO_DIR_PIN08_Pos)
#define GPIO_DIR_PIN08                                      GPIO_DIR_PIN08_Msk
#define GPIO_DIR_PIN09_Pos                                  (9U)
#define GPIO_DIR_PIN09_Msk                                  (0x1UL << GPIO_DIR_PIN09_Pos)
#define GPIO_DIR_PIN09                                      GPIO_DIR_PIN09_Msk
#define GPIO_DIR_PIN10_Pos                                  (10U)
#define GPIO_DIR_PIN10_Msk                                  (0x1UL << GPIO_DIR_PIN10_Pos)
#define GPIO_DIR_PIN10                                      GPIO_DIR_PIN10_Msk
#define GPIO_DIR_PIN11_Pos                                  (11U)
#define GPIO_DIR_PIN11_Msk                                  (0x1UL << GPIO_DIR_PIN11_Pos)
#define GPIO_DIR_PIN11                                      GPIO_DIR_PIN11_Msk
#define GPIO_DIR_PIN12_Pos                                  (12U)
#define GPIO_DIR_PIN12_Msk                                  (0x1UL << GPIO_DIR_PIN12_Pos)
#define GPIO_DIR_PIN12                                      GPIO_DIR_PIN12_Msk
#define GPIO_DIR_PIN13_Pos                                  (13U)
#define GPIO_DIR_PIN13_Msk                                  (0x1UL << GPIO_DIR_PIN13_Pos)
#define GPIO_DIR_PIN13                                      GPIO_DIR_PIN13_Msk
#define GPIO_DIR_PIN14_Pos                                  (14U)
#define GPIO_DIR_PIN14_Msk                                  (0x1UL << GPIO_DIR_PIN14_Pos)
#define GPIO_DIR_PIN14                                      GPIO_DIR_PIN14_Msk
#define GPIO_DIR_PIN15_Pos                                  (15U)
#define GPIO_DIR_PIN15_Msk                                  (0x1UL << GPIO_DIR_PIN15_Pos)
#define GPIO_DIR_PIN15                                      GPIO_DIR_PIN15_Msk

// GPIO_IN
#define GPIO_IN_PIN00_Pos                                   (0U)
#define GPIO_IN_PIN00_Msk                                   (0x1UL << GPIO_IN_PIN00_Pos)
#define GPIO_IN_PIN00                                       GPIO_IN_PIN00_Msk
#define GPIO_IN_PIN01_Pos                                   (1U)
#define GPIO_IN_PIN01_Msk                                   (0x1UL << GPIO_IN_PIN01_Pos)
#define GPIO_IN_PIN01                                       GPIO_IN_PIN01_Msk
#define GPIO_IN_PIN02_Pos                                   (2U)
#define GPIO_IN_PIN02_Msk                                   (0x1UL << GPIO_IN_PIN02_Pos)
#define GPIO_IN_PIN02                                       GPIO_IN_PIN02_Msk
#define GPIO_IN_PIN03_Pos                                   (3U)
#define GPIO_IN_PIN03_Msk                                   (0x1UL << GPIO_IN_PIN03_Pos)
#define GPIO_IN_PIN03                                       GPIO_IN_PIN03_Msk
#define GPIO_IN_PIN04_Pos                                   (4U)
#define GPIO_IN_PIN04_Msk                                   (0x1UL << GPIO_IN_PIN04_Pos)
#define GPIO_IN_PIN04                                       GPIO_IN_PIN04_Msk
#define GPIO_IN_PIN05_Pos                                   (5U)
#define GPIO_IN_PIN05_Msk                                   (0x1UL << GPIO_IN_PIN05_Pos)
#define GPIO_IN_PIN05                                       GPIO_IN_PIN05_Msk
#define GPIO_IN_PIN06_Pos                                   (6U)
#define GPIO_IN_PIN06_Msk                                   (0x1UL << GPIO_IN_PIN06_Pos)
#define GPIO_IN_PIN06                                       GPIO_IN_PIN06_Msk
#define GPIO_IN_PIN07_Pos                                   (7U)
#define GPIO_IN_PIN07_Msk                                   (0x1UL << GPIO_IN_PIN07_Pos)
#define GPIO_IN_PIN07                                       GPIO_IN_PIN07_Msk
#define GPIO_IN_PIN08_Pos                                   (8U)
#define GPIO_IN_PIN08_Msk                                   (0x1UL << GPIO_IN_PIN08_Pos)
#define GPIO_IN_PIN08                                       GPIO_IN_PIN08_Msk
#define GPIO_IN_PIN09_Pos                                   (9U)
#define GPIO_IN_PIN09_Msk                                   (0x1UL << GPIO_IN_PIN09_Pos)
#define GPIO_IN_PIN09                                       GPIO_IN_PIN09_Msk
#define GPIO_IN_PIN10_Pos                                   (10U)
#define GPIO_IN_PIN10_Msk                                   (0x1UL << GPIO_IN_PIN10_Pos)
#define GPIO_IN_PIN10                                       GPIO_IN_PIN10_Msk
#define GPIO_IN_PIN11_Pos                                   (11U)
#define GPIO_IN_PIN11_Msk                                   (0x1UL << GPIO_IN_PIN11_Pos)
#define GPIO_IN_PIN11                                       GPIO_IN_PIN11_Msk
#define GPIO_IN_PIN12_Pos                                   (12U)
#define GPIO_IN_PIN12_Msk                                   (0x1UL << GPIO_IN_PIN12_Pos)
#define GPIO_IN_PIN12                                       GPIO_IN_PIN12_Msk
#define GPIO_IN_PIN13_Pos                                   (13U)
#define GPIO_IN_PIN13_Msk                                   (0x1UL << GPIO_IN_PIN13_Pos)
#define GPIO_IN_PIN13                                       GPIO_IN_PIN13_Msk
#define GPIO_IN_PIN14_Pos                                   (14U)
#define GPIO_IN_PIN14_Msk                                   (0x1UL << GPIO_IN_PIN14_Pos)
#define GPIO_IN_PIN14                                       GPIO_IN_PIN14_Msk
#define GPIO_IN_PIN15_Pos                                   (15U)
#define GPIO_IN_PIN15_Msk                                   (0x1UL << GPIO_IN_PIN15_Pos)
#define GPIO_IN_PIN15                                       GPIO_IN_PIN15_Msk

// GPIO_OUT
#define GPIO_OUT_PIN00_Pos                                  (0U)
#define GPIO_OUT_PIN00_Msk                                  (0x1UL << GPIO_OUT_PIN00_Pos)
#define GPIO_OUT_PIN00                                      GPIO_OUT_PIN00_Msk
#define GPIO_OUT_PIN01_Pos                                  (1U)
#define GPIO_OUT_PIN01_Msk                                  (0x1UL << GPIO_OUT_PIN01_Pos)
#define GPIO_OUT_PIN01                                      GPIO_OUT_PIN01_Msk
#define GPIO_OUT_PIN02_Pos                                  (2U)
#define GPIO_OUT_PIN02_Msk                                  (0x1UL << GPIO_OUT_PIN02_Pos)
#define GPIO_OUT_PIN02                                      GPIO_OUT_PIN02_Msk
#define GPIO_OUT_PIN03_Pos                                  (3U)
#define GPIO_OUT_PIN03_Msk                                  (0x1UL << GPIO_OUT_PIN03_Pos)
#define GPIO_OUT_PIN03                                      GPIO_OUT_PIN03_Msk
#define GPIO_OUT_PIN04_Pos                                  (4U)
#define GPIO_OUT_PIN04_Msk                                  (0x1UL << GPIO_OUT_PIN04_Pos)
#define GPIO_OUT_PIN04                                      GPIO_OUT_PIN04_Msk
#define GPIO_OUT_PIN05_Pos                                  (5U)
#define GPIO_OUT_PIN05_Msk                                  (0x1UL << GPIO_OUT_PIN05_Pos)
#define GPIO_OUT_PIN05                                      GPIO_OUT_PIN05_Msk
#define GPIO_OUT_PIN06_Pos                                  (6U)
#define GPIO_OUT_PIN06_Msk                                  (0x1UL << GPIO_OUT_PIN06_Pos)
#define GPIO_OUT_PIN06                                      GPIO_OUT_PIN06_Msk
#define GPIO_OUT_PIN07_Pos                                  (7U)
#define GPIO_OUT_PIN07_Msk                                  (0x1UL << GPIO_OUT_PIN07_Pos)
#define GPIO_OUT_PIN07                                      GPIO_OUT_PIN07_Msk
#define GPIO_OUT_PIN08_Pos                                  (8U)
#define GPIO_OUT_PIN08_Msk                                  (0x1UL << GPIO_OUT_PIN08_Pos)
#define GPIO_OUT_PIN08                                      GPIO_OUT_PIN08_Msk
#define GPIO_OUT_PIN09_Pos                                  (9U)
#define GPIO_OUT_PIN09_Msk                                  (0x1UL << GPIO_OUT_PIN09_Pos)
#define GPIO_OUT_PIN09                                      GPIO_OUT_PIN09_Msk
#define GPIO_OUT_PIN10_Pos                                  (10U)
#define GPIO_OUT_PIN10_Msk                                  (0x1UL << GPIO_OUT_PIN10_Pos)
#define GPIO_OUT_PIN10                                      GPIO_OUT_PIN10_Msk
#define GPIO_OUT_PIN11_Pos                                  (11U)
#define GPIO_OUT_PIN11_Msk                                  (0x1UL << GPIO_OUT_PIN11_Pos)
#define GPIO_OUT_PIN11                                      GPIO_OUT_PIN11_Msk
#define GPIO_OUT_PIN12_Pos                                  (12U)
#define GPIO_OUT_PIN12_Msk                                  (0x1UL << GPIO_OUT_PIN12_Pos)
#define GPIO_OUT_PIN12                                      GPIO_OUT_PIN12_Msk
#define GPIO_OUT_PIN13_Pos                                  (13U)
#define GPIO_OUT_PIN13_Msk                                  (0x1UL << GPIO_OUT_PIN13_Pos)
#define GPIO_OUT_PIN13                                      GPIO_OUT_PIN13_Msk
#define GPIO_OUT_PIN14_Pos                                  (14U)
#define GPIO_OUT_PIN14_Msk                                  (0x1UL << GPIO_OUT_PIN14_Pos)
#define GPIO_OUT_PIN14                                      GPIO_OUT_PIN14_Msk
#define GPIO_OUT_PIN15_Pos                                  (15U)
#define GPIO_OUT_PIN15_Msk                                  (0x1UL << GPIO_OUT_PIN15_Pos)
#define GPIO_OUT_PIN15                                      GPIO_OUT_PIN15_Msk

