yuer-12342/sx1280-test/mcu/common/hc32l021.h
// GPIO_ADS
#define GPIO_ADS_PIN00_Pos                                  (0U)
#define GPIO_ADS_PIN00_Msk                                  (0x1UL << GPIO_ADS_PIN00_Pos)
#define GPIO_ADS_PIN00                                      GPIO_ADS_PIN00_Msk
#define GPIO_ADS_PIN01_Pos                                  (1U)
#define GPIO_ADS_PIN01_Msk                                  (0x1UL << GPIO_ADS_PIN01_Pos)
#define GPIO_ADS_PIN01                                      GPIO_ADS_PIN01_Msk
#define GPIO_ADS_PIN02_Pos                                  (2U)
#define GPIO_ADS_PIN02_Msk                                  (0x1UL << GPIO_ADS_PIN02_Pos)
#define GPIO_ADS_PIN02                                      GPIO_ADS_PIN02_Msk
#define GPIO_ADS_PIN03_Pos                                  (3U)
#define GPIO_ADS_PIN03_Msk                                  (0x1UL << GPIO_ADS_PIN03_Pos)
#define GPIO_ADS_PIN03                                      GPIO_ADS_PIN03_Msk
#define GPIO_ADS_PIN04_Pos                                  (4U)
#define GPIO_ADS_PIN04_Msk                                  (0x1UL << GPIO_ADS_PIN04_Pos)
#define GPIO_ADS_PIN04                                      GPIO_ADS_PIN04_Msk
#define GPIO_ADS_PIN05_Pos                                  (5U)
#define GPIO_ADS_PIN05_Msk                                  (0x1UL << GPIO_ADS_PIN05_Pos)
#define GPIO_ADS_PIN05                                      GPIO_ADS_PIN05_Msk
#define GPIO_ADS_PIN06_Pos                                  (6U)
#define GPIO_ADS_PIN06_Msk                                  (0x1UL << GPIO_ADS_PIN06_Pos)
#define GPIO_ADS_PIN06                                      GPIO_ADS_PIN06_Msk
#define GPIO_ADS_PIN07_Pos                                  (7U)
#define GPIO_ADS_PIN07_Msk                                  (0x1UL << GPIO_ADS_PIN07_Pos)
#define GPIO_ADS_PIN07                                      GPIO_ADS_PIN07_Msk
#define GPIO_ADS_PIN08_Pos                                  (8U)
#define GPIO_ADS_PIN08_Msk                                  (0x1UL << GPIO_ADS_PIN08_Pos)
#define GPIO_ADS_PIN08                                      GPIO_ADS_PIN08_Msk
#define GPIO_ADS_PIN09_Pos                                  (9U)
#define GPIO_ADS_PIN09_Msk                                  (0x1UL << GPIO_ADS_PIN09_Pos)
#define GPIO_ADS_PIN09                                      GPIO_ADS_PIN09_Msk
#define GPIO_ADS_PIN10_Pos                                  (10U)
#define GPIO_ADS_PIN10_Msk                                  (0x1UL << GPIO_ADS_PIN10_Pos)
#define GPIO_ADS_PIN10                                      GPIO_ADS_PIN10_Msk
#define GPIO_ADS_PIN11_Pos                                  (11U)
#define GPIO_ADS_PIN11_Msk                                  (0x1UL << GPIO_ADS_PIN11_Pos)
#define GPIO_ADS_PIN11                                      GPIO_ADS_PIN11_Msk
#define GPIO_ADS_PIN12_Pos                                  (12U)
#define GPIO_ADS_PIN12_Msk                                  (0x1UL << GPIO_ADS_PIN12_Pos)
#define GPIO_ADS_PIN12                                      GPIO_ADS_PIN12_Msk
#define GPIO_ADS_PIN13_Pos                                  (13U)
#define GPIO_ADS_PIN13_Msk                                  (0x1UL << GPIO_ADS_PIN13_Pos)
#define GPIO_ADS_PIN13                                      GPIO_ADS_PIN13_Msk
#define GPIO_ADS_PIN14_Pos                                  (14U)
#define GPIO_ADS_PIN14_Msk                                  (0x1UL << GPIO_ADS_PIN14_Pos)
#define GPIO_ADS_PIN14                                      GPIO_ADS_PIN14_Msk
#define GPIO_ADS_PIN15_Pos                                  (15U)
#define GPIO_ADS_PIN15_Msk                                  (0x1UL << GPIO_ADS_PIN15_Pos)
#define GPIO_ADS_PIN15                                      GPIO_ADS_PIN15_Msk

// GPIO_BSET
#define GPIO_BSET_PIN00_Pos                                 (0U)
#define GPIO_BSET_PIN00_Msk                                 (0x1UL << GPIO_BSET_PIN00_Pos)
#define GPIO_BSET_PIN00                                     GPIO_BSET_PIN00_Msk
#define GPIO_BSET_PIN01_Pos                                 (1U)
#define GPIO_BSET_PIN01_Msk                                 (0x1UL << GPIO_BSET_PIN01_Pos)
#define GPIO_BSET_PIN01                                     GPIO_BSET_PIN01_Msk
#define GPIO_BSET_PIN02_Pos                                 (2U)
#define GPIO_BSET_PIN02_Msk                                 (0x1UL << GPIO_BSET_PIN02_Pos)
#define GPIO_BSET_PIN02                                     GPIO_BSET_PIN02_Msk
#define GPIO_BSET_PIN03_Pos                                 (3U)
#define GPIO_BSET_PIN03_Msk                                 (0x1UL << GPIO_BSET_PIN03_Pos)
#define GPIO_BSET_PIN03                                     GPIO_BSET_PIN03_Msk
#define GPIO_BSET_PIN04_Pos                                 (4U)
#define GPIO_BSET_PIN04_Msk                                 (0x1UL << GPIO_BSET_PIN04_Pos)
#define GPIO_BSET_PIN04                                     GPIO_BSET_PIN04_Msk
#define GPIO_BSET_PIN05_Pos                                 (5U)
#define GPIO_BSET_PIN05_Msk                                 (0x1UL << GPIO_BSET_PIN05_Pos)
#define GPIO_BSET_PIN05                                     GPIO_BSET_PIN05_Msk
#define GPIO_BSET_PIN06_Pos                                 (6U)
#define GPIO_BSET_PIN06_Msk                                 (0x1UL << GPIO_BSET_PIN06_Pos)
#define GPIO_BSET_PIN06                                     GPIO_BSET_PIN06_Msk
#define GPIO_BSET_PIN07_Pos                                 (7U)
#define GPIO_BSET_PIN07_Msk                                 (0x1UL << GPIO_BSET_PIN07_Pos)
#define GPIO_BSET_PIN07                                     GPIO_BSET_PIN07_Msk
#define GPIO_BSET_PIN08_Pos                                 (8U)
#define GPIO_BSET_PIN08_Msk                                 (0x1UL << GPIO_BSET_PIN08_Pos)
#define GPIO_BSET_PIN08                                     GPIO_BSET_PIN08_Msk
#define GPIO_BSET_PIN09_Pos                                 (9U)
#define GPIO_BSET_PIN09_Msk                                 (0x1UL << GPIO_BSET_PIN09_Pos)
#define GPIO_BSET_PIN09                                     GPIO_BSET_PIN09_Msk
#define GPIO_BSET_PIN10_Pos                                 (10U)
#define GPIO_BSET_PIN10_Msk                                 (0x1UL << GPIO_BSET_PIN10_Pos)
#define GPIO_BSET_PIN10                                     GPIO_BSET_PIN10_Msk
#define GPIO_BSET_PIN11_Pos                                 (11U)
#define GPIO_BSET_PIN11_Msk                                 (0x1UL << GPIO_BSET_PIN11_Pos)
#define GPIO_BSET_PIN11                                     GPIO_BSET_PIN11_Msk
#define GPIO_BSET_PIN12_Pos                                 (12U)
#define GPIO_BSET_PIN12_Msk                                 (0x1UL << GPIO_BSET_PIN12_Pos)
#define GPIO_BSET_PIN12                                     GPIO_BSET_PIN12_Msk
#define GPIO_BSET_PIN13_Pos                                 (13U)
#define GPIO_BSET_PIN13_Msk                                 (0x1UL << GPIO_BSET_PIN13_Pos)
#define GPIO_BSET_PIN13                                     GPIO_BSET_PIN13_Msk
#define GPIO_BSET_PIN14_Pos                                 (14U)
#define GPIO_BSET_PIN14_Msk                                 (0x1UL << GPIO_BSET_PIN14_Pos)
#define GPIO_BSET_PIN14                                     GPIO_BSET_PIN14_Msk
#define GPIO_BSET_PIN15_Pos                                 (15U)
#define GPIO_BSET_PIN15_Msk                                 (0x1UL << GPIO_BSET_PIN15_Pos)
#define GPIO_BSET_PIN15                                     GPIO_BSET_PIN15_Msk

