yuer-12342/sx1280-test/mcu/common/hc32l021.h
// GPIO_BCLR
#define GPIO_BCLR_PIN00_Pos                                 (0U)
#define GPIO_BCLR_PIN00_Msk                                 (0x1UL << GPIO_BCLR_PIN00_Pos)
#define GPIO_BCLR_PIN00                                     GPIO_BCLR_PIN00_Msk
#define GPIO_BCLR_PIN01_Pos                                 (1U)
#define GPIO_BCLR_PIN01_Msk                                 (0x1UL << GPIO_BCLR_PIN01_Pos)
#define GPIO_BCLR_PIN01                                     GPIO_BCLR_PIN01_Msk
#define GPIO_BCLR_PIN02_Pos                                 (2U)
#define GPIO_BCLR_PIN02_Msk                                 (0x1UL << GPIO_BCLR_PIN02_Pos)
#define GPIO_BCLR_PIN02                                     GPIO_BCLR_PIN02_Msk
#define GPIO_BCLR_PIN03_Pos                                 (3U)
#define GPIO_BCLR_PIN03_Msk                                 (0x1UL << GPIO_BCLR_PIN03_Pos)
#define GPIO_BCLR_PIN03                                     GPIO_BCLR_PIN03_Msk
#define GPIO_BCLR_PIN04_Pos                                 (4U)
#define GPIO_BCLR_PIN04_Msk                                 (0x1UL << GPIO_BCLR_PIN04_Pos)
#define GPIO_BCLR_PIN04                                     GPIO_BCLR_PIN04_Msk
#define GPIO_BCLR_PIN05_Pos                                 (5U)
#define GPIO_BCLR_PIN05_Msk                                 (0x1UL << GPIO_BCLR_PIN05_Pos)
#define GPIO_BCLR_PIN05                                     GPIO_BCLR_PIN05_Msk
#define GPIO_BCLR_PIN06_Pos                                 (6U)
#define GPIO_BCLR_PIN06_Msk                                 (0x1UL << GPIO_BCLR_PIN06_Pos)
#define GPIO_BCLR_PIN06                                     GPIO_BCLR_PIN06_Msk
#define GPIO_BCLR_PIN07_Pos                                 (7U)
#define GPIO_BCLR_PIN07_Msk                                 (0x1UL << GPIO_BCLR_PIN07_Pos)
#define GPIO_BCLR_PIN07                                     GPIO_BCLR_PIN07_Msk
#define GPIO_BCLR_PIN08_Pos                                 (8U)
#define GPIO_BCLR_PIN08_Msk                                 (0x1UL << GPIO_BCLR_PIN08_Pos)
#define GPIO_BCLR_PIN08                                     GPIO_BCLR_PIN08_Msk
#define GPIO_BCLR_PIN09_Pos                                 (9U)
#define GPIO_BCLR_PIN09_Msk                                 (0x1UL << GPIO_BCLR_PIN09_Pos)
#define GPIO_BCLR_PIN09                                     GPIO_BCLR_PIN09_Msk
#define GPIO_BCLR_PIN10_Pos                                 (10U)
#define GPIO_BCLR_PIN10_Msk                                 (0x1UL << GPIO_BCLR_PIN10_Pos)
#define GPIO_BCLR_PIN10                                     GPIO_BCLR_PIN10_Msk
#define GPIO_BCLR_PIN11_Pos                                 (11U)
#define GPIO_BCLR_PIN11_Msk                                 (0x1UL << GPIO_BCLR_PIN11_Pos)
#define GPIO_BCLR_PIN11                                     GPIO_BCLR_PIN11_Msk
#define GPIO_BCLR_PIN12_Pos                                 (12U)
#define GPIO_BCLR_PIN12_Msk                                 (0x1UL << GPIO_BCLR_PIN12_Pos)
#define GPIO_BCLR_PIN12                                     GPIO_BCLR_PIN12_Msk
#define GPIO_BCLR_PIN13_Pos                                 (13U)
#define GPIO_BCLR_PIN13_Msk                                 (0x1UL << GPIO_BCLR_PIN13_Pos)
#define GPIO_BCLR_PIN13                                     GPIO_BCLR_PIN13_Msk
#define GPIO_BCLR_PIN14_Pos                                 (14U)
#define GPIO_BCLR_PIN14_Msk                                 (0x1UL << GPIO_BCLR_PIN14_Pos)
#define GPIO_BCLR_PIN14                                     GPIO_BCLR_PIN14_Msk
#define GPIO_BCLR_PIN15_Pos                                 (15U)
#define GPIO_BCLR_PIN15_Msk                                 (0x1UL << GPIO_BCLR_PIN15_Pos)
#define GPIO_BCLR_PIN15                                     GPIO_BCLR_PIN15_Msk

// GPIO_BSETCLR
#define GPIO_BSETCLR_BCLRPIN00_Pos                          (0U)
#define GPIO_BSETCLR_BCLRPIN00_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN00_Pos)
#define GPIO_BSETCLR_BCLRPIN00                              GPIO_BSETCLR_BCLRPIN00_Msk
#define GPIO_BSETCLR_BCLRPIN01_Pos                          (1U)
#define GPIO_BSETCLR_BCLRPIN01_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN01_Pos)
#define GPIO_BSETCLR_BCLRPIN01                              GPIO_BSETCLR_BCLRPIN01_Msk
#define GPIO_BSETCLR_BCLRPIN02_Pos                          (2U)
#define GPIO_BSETCLR_BCLRPIN02_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN02_Pos)
#define GPIO_BSETCLR_BCLRPIN02                              GPIO_BSETCLR_BCLRPIN02_Msk
#define GPIO_BSETCLR_BCLRPIN03_Pos                          (3U)
#define GPIO_BSETCLR_BCLRPIN03_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN03_Pos)
#define GPIO_BSETCLR_BCLRPIN03                              GPIO_BSETCLR_BCLRPIN03_Msk
#define GPIO_BSETCLR_BCLRPIN04_Pos                          (4U)
#define GPIO_BSETCLR_BCLRPIN04_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN04_Pos)
#define GPIO_BSETCLR_BCLRPIN04                              GPIO_BSETCLR_BCLRPIN04_Msk
#define GPIO_BSETCLR_BCLRPIN05_Pos                          (5U)
#define GPIO_BSETCLR_BCLRPIN05_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN05_Pos)
#define GPIO_BSETCLR_BCLRPIN05                              GPIO_BSETCLR_BCLRPIN05_Msk
#define GPIO_BSETCLR_BCLRPIN06_Pos                          (6U)
#define GPIO_BSETCLR_BCLRPIN06_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN06_Pos)
#define GPIO_BSETCLR_BCLRPIN06                              GPIO_BSETCLR_BCLRPIN06_Msk
#define GPIO_BSETCLR_BCLRPIN07_Pos                          (7U)
#define GPIO_BSETCLR_BCLRPIN07_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN07_Pos)
#define GPIO_BSETCLR_BCLRPIN07                              GPIO_BSETCLR_BCLRPIN07_Msk
#define GPIO_BSETCLR_BCLRPIN08_Pos                          (8U)
#define GPIO_BSETCLR_BCLRPIN08_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN08_Pos)
#define GPIO_BSETCLR_BCLRPIN08                              GPIO_BSETCLR_BCLRPIN08_Msk
#define GPIO_BSETCLR_BCLRPIN09_Pos                          (9U)
#define GPIO_BSETCLR_BCLRPIN09_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN09_Pos)
#define GPIO_BSETCLR_BCLRPIN09                              GPIO_BSETCLR_BCLRPIN09_Msk
#define GPIO_BSETCLR_BCLRPIN10_Pos                          (10U)
#define GPIO_BSETCLR_BCLRPIN10_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN10_Pos)
#define GPIO_BSETCLR_BCLRPIN10                              GPIO_BSETCLR_BCLRPIN10_Msk
#define GPIO_BSETCLR_BCLRPIN11_Pos                          (11U)
#define GPIO_BSETCLR_BCLRPIN11_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN11_Pos)
#define GPIO_BSETCLR_BCLRPIN11                              GPIO_BSETCLR_BCLRPIN11_Msk
#define GPIO_BSETCLR_BCLRPIN12_Pos                          (12U)
#define GPIO_BSETCLR_BCLRPIN12_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN12_Pos)
#define GPIO_BSETCLR_BCLRPIN12                              GPIO_BSETCLR_BCLRPIN12_Msk
#define GPIO_BSETCLR_BCLRPIN13_Pos                          (13U)
#define GPIO_BSETCLR_BCLRPIN13_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN13_Pos)
#define GPIO_BSETCLR_BCLRPIN13                              GPIO_BSETCLR_BCLRPIN13_Msk
#define GPIO_BSETCLR_BCLRPIN14_Pos                          (14U)
#define GPIO_BSETCLR_BCLRPIN14_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN14_Pos)
#define GPIO_BSETCLR_BCLRPIN14                              GPIO_BSETCLR_BCLRPIN14_Msk
#define GPIO_BSETCLR_BCLRPIN15_Pos                          (15U)
#define GPIO_BSETCLR_BCLRPIN15_Msk                          (0x1UL << GPIO_BSETCLR_BCLRPIN15_Pos)
#define GPIO_BSETCLR_BCLRPIN15                              GPIO_BSETCLR_BCLRPIN15_Msk
#define GPIO_BSETCLR_BSETPIN00_Pos                          (16U)
#define GPIO_BSETCLR_BSETPIN00_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN00_Pos)
#define GPIO_BSETCLR_BSETPIN00                              GPIO_BSETCLR_BSETPIN00_Msk
#define GPIO_BSETCLR_BSETPIN01_Pos                          (17U)
#define GPIO_BSETCLR_BSETPIN01_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN01_Pos)
#define GPIO_BSETCLR_BSETPIN01                              GPIO_BSETCLR_BSETPIN01_Msk
#define GPIO_BSETCLR_BSETPIN02_Pos                          (18U)
#define GPIO_BSETCLR_BSETPIN02_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN02_Pos)
#define GPIO_BSETCLR_BSETPIN02                              GPIO_BSETCLR_BSETPIN02_Msk
#define GPIO_BSETCLR_BSETPIN03_Pos                          (19U)
#define GPIO_BSETCLR_BSETPIN03_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN03_Pos)
#define GPIO_BSETCLR_BSETPIN03                              GPIO_BSETCLR_BSETPIN03_Msk
#define GPIO_BSETCLR_BSETPIN04_Pos                          (20U)
#define GPIO_BSETCLR_BSETPIN04_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN04_Pos)
#define GPIO_BSETCLR_BSETPIN04                              GPIO_BSETCLR_BSETPIN04_Msk
#define GPIO_BSETCLR_BSETPIN05_Pos                          (21U)
#define GPIO_BSETCLR_BSETPIN05_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN05_Pos)
#define GPIO_BSETCLR_BSETPIN05                              GPIO_BSETCLR_BSETPIN05_Msk
#define GPIO_BSETCLR_BSETPIN06_Pos                          (22U)
#define GPIO_BSETCLR_BSETPIN06_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN06_Pos)
#define GPIO_BSETCLR_BSETPIN06                              GPIO_BSETCLR_BSETPIN06_Msk
#define GPIO_BSETCLR_BSETPIN07_Pos                          (23U)
#define GPIO_BSETCLR_BSETPIN07_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN07_Pos)
#define GPIO_BSETCLR_BSETPIN07                              GPIO_BSETCLR_BSETPIN07_Msk
#define GPIO_BSETCLR_BSETPIN08_Pos                          (24U)
#define GPIO_BSETCLR_BSETPIN08_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN08_Pos)
#define GPIO_BSETCLR_BSETPIN08                              GPIO_BSETCLR_BSETPIN08_Msk
#define GPIO_BSETCLR_BSETPIN09_Pos                          (25U)
#define GPIO_BSETCLR_BSETPIN09_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN09_Pos)
#define GPIO_BSETCLR_BSETPIN09                              GPIO_BSETCLR_BSETPIN09_Msk
#define GPIO_BSETCLR_BSETPIN10_Pos                          (26U)
#define GPIO_BSETCLR_BSETPIN10_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN10_Pos)
#define GPIO_BSETCLR_BSETPIN10                              GPIO_BSETCLR_BSETPIN10_Msk
#define GPIO_BSETCLR_BSETPIN11_Pos                          (27U)
#define GPIO_BSETCLR_BSETPIN11_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN11_Pos)
#define GPIO_BSETCLR_BSETPIN11                              GPIO_BSETCLR_BSETPIN11_Msk
#define GPIO_BSETCLR_BSETPIN12_Pos                          (28U)
#define GPIO_BSETCLR_BSETPIN12_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN12_Pos)
#define GPIO_BSETCLR_BSETPIN12                              GPIO_BSETCLR_BSETPIN12_Msk
#define GPIO_BSETCLR_BSETPIN13_Pos                          (29U)
#define GPIO_BSETCLR_BSETPIN13_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN13_Pos)
#define GPIO_BSETCLR_BSETPIN13                              GPIO_BSETCLR_BSETPIN13_Msk
#define GPIO_BSETCLR_BSETPIN14_Pos                          (30U)
#define GPIO_BSETCLR_BSETPIN14_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN14_Pos)
#define GPIO_BSETCLR_BSETPIN14                              GPIO_BSETCLR_BSETPIN14_Msk
#define GPIO_BSETCLR_BSETPIN15_Pos                          (31U)
#define GPIO_BSETCLR_BSETPIN15_Msk                          (0x1UL << GPIO_BSETCLR_BSETPIN15_Pos)
#define GPIO_BSETCLR_BSETPIN15                              GPIO_BSETCLR_BSETPIN15_Msk

// GPIO_PU
#define GPIO_PU_PIN00_Pos                                   (0U)
#define GPIO_PU_PIN00_Msk                                   (0x1UL << GPIO_PU_PIN00_Pos)
#define GPIO_PU_PIN00                                       GPIO_PU_PIN00_Msk
#define GPIO_PU_PIN01_Pos                                   (1U)
#define GPIO_PU_PIN01_Msk                                   (0x1UL << GPIO_PU_PIN01_Pos)
#define GPIO_PU_PIN01                                       GPIO_PU_PIN01_Msk
#define GPIO_PU_PIN02_Pos                                   (2U)
#define GPIO_PU_PIN02_Msk                                   (0x1UL << GPIO_PU_PIN02_Pos)
#define GPIO_PU_PIN02                                       GPIO_PU_PIN02_Msk
#define GPIO_PU_PIN03_Pos                                   (3U)
#define GPIO_PU_PIN03_Msk                                   (0x1UL << GPIO_PU_PIN03_Pos)
#define GPIO_PU_PIN03                                       GPIO_PU_PIN03_Msk
#define GPIO_PU_PIN04_Pos                                   (4U)
#define GPIO_PU_PIN04_Msk                                   (0x1UL << GPIO_PU_PIN04_Pos)
#define GPIO_PU_PIN04                                       GPIO_PU_PIN04_Msk
#define GPIO_PU_PIN05_Pos                                   (5U)
#define GPIO_PU_PIN05_Msk                                   (0x1UL << GPIO_PU_PIN05_Pos)
#define GPIO_PU_PIN05                                       GPIO_PU_PIN05_Msk
#define GPIO_PU_PIN06_Pos                                   (6U)
#define GPIO_PU_PIN06_Msk                                   (0x1UL << GPIO_PU_PIN06_Pos)
#define GPIO_PU_PIN06                                       GPIO_PU_PIN06_Msk
#define GPIO_PU_PIN07_Pos                                   (7U)
#define GPIO_PU_PIN07_Msk                                   (0x1UL << GPIO_PU_PIN07_Pos)
#define GPIO_PU_PIN07                                       GPIO_PU_PIN07_Msk
#define GPIO_PU_PIN08_Pos                                   (8U)
#define GPIO_PU_PIN08_Msk                                   (0x1UL << GPIO_PU_PIN08_Pos)
#define GPIO_PU_PIN08                                       GPIO_PU_PIN08_Msk
#define GPIO_PU_PIN09_Pos                                   (9U)
#define GPIO_PU_PIN09_Msk                                   (0x1UL << GPIO_PU_PIN09_Pos)
#define GPIO_PU_PIN09                                       GPIO_PU_PIN09_Msk
#define GPIO_PU_PIN10_Pos                                   (10U)
#define GPIO_PU_PIN10_Msk                                   (0x1UL << GPIO_PU_PIN10_Pos)
#define GPIO_PU_PIN10                                       GPIO_PU_PIN10_Msk
#define GPIO_PU_PIN11_Pos                                   (11U)
#define GPIO_PU_PIN11_Msk                                   (0x1UL << GPIO_PU_PIN11_Pos)
#define GPIO_PU_PIN11                                       GPIO_PU_PIN11_Msk
#define GPIO_PU_PIN12_Pos                                   (12U)
#define GPIO_PU_PIN12_Msk                                   (0x1UL << GPIO_PU_PIN12_Pos)
#define GPIO_PU_PIN12                                       GPIO_PU_PIN12_Msk
#define GPIO_PU_PIN13_Pos                                   (13U)
#define GPIO_PU_PIN13_Msk                                   (0x1UL << GPIO_PU_PIN13_Pos)
#define GPIO_PU_PIN13                                       GPIO_PU_PIN13_Msk
#define GPIO_PU_PIN14_Pos                                   (14U)
#define GPIO_PU_PIN14_Msk                                   (0x1UL << GPIO_PU_PIN14_Pos)
#define GPIO_PU_PIN14                                       GPIO_PU_PIN14_Msk
#define GPIO_PU_PIN15_Pos                                   (15U)
#define GPIO_PU_PIN15_Msk                                   (0x1UL << GPIO_PU_PIN15_Pos)
#define GPIO_PU_PIN15                                       GPIO_PU_PIN15_Msk

// GPIO_OD
#define GPIO_OD_PIN00_Pos                                   (0U)
#define GPIO_OD_PIN00_Msk                                   (0x1UL << GPIO_OD_PIN00_Pos)
#define GPIO_OD_PIN00                                       GPIO_OD_PIN00_Msk
#define GPIO_OD_PIN01_Pos                                   (1U)
#define GPIO_OD_PIN01_Msk                                   (0x1UL << GPIO_OD_PIN01_Pos)
#define GPIO_OD_PIN01                                       GPIO_OD_PIN01_Msk
#define GPIO_OD_PIN02_Pos                                   (2U)
#define GPIO_OD_PIN02_Msk                                   (0x1UL << GPIO_OD_PIN02_Pos)
#define GPIO_OD_PIN02                                       GPIO_OD_PIN02_Msk
#define GPIO_OD_PIN03_Pos                                   (3U)
#define GPIO_OD_PIN03_Msk                                   (0x1UL << GPIO_OD_PIN03_Pos)
#define GPIO_OD_PIN03                                       GPIO_OD_PIN03_Msk
#define GPIO_OD_PIN04_Pos                                   (4U)
#define GPIO_OD_PIN04_Msk                                   (0x1UL << GPIO_OD_PIN04_Pos)
#define GPIO_OD_PIN04                                       GPIO_OD_PIN04_Msk
#define GPIO_OD_PIN05_Pos                                   (5U)
#define GPIO_OD_PIN05_Msk                                   (0x1UL << GPIO_OD_PIN05_Pos)
#define GPIO_OD_PIN05                                       GPIO_OD_PIN05_Msk
#define GPIO_OD_PIN06_Pos                                   (6U)
#define GPIO_OD_PIN06_Msk                                   (0x1UL << GPIO_OD_PIN06_Pos)
#define GPIO_OD_PIN06                                       GPIO_OD_PIN06_Msk
#define GPIO_OD_PIN07_Pos                                   (7U)
#define GPIO_OD_PIN07_Msk                                   (0x1UL << GPIO_OD_PIN07_Pos)
#define GPIO_OD_PIN07                                       GPIO_OD_PIN07_Msk
#define GPIO_OD_PIN08_Pos                                   (8U)
#define GPIO_OD_PIN08_Msk                                   (0x1UL << GPIO_OD_PIN08_Pos)
#define GPIO_OD_PIN08                                       GPIO_OD_PIN08_Msk
#define GPIO_OD_PIN09_Pos                                   (9U)
#define GPIO_OD_PIN09_Msk                                   (0x1UL << GPIO_OD_PIN09_Pos)
#define GPIO_OD_PIN09                                       GPIO_OD_PIN09_Msk
#define GPIO_OD_PIN10_Pos                                   (10U)
#define GPIO_OD_PIN10_Msk                                   (0x1UL << GPIO_OD_PIN10_Pos)
#define GPIO_OD_PIN10                                       GPIO_OD_PIN10_Msk
#define GPIO_OD_PIN11_Pos                                   (11U)
#define GPIO_OD_PIN11_Msk                                   (0x1UL << GPIO_OD_PIN11_Pos)
#define GPIO_OD_PIN11                                       GPIO_OD_PIN11_Msk
#define GPIO_OD_PIN12_Pos                                   (12U)
#define GPIO_OD_PIN12_Msk                                   (0x1UL << GPIO_OD_PIN12_Pos)
#define GPIO_OD_PIN12                                       GPIO_OD_PIN12_Msk
#define GPIO_OD_PIN13_Pos                                   (13U)
#define GPIO_OD_PIN13_Msk                                   (0x1UL << GPIO_OD_PIN13_Pos)
#define GPIO_OD_PIN13                                       GPIO_OD_PIN13_Msk
#define GPIO_OD_PIN14_Pos                                   (14U)
#define GPIO_OD_PIN14_Msk                                   (0x1UL << GPIO_OD_PIN14_Pos)
#define GPIO_OD_PIN14                                       GPIO_OD_PIN14_Msk
#define GPIO_OD_PIN15_Pos                                   (15U)
#define GPIO_OD_PIN15_Msk                                   (0x1UL << GPIO_OD_PIN15_Pos)
#define GPIO_OD_PIN15                                       GPIO_OD_PIN15_Msk

// GPIO_HIE
#define GPIO_HIE_PIN00_Pos                                  (0U)
#define GPIO_HIE_PIN00_Msk                                  (0x1UL << GPIO_HIE_PIN00_Pos)
#define GPIO_HIE_PIN00                                      GPIO_HIE_PIN00_Msk
#define GPIO_HIE_PIN01_Pos                                  (1U)
#define GPIO_HIE_PIN01_Msk                                  (0x1UL << GPIO_HIE_PIN01_Pos)
#define GPIO_HIE_PIN01                                      GPIO_HIE_PIN01_Msk
#define GPIO_HIE_PIN02_Pos                                  (2U)
#define GPIO_HIE_PIN02_Msk                                  (0x1UL << GPIO_HIE_PIN02_Pos)
#define GPIO_HIE_PIN02                                      GPIO_HIE_PIN02_Msk
#define GPIO_HIE_PIN03_Pos                                  (3U)
#define GPIO_HIE_PIN03_Msk                                  (0x1UL << GPIO_HIE_PIN03_Pos)
#define GPIO_HIE_PIN03                                      GPIO_HIE_PIN03_Msk
#define GPIO_HIE_PIN04_Pos                                  (4U)
#define GPIO_HIE_PIN04_Msk                                  (0x1UL << GPIO_HIE_PIN04_Pos)
#define GPIO_HIE_PIN04                                      GPIO_HIE_PIN04_Msk
#define GPIO_HIE_PIN05_Pos                                  (5U)
#define GPIO_HIE_PIN05_Msk                                  (0x1UL << GPIO_HIE_PIN05_Pos)
#define GPIO_HIE_PIN05                                      GPIO_HIE_PIN05_Msk
#define GPIO_HIE_PIN06_Pos                                  (6U)
#define GPIO_HIE_PIN06_Msk                                  (0x1UL << GPIO_HIE_PIN06_Pos)
#define GPIO_HIE_PIN06                                      GPIO_HIE_PIN06_Msk
#define GPIO_HIE_PIN07_Pos                                  (7U)
#define GPIO_HIE_PIN07_Msk                                  (0x1UL << GPIO_HIE_PIN07_Pos)
#define GPIO_HIE_PIN07                                      GPIO_HIE_PIN07_Msk
#define GPIO_HIE_PIN08_Pos                                  (8U)
#define GPIO_HIE_PIN08_Msk                                  (0x1UL << GPIO_HIE_PIN08_Pos)
#define GPIO_HIE_PIN08                                      GPIO_HIE_PIN08_Msk
#define GPIO_HIE_PIN09_Pos                                  (9U)
#define GPIO_HIE_PIN09_Msk                                  (0x1UL << GPIO_HIE_PIN09_Pos)
#define GPIO_HIE_PIN09                                      GPIO_HIE_PIN09_Msk
#define GPIO_HIE_PIN10_Pos                                  (10U)
#define GPIO_HIE_PIN10_Msk                                  (0x1UL << GPIO_HIE_PIN10_Pos)
#define GPIO_HIE_PIN10                                      GPIO_HIE_PIN10_Msk
#define GPIO_HIE_PIN11_Pos                                  (11U)
#define GPIO_HIE_PIN11_Msk                                  (0x1UL << GPIO_HIE_PIN11_Pos)
#define GPIO_HIE_PIN11                                      GPIO_HIE_PIN11_Msk
#define GPIO_HIE_PIN12_Pos                                  (12U)
#define GPIO_HIE_PIN12_Msk                                  (0x1UL << GPIO_HIE_PIN12_Pos)
#define GPIO_HIE_PIN12                                      GPIO_HIE_PIN12_Msk
#define GPIO_HIE_PIN13_Pos                                  (13U)
#define GPIO_HIE_PIN13_Msk                                  (0x1UL << GPIO_HIE_PIN13_Pos)
#define GPIO_HIE_PIN13                                      GPIO_HIE_PIN13_Msk
#define GPIO_HIE_PIN14_Pos                                  (14U)
#define GPIO_HIE_PIN14_Msk                                  (0x1UL << GPIO_HIE_PIN14_Pos)
#define GPIO_HIE_PIN14                                      GPIO_HIE_PIN14_Msk
#define GPIO_HIE_PIN15_Pos                                  (15U)
#define GPIO_HIE_PIN15_Msk                                  (0x1UL << GPIO_HIE_PIN15_Pos)
#define GPIO_HIE_PIN15                                      GPIO_HIE_PIN15_Msk

