yuer-12342/sx1280-test/mcu/common/hc32l021.h
// GPIO_LIE
#define GPIO_LIE_PIN00_Pos                                  (0U)
#define GPIO_LIE_PIN00_Msk                                  (0x1UL << GPIO_LIE_PIN00_Pos)
#define GPIO_LIE_PIN00                                      GPIO_LIE_PIN00_Msk
#define GPIO_LIE_PIN01_Pos                                  (1U)
#define GPIO_LIE_PIN01_Msk                                  (0x1UL << GPIO_LIE_PIN01_Pos)
#define GPIO_LIE_PIN01                                      GPIO_LIE_PIN01_Msk
#define GPIO_LIE_PIN02_Pos                                  (2U)
#define GPIO_LIE_PIN02_Msk                                  (0x1UL << GPIO_LIE_PIN02_Pos)
#define GPIO_LIE_PIN02                                      GPIO_LIE_PIN02_Msk
#define GPIO_LIE_PIN03_Pos                                  (3U)
#define GPIO_LIE_PIN03_Msk                                  (0x1UL << GPIO_LIE_PIN03_Pos)
#define GPIO_LIE_PIN03                                      GPIO_LIE_PIN03_Msk
#define GPIO_LIE_PIN04_Pos                                  (4U)
#define GPIO_LIE_PIN04_Msk                                  (0x1UL << GPIO_LIE_PIN04_Pos)
#define GPIO_LIE_PIN04                                      GPIO_LIE_PIN04_Msk
#define GPIO_LIE_PIN05_Pos                                  (5U)
#define GPIO_LIE_PIN05_Msk                                  (0x1UL << GPIO_LIE_PIN05_Pos)
#define GPIO_LIE_PIN05                                      GPIO_LIE_PIN05_Msk
#define GPIO_LIE_PIN06_Pos                                  (6U)
#define GPIO_LIE_PIN06_Msk                                  (0x1UL << GPIO_LIE_PIN06_Pos)
#define GPIO_LIE_PIN06                                      GPIO_LIE_PIN06_Msk
#define GPIO_LIE_PIN07_Pos                                  (7U)
#define GPIO_LIE_PIN07_Msk                                  (0x1UL << GPIO_LIE_PIN07_Pos)
#define GPIO_LIE_PIN07                                      GPIO_LIE_PIN07_Msk
#define GPIO_LIE_PIN08_Pos                                  (8U)
#define GPIO_LIE_PIN08_Msk                                  (0x1UL << GPIO_LIE_PIN08_Pos)
#define GPIO_LIE_PIN08                                      GPIO_LIE_PIN08_Msk
#define GPIO_LIE_PIN09_Pos                                  (9U)
#define GPIO_LIE_PIN09_Msk                                  (0x1UL << GPIO_LIE_PIN09_Pos)
#define GPIO_LIE_PIN09                                      GPIO_LIE_PIN09_Msk
#define GPIO_LIE_PIN10_Pos                                  (10U)
#define GPIO_LIE_PIN10_Msk                                  (0x1UL << GPIO_LIE_PIN10_Pos)
#define GPIO_LIE_PIN10                                      GPIO_LIE_PIN10_Msk
#define GPIO_LIE_PIN11_Pos                                  (11U)
#define GPIO_LIE_PIN11_Msk                                  (0x1UL << GPIO_LIE_PIN11_Pos)
#define GPIO_LIE_PIN11                                      GPIO_LIE_PIN11_Msk
#define GPIO_LIE_PIN12_Pos                                  (12U)
#define GPIO_LIE_PIN12_Msk                                  (0x1UL << GPIO_LIE_PIN12_Pos)
#define GPIO_LIE_PIN12                                      GPIO_LIE_PIN12_Msk
#define GPIO_LIE_PIN13_Pos                                  (13U)
#define GPIO_LIE_PIN13_Msk                                  (0x1UL << GPIO_LIE_PIN13_Pos)
#define GPIO_LIE_PIN13                                      GPIO_LIE_PIN13_Msk
#define GPIO_LIE_PIN14_Pos                                  (14U)
#define GPIO_LIE_PIN14_Msk                                  (0x1UL << GPIO_LIE_PIN14_Pos)
#define GPIO_LIE_PIN14                                      GPIO_LIE_PIN14_Msk
#define GPIO_LIE_PIN15_Pos                                  (15U)
#define GPIO_LIE_PIN15_Msk                                  (0x1UL << GPIO_LIE_PIN15_Pos)
#define GPIO_LIE_PIN15                                      GPIO_LIE_PIN15_Msk

// GPIO_RIE
#define GPIO_RIE_PIN00_Pos                                  (0U)
#define GPIO_RIE_PIN00_Msk                                  (0x1UL << GPIO_RIE_PIN00_Pos)
#define GPIO_RIE_PIN00                                      GPIO_RIE_PIN00_Msk
#define GPIO_RIE_PIN01_Pos                                  (1U)
#define GPIO_RIE_PIN01_Msk                                  (0x1UL << GPIO_RIE_PIN01_Pos)
#define GPIO_RIE_PIN01                                      GPIO_RIE_PIN01_Msk
#define GPIO_RIE_PIN02_Pos                                  (2U)
#define GPIO_RIE_PIN02_Msk                                  (0x1UL << GPIO_RIE_PIN02_Pos)
#define GPIO_RIE_PIN02                                      GPIO_RIE_PIN02_Msk
#define GPIO_RIE_PIN03_Pos                                  (3U)
#define GPIO_RIE_PIN03_Msk                                  (0x1UL << GPIO_RIE_PIN03_Pos)
#define GPIO_RIE_PIN03                                      GPIO_RIE_PIN03_Msk
#define GPIO_RIE_PIN04_Pos                                  (4U)
#define GPIO_RIE_PIN04_Msk                                  (0x1UL << GPIO_RIE_PIN04_Pos)
#define GPIO_RIE_PIN04                                      GPIO_RIE_PIN04_Msk
#define GPIO_RIE_PIN05_Pos                                  (5U)
#define GPIO_RIE_PIN05_Msk                                  (0x1UL << GPIO_RIE_PIN05_Pos)
#define GPIO_RIE_PIN05                                      GPIO_RIE_PIN05_Msk
#define GPIO_RIE_PIN06_Pos                                  (6U)
#define GPIO_RIE_PIN06_Msk                                  (0x1UL << GPIO_RIE_PIN06_Pos)
#define GPIO_RIE_PIN06                                      GPIO_RIE_PIN06_Msk
#define GPIO_RIE_PIN07_Pos                                  (7U)
#define GPIO_RIE_PIN07_Msk                                  (0x1UL << GPIO_RIE_PIN07_Pos)
#define GPIO_RIE_PIN07                                      GPIO_RIE_PIN07_Msk
#define GPIO_RIE_PIN08_Pos                                  (8U)
#define GPIO_RIE_PIN08_Msk                                  (0x1UL << GPIO_RIE_PIN08_Pos)
#define GPIO_RIE_PIN08                                      GPIO_RIE_PIN08_Msk
#define GPIO_RIE_PIN09_Pos                                  (9U)
#define GPIO_RIE_PIN09_Msk                                  (0x1UL << GPIO_RIE_PIN09_Pos)
#define GPIO_RIE_PIN09                                      GPIO_RIE_PIN09_Msk
#define GPIO_RIE_PIN10_Pos                                  (10U)
#define GPIO_RIE_PIN10_Msk                                  (0x1UL << GPIO_RIE_PIN10_Pos)
#define GPIO_RIE_PIN10                                      GPIO_RIE_PIN10_Msk
#define GPIO_RIE_PIN11_Pos                                  (11U)
#define GPIO_RIE_PIN11_Msk                                  (0x1UL << GPIO_RIE_PIN11_Pos)
#define GPIO_RIE_PIN11                                      GPIO_RIE_PIN11_Msk
#define GPIO_RIE_PIN12_Pos                                  (12U)
#define GPIO_RIE_PIN12_Msk                                  (0x1UL << GPIO_RIE_PIN12_Pos)
#define GPIO_RIE_PIN12                                      GPIO_RIE_PIN12_Msk
#define GPIO_RIE_PIN13_Pos                                  (13U)
#define GPIO_RIE_PIN13_Msk                                  (0x1UL << GPIO_RIE_PIN13_Pos)
#define GPIO_RIE_PIN13                                      GPIO_RIE_PIN13_Msk
#define GPIO_RIE_PIN14_Pos                                  (14U)
#define GPIO_RIE_PIN14_Msk                                  (0x1UL << GPIO_RIE_PIN14_Pos)
#define GPIO_RIE_PIN14                                      GPIO_RIE_PIN14_Msk
#define GPIO_RIE_PIN15_Pos                                  (15U)
#define GPIO_RIE_PIN15_Msk                                  (0x1UL << GPIO_RIE_PIN15_Pos)
#define GPIO_RIE_PIN15                                      GPIO_RIE_PIN15_Msk

// GPIO_FIE
#define GPIO_FIE_PIN00_Pos                                  (0U)
#define GPIO_FIE_PIN00_Msk                                  (0x1UL << GPIO_FIE_PIN00_Pos)
#define GPIO_FIE_PIN00                                      GPIO_FIE_PIN00_Msk
#define GPIO_FIE_PIN01_Pos                                  (1U)
#define GPIO_FIE_PIN01_Msk                                  (0x1UL << GPIO_FIE_PIN01_Pos)
#define GPIO_FIE_PIN01                                      GPIO_FIE_PIN01_Msk
#define GPIO_FIE_PIN02_Pos                                  (2U)
#define GPIO_FIE_PIN02_Msk                                  (0x1UL << GPIO_FIE_PIN02_Pos)
#define GPIO_FIE_PIN02                                      GPIO_FIE_PIN02_Msk
#define GPIO_FIE_PIN03_Pos                                  (3U)
#define GPIO_FIE_PIN03_Msk                                  (0x1UL << GPIO_FIE_PIN03_Pos)
#define GPIO_FIE_PIN03                                      GPIO_FIE_PIN03_Msk
#define GPIO_FIE_PIN04_Pos                                  (4U)
#define GPIO_FIE_PIN04_Msk                                  (0x1UL << GPIO_FIE_PIN04_Pos)
#define GPIO_FIE_PIN04                                      GPIO_FIE_PIN04_Msk
#define GPIO_FIE_PIN05_Pos                                  (5U)
#define GPIO_FIE_PIN05_Msk                                  (0x1UL << GPIO_FIE_PIN05_Pos)
#define GPIO_FIE_PIN05                                      GPIO_FIE_PIN05_Msk
#define GPIO_FIE_PIN06_Pos                                  (6U)
#define GPIO_FIE_PIN06_Msk                                  (0x1UL << GPIO_FIE_PIN06_Pos)
#define GPIO_FIE_PIN06                                      GPIO_FIE_PIN06_Msk
#define GPIO_FIE_PIN07_Pos                                  (7U)
#define GPIO_FIE_PIN07_Msk                                  (0x1UL << GPIO_FIE_PIN07_Pos)
#define GPIO_FIE_PIN07                                      GPIO_FIE_PIN07_Msk
#define GPIO_FIE_PIN08_Pos                                  (8U)
#define GPIO_FIE_PIN08_Msk                                  (0x1UL << GPIO_FIE_PIN08_Pos)
#define GPIO_FIE_PIN08                                      GPIO_FIE_PIN08_Msk
#define GPIO_FIE_PIN09_Pos                                  (9U)
#define GPIO_FIE_PIN09_Msk                                  (0x1UL << GPIO_FIE_PIN09_Pos)
#define GPIO_FIE_PIN09                                      GPIO_FIE_PIN09_Msk
#define GPIO_FIE_PIN10_Pos                                  (10U)
#define GPIO_FIE_PIN10_Msk                                  (0x1UL << GPIO_FIE_PIN10_Pos)
#define GPIO_FIE_PIN10                                      GPIO_FIE_PIN10_Msk
#define GPIO_FIE_PIN11_Pos                                  (11U)
#define GPIO_FIE_PIN11_Msk                                  (0x1UL << GPIO_FIE_PIN11_Pos)
#define GPIO_FIE_PIN11                                      GPIO_FIE_PIN11_Msk
#define GPIO_FIE_PIN12_Pos                                  (12U)
#define GPIO_FIE_PIN12_Msk                                  (0x1UL << GPIO_FIE_PIN12_Pos)
#define GPIO_FIE_PIN12                                      GPIO_FIE_PIN12_Msk
#define GPIO_FIE_PIN13_Pos                                  (13U)
#define GPIO_FIE_PIN13_Msk                                  (0x1UL << GPIO_FIE_PIN13_Pos)
#define GPIO_FIE_PIN13                                      GPIO_FIE_PIN13_Msk
#define GPIO_FIE_PIN14_Pos                                  (14U)
#define GPIO_FIE_PIN14_Msk                                  (0x1UL << GPIO_FIE_PIN14_Pos)
#define GPIO_FIE_PIN14                                      GPIO_FIE_PIN14_Msk
#define GPIO_FIE_PIN15_Pos                                  (15U)
#define GPIO_FIE_PIN15_Msk                                  (0x1UL << GPIO_FIE_PIN15_Pos)
#define GPIO_FIE_PIN15                                      GPIO_FIE_PIN15_Msk

// GPIO_STAT
#define GPIO_STAT_PIN00_Pos                                 (0U)
#define GPIO_STAT_PIN00_Msk                                 (0x1UL << GPIO_STAT_PIN00_Pos)
#define GPIO_STAT_PIN00                                     GPIO_STAT_PIN00_Msk
#define GPIO_STAT_PIN01_Pos                                 (1U)
#define GPIO_STAT_PIN01_Msk                                 (0x1UL << GPIO_STAT_PIN01_Pos)
#define GPIO_STAT_PIN01                                     GPIO_STAT_PIN01_Msk
#define GPIO_STAT_PIN02_Pos                                 (2U)
#define GPIO_STAT_PIN02_Msk                                 (0x1UL << GPIO_STAT_PIN02_Pos)
#define GPIO_STAT_PIN02                                     GPIO_STAT_PIN02_Msk
#define GPIO_STAT_PIN03_Pos                                 (3U)
#define GPIO_STAT_PIN03_Msk                                 (0x1UL << GPIO_STAT_PIN03_Pos)
#define GPIO_STAT_PIN03                                     GPIO_STAT_PIN03_Msk
#define GPIO_STAT_PIN04_Pos                                 (4U)
#define GPIO_STAT_PIN04_Msk                                 (0x1UL << GPIO_STAT_PIN04_Pos)
#define GPIO_STAT_PIN04                                     GPIO_STAT_PIN04_Msk
#define GPIO_STAT_PIN05_Pos                                 (5U)
#define GPIO_STAT_PIN05_Msk                                 (0x1UL << GPIO_STAT_PIN05_Pos)
#define GPIO_STAT_PIN05                                     GPIO_STAT_PIN05_Msk
#define GPIO_STAT_PIN06_Pos                                 (6U)
#define GPIO_STAT_PIN06_Msk                                 (0x1UL << GPIO_STAT_PIN06_Pos)
#define GPIO_STAT_PIN06                                     GPIO_STAT_PIN06_Msk
#define GPIO_STAT_PIN07_Pos                                 (7U)
#define GPIO_STAT_PIN07_Msk                                 (0x1UL << GPIO_STAT_PIN07_Pos)
#define GPIO_STAT_PIN07                                     GPIO_STAT_PIN07_Msk
#define GPIO_STAT_PIN08_Pos                                 (8U)
#define GPIO_STAT_PIN08_Msk                                 (0x1UL << GPIO_STAT_PIN08_Pos)
#define GPIO_STAT_PIN08                                     GPIO_STAT_PIN08_Msk
#define GPIO_STAT_PIN09_Pos                                 (9U)
#define GPIO_STAT_PIN09_Msk                                 (0x1UL << GPIO_STAT_PIN09_Pos)
#define GPIO_STAT_PIN09                                     GPIO_STAT_PIN09_Msk
#define GPIO_STAT_PIN10_Pos                                 (10U)
#define GPIO_STAT_PIN10_Msk                                 (0x1UL << GPIO_STAT_PIN10_Pos)
#define GPIO_STAT_PIN10                                     GPIO_STAT_PIN10_Msk
#define GPIO_STAT_PIN11_Pos                                 (11U)
#define GPIO_STAT_PIN11_Msk                                 (0x1UL << GPIO_STAT_PIN11_Pos)
#define GPIO_STAT_PIN11                                     GPIO_STAT_PIN11_Msk
#define GPIO_STAT_PIN12_Pos                                 (12U)
#define GPIO_STAT_PIN12_Msk                                 (0x1UL << GPIO_STAT_PIN12_Pos)
#define GPIO_STAT_PIN12                                     GPIO_STAT_PIN12_Msk
#define GPIO_STAT_PIN13_Pos                                 (13U)
#define GPIO_STAT_PIN13_Msk                                 (0x1UL << GPIO_STAT_PIN13_Pos)
#define GPIO_STAT_PIN13                                     GPIO_STAT_PIN13_Msk
#define GPIO_STAT_PIN14_Pos                                 (14U)
#define GPIO_STAT_PIN14_Msk                                 (0x1UL << GPIO_STAT_PIN14_Pos)
#define GPIO_STAT_PIN14                                     GPIO_STAT_PIN14_Msk
#define GPIO_STAT_PIN15_Pos                                 (15U)
#define GPIO_STAT_PIN15_Msk                                 (0x1UL << GPIO_STAT_PIN15_Pos)
#define GPIO_STAT_PIN15                                     GPIO_STAT_PIN15_Msk

// GPIO_ICLR
#define GPIO_ICLR_PIN00_Pos                                 (0U)
#define GPIO_ICLR_PIN00_Msk                                 (0x1UL << GPIO_ICLR_PIN00_Pos)
#define GPIO_ICLR_PIN00                                     GPIO_ICLR_PIN00_Msk
#define GPIO_ICLR_PIN01_Pos                                 (1U)
#define GPIO_ICLR_PIN01_Msk                                 (0x1UL << GPIO_ICLR_PIN01_Pos)
#define GPIO_ICLR_PIN01                                     GPIO_ICLR_PIN01_Msk
#define GPIO_ICLR_PIN02_Pos                                 (2U)
#define GPIO_ICLR_PIN02_Msk                                 (0x1UL << GPIO_ICLR_PIN02_Pos)
#define GPIO_ICLR_PIN02                                     GPIO_ICLR_PIN02_Msk
#define GPIO_ICLR_PIN03_Pos                                 (3U)
#define GPIO_ICLR_PIN03_Msk                                 (0x1UL << GPIO_ICLR_PIN03_Pos)
#define GPIO_ICLR_PIN03                                     GPIO_ICLR_PIN03_Msk
#define GPIO_ICLR_PIN04_Pos                                 (4U)
#define GPIO_ICLR_PIN04_Msk                                 (0x1UL << GPIO_ICLR_PIN04_Pos)
#define GPIO_ICLR_PIN04                                     GPIO_ICLR_PIN04_Msk
#define GPIO_ICLR_PIN05_Pos                                 (5U)
#define GPIO_ICLR_PIN05_Msk                                 (0x1UL << GPIO_ICLR_PIN05_Pos)
#define GPIO_ICLR_PIN05                                     GPIO_ICLR_PIN05_Msk
#define GPIO_ICLR_PIN06_Pos                                 (6U)
#define GPIO_ICLR_PIN06_Msk                                 (0x1UL << GPIO_ICLR_PIN06_Pos)
#define GPIO_ICLR_PIN06                                     GPIO_ICLR_PIN06_Msk
#define GPIO_ICLR_PIN07_Pos                                 (7U)
#define GPIO_ICLR_PIN07_Msk                                 (0x1UL << GPIO_ICLR_PIN07_Pos)
#define GPIO_ICLR_PIN07                                     GPIO_ICLR_PIN07_Msk
#define GPIO_ICLR_PIN08_Pos                                 (8U)
#define GPIO_ICLR_PIN08_Msk                                 (0x1UL << GPIO_ICLR_PIN08_Pos)
#define GPIO_ICLR_PIN08                                     GPIO_ICLR_PIN08_Msk
#define GPIO_ICLR_PIN09_Pos                                 (9U)
#define GPIO_ICLR_PIN09_Msk                                 (0x1UL << GPIO_ICLR_PIN09_Pos)
#define GPIO_ICLR_PIN09                                     GPIO_ICLR_PIN09_Msk
#define GPIO_ICLR_PIN10_Pos                                 (10U)
#define GPIO_ICLR_PIN10_Msk                                 (0x1UL << GPIO_ICLR_PIN10_Pos)
#define GPIO_ICLR_PIN10                                     GPIO_ICLR_PIN10_Msk
#define GPIO_ICLR_PIN11_Pos                                 (11U)
#define GPIO_ICLR_PIN11_Msk                                 (0x1UL << GPIO_ICLR_PIN11_Pos)
#define GPIO_ICLR_PIN11                                     GPIO_ICLR_PIN11_Msk
#define GPIO_ICLR_PIN12_Pos                                 (12U)
#define GPIO_ICLR_PIN12_Msk                                 (0x1UL << GPIO_ICLR_PIN12_Pos)
#define GPIO_ICLR_PIN12                                     GPIO_ICLR_PIN12_Msk
#define GPIO_ICLR_PIN13_Pos                                 (13U)
#define GPIO_ICLR_PIN13_Msk                                 (0x1UL << GPIO_ICLR_PIN13_Pos)
#define GPIO_ICLR_PIN13                                     GPIO_ICLR_PIN13_Msk
#define GPIO_ICLR_PIN14_Pos                                 (14U)
#define GPIO_ICLR_PIN14_Msk                                 (0x1UL << GPIO_ICLR_PIN14_Pos)
#define GPIO_ICLR_PIN14                                     GPIO_ICLR_PIN14_Msk
#define GPIO_ICLR_PIN15_Pos                                 (15U)
#define GPIO_ICLR_PIN15_Msk                                 (0x1UL << GPIO_ICLR_PIN15_Pos)
#define GPIO_ICLR_PIN15                                     GPIO_ICLR_PIN15_Msk



