yuer-12342/sx1280-test/mcu/common/hc32l021.h
//********************    Bits Define For Peripheral GPIOAUX    ********************//
// GPIOAUX_CTRL1
#define GPIOAUX_CTRL1_IR_POL_Pos                            (14U)
#define GPIOAUX_CTRL1_IR_POL_Msk                            (0x1UL << GPIOAUX_CTRL1_IR_POL_Pos)
#define GPIOAUX_CTRL1_IR_POL                                GPIOAUX_CTRL1_IR_POL_Msk
#define GPIOAUX_CTRL1_HSI2C_LSEL_Pos                        (15U)
#define GPIOAUX_CTRL1_HSI2C_LSEL_Msk                        (0x1UL << GPIOAUX_CTRL1_HSI2C_LSEL_Pos)
#define GPIOAUX_CTRL1_HSI2C_LSEL                            GPIOAUX_CTRL1_HSI2C_LSEL_Msk

// GPIOAUX_CTRL2
#define GPIOAUX_CTRL2_TCLK_SEL_Pos                          (4U)
#define GPIOAUX_CTRL2_TCLK_SEL_Msk                          (0x3UL << GPIOAUX_CTRL2_TCLK_SEL_Pos)
#define GPIOAUX_CTRL2_TCLK_SEL                              GPIOAUX_CTRL2_TCLK_SEL_Msk
#define GPIOAUX_CTRL2_TCLK_DIV_Pos                          (6U)
#define GPIOAUX_CTRL2_TCLK_DIV_Msk                          (0x3UL << GPIOAUX_CTRL2_TCLK_DIV_Pos)
#define GPIOAUX_CTRL2_TCLK_DIV                              GPIOAUX_CTRL2_TCLK_DIV_Msk

// GPIOAUX_TIMES
#define GPIOAUX_TIMES_CTIM0_E_Pos                           (0U)
#define GPIOAUX_TIMES_CTIM0_E_Msk                           (0x3UL << GPIOAUX_TIMES_CTIM0_E_Pos)
#define GPIOAUX_TIMES_CTIM0_E                               GPIOAUX_TIMES_CTIM0_E_Msk
#define GPIOAUX_TIMES_CTIM1_E_Pos                           (3U)
#define GPIOAUX_TIMES_CTIM1_E_Msk                           (0x3UL << GPIOAUX_TIMES_CTIM1_E_Pos)
#define GPIOAUX_TIMES_CTIM1_E                               GPIOAUX_TIMES_CTIM1_E_Msk
#define GPIOAUX_TIMES_ATIM3_E_Pos                           (9U)
#define GPIOAUX_TIMES_ATIM3_E_Msk                           (0x7UL << GPIOAUX_TIMES_ATIM3_E_Pos)
#define GPIOAUX_TIMES_ATIM3_E                               GPIOAUX_TIMES_ATIM3_E_Msk

// GPIOAUX_TIMCPS
#define GPIOAUX_TIMCPS_CTIM0_C0_Pos                         (0U)
#define GPIOAUX_TIMCPS_CTIM0_C0_Msk                         (0x3UL << GPIOAUX_TIMCPS_CTIM0_C0_Pos)
#define GPIOAUX_TIMCPS_CTIM0_C0                             GPIOAUX_TIMCPS_CTIM0_C0_Msk
#define GPIOAUX_TIMCPS_CTIM1_C0_Pos                         (3U)
#define GPIOAUX_TIMCPS_CTIM1_C0_Msk                         (0x3UL << GPIOAUX_TIMCPS_CTIM1_C0_Pos)
#define GPIOAUX_TIMCPS_CTIM1_C0                             GPIOAUX_TIMCPS_CTIM1_C0_Msk
#define GPIOAUX_TIMCPS_ATIM3_C0A_Pos                        (9U)
#define GPIOAUX_TIMCPS_ATIM3_C0A_Msk                        (0x3UL << GPIOAUX_TIMCPS_ATIM3_C0A_Pos)
#define GPIOAUX_TIMCPS_ATIM3_C0A                            GPIOAUX_TIMCPS_ATIM3_C0A_Msk

// GPIOAUX_FLTCFG
#define GPIOAUX_FLTCFG_PB0FLT_EN_Pos                        (5U)
#define GPIOAUX_FLTCFG_PB0FLT_EN_Msk                        (0x1UL << GPIOAUX_FLTCFG_PB0FLT_EN_Pos)
#define GPIOAUX_FLTCFG_PB0FLT_EN                            GPIOAUX_FLTCFG_PB0FLT_EN_Msk
#define GPIOAUX_FLTCFG_PA8FLT_EN_Pos                        (6U)
#define GPIOAUX_FLTCFG_PA8FLT_EN_Msk                        (0x1UL << GPIOAUX_FLTCFG_PA8FLT_EN_Pos)
#define GPIOAUX_FLTCFG_PA8FLT_EN                            GPIOAUX_FLTCFG_PA8FLT_EN_Msk
#define GPIOAUX_FLTCFG_PA0FLT_EN_Pos                        (7U)
#define GPIOAUX_FLTCFG_PA0FLT_EN_Msk                        (0x1UL << GPIOAUX_FLTCFG_PA0FLT_EN_Pos)
#define GPIOAUX_FLTCFG_PA0FLT_EN                            GPIOAUX_FLTCFG_PA0FLT_EN_Msk
#define GPIOAUX_FLTCFG_FCLK_DIV_Pos                         (8U)
#define GPIOAUX_FLTCFG_FCLK_DIV_Msk                         (0x3UL << GPIOAUX_FLTCFG_FCLK_DIV_Pos)
#define GPIOAUX_FLTCFG_FCLK_DIV                             GPIOAUX_FLTCFG_FCLK_DIV_Msk
#define GPIOAUX_FLTCFG_FCLK_SEL_Pos                         (10U)
#define GPIOAUX_FLTCFG_FCLK_SEL_Msk                         (0x1UL << GPIOAUX_FLTCFG_FCLK_SEL_Pos)
#define GPIOAUX_FLTCFG_FCLK_SEL                             GPIOAUX_FLTCFG_FCLK_SEL_Msk



//********************    Bits Define For Peripheral GTIM    ********************//
// GTIM_ARR
#define GTIM_ARR_ARR_Pos                                    (0U)
#define GTIM_ARR_ARR_Msk                                    (0xFFFFUL << GTIM_ARR_ARR_Pos)
#define GTIM_ARR_ARR                                        GTIM_ARR_ARR_Msk

// GTIM_CNT
#define GTIM_CNT_CNT_Pos                                    (0U)
#define GTIM_CNT_CNT_Msk                                    (0xFFFFUL << GTIM_CNT_CNT_Pos)
#define GTIM_CNT_CNT                                        GTIM_CNT_CNT_Msk

// GTIM_CMMR
#define GTIM_CMMR_CC0M_Pos                                  (0U)
#define GTIM_CMMR_CC0M_Msk                                  (0x7UL << GTIM_CMMR_CC0M_Pos)
#define GTIM_CMMR_CC0M                                      GTIM_CMMR_CC0M_Msk
#define GTIM_CMMR_CC1M_Pos                                  (4U)
#define GTIM_CMMR_CC1M_Msk                                  (0x7UL << GTIM_CMMR_CC1M_Pos)
#define GTIM_CMMR_CC1M                                      GTIM_CMMR_CC1M_Msk
#define GTIM_CMMR_CC2M_Pos                                  (8U)
#define GTIM_CMMR_CC2M_Msk                                  (0x7UL << GTIM_CMMR_CC2M_Pos)
#define GTIM_CMMR_CC2M                                      GTIM_CMMR_CC2M_Msk
#define GTIM_CMMR_CC3M_Pos                                  (12U)
#define GTIM_CMMR_CC3M_Msk                                  (0x7UL << GTIM_CMMR_CC3M_Pos)
#define GTIM_CMMR_CC3M                                      GTIM_CMMR_CC3M_Msk

// GTIM_CR1
#define GTIM_CR1_ETRFLT_Pos                                 (4U)
#define GTIM_CR1_ETRFLT_Msk                                 (0x7UL << GTIM_CR1_ETRFLT_Pos)
#define GTIM_CR1_ETRFLT                                     GTIM_CR1_ETRFLT_Msk

// GTIM_CR0
#define GTIM_CR0_CEN_Pos                                    (0U)
#define GTIM_CR0_CEN_Msk                                    (0x1UL << GTIM_CR0_CEN_Pos)
#define GTIM_CR0_CEN                                        GTIM_CR0_CEN_Msk
#define GTIM_CR0_MD_Pos                                     (1U)
#define GTIM_CR0_MD_Msk                                     (0x3UL << GTIM_CR0_MD_Pos)
#define GTIM_CR0_MD                                         GTIM_CR0_MD_Msk
#define GTIM_CR0_TOGEN_Pos                                  (3U)
#define GTIM_CR0_TOGEN_Msk                                  (0x1UL << GTIM_CR0_TOGEN_Pos)
#define GTIM_CR0_TOGEN                                      GTIM_CR0_TOGEN_Msk
#define GTIM_CR0_PRS_Pos                                    (4U)
#define GTIM_CR0_PRS_Msk                                    (0xFUL << GTIM_CR0_PRS_Pos)
#define GTIM_CR0_PRS                                        GTIM_CR0_PRS_Msk
#define GTIM_CR0_OST_Pos                                    (8U)
#define GTIM_CR0_OST_Msk                                    (0x1UL << GTIM_CR0_OST_Pos)
#define GTIM_CR0_OST                                        GTIM_CR0_OST_Msk
#define GTIM_CR0_TRS_Pos                                    (9U)
#define GTIM_CR0_TRS_Msk                                    (0x3UL << GTIM_CR0_TRS_Pos)
#define GTIM_CR0_TRS                                        GTIM_CR0_TRS_Msk
#define GTIM_CR0_ETP_Pos                                    (11U)
#define GTIM_CR0_ETP_Msk                                    (0x1UL << GTIM_CR0_ETP_Pos)
#define GTIM_CR0_ETP                                        GTIM_CR0_ETP_Msk

