yuer-12342/sx1280-test/mcu/common/hc32l021.h
// GTIM_IER
#define GTIM_IER_UI_Pos                                     (0U)
#define GTIM_IER_UI_Msk                                     (0x1UL << GTIM_IER_UI_Pos)
#define GTIM_IER_UI                                         GTIM_IER_UI_Msk
#define GTIM_IER_TI_Pos                                     (1U)
#define GTIM_IER_TI_Msk                                     (0x1UL << GTIM_IER_TI_Pos)
#define GTIM_IER_TI                                         GTIM_IER_TI_Msk
#define GTIM_IER_CC0_Pos                                    (2U)
#define GTIM_IER_CC0_Msk                                    (0x1UL << GTIM_IER_CC0_Pos)
#define GTIM_IER_CC0                                        GTIM_IER_CC0_Msk
#define GTIM_IER_CC1_Pos                                    (3U)
#define GTIM_IER_CC1_Msk                                    (0x1UL << GTIM_IER_CC1_Pos)
#define GTIM_IER_CC1                                        GTIM_IER_CC1_Msk
#define GTIM_IER_CC2_Pos                                    (4U)
#define GTIM_IER_CC2_Msk                                    (0x1UL << GTIM_IER_CC2_Pos)
#define GTIM_IER_CC2                                        GTIM_IER_CC2_Msk
#define GTIM_IER_CC3_Pos                                    (5U)
#define GTIM_IER_CC3_Msk                                    (0x1UL << GTIM_IER_CC3_Pos)
#define GTIM_IER_CC3                                        GTIM_IER_CC3_Msk
#define GTIM_IER_OVTRAD_Pos                                 (10U)
#define GTIM_IER_OVTRAD_Msk                                 (0x1UL << GTIM_IER_OVTRAD_Pos)
#define GTIM_IER_OVTRAD                                     GTIM_IER_OVTRAD_Msk
#define GTIM_IER_C0TRAD_Pos                                 (11U)
#define GTIM_IER_C0TRAD_Msk                                 (0x1UL << GTIM_IER_C0TRAD_Pos)
#define GTIM_IER_C0TRAD                                     GTIM_IER_C0TRAD_Msk

// GTIM_IFR
#define GTIM_IFR_UI_Pos                                     (0U)
#define GTIM_IFR_UI_Msk                                     (0x1UL << GTIM_IFR_UI_Pos)
#define GTIM_IFR_UI                                         GTIM_IFR_UI_Msk
#define GTIM_IFR_TI_Pos                                     (1U)
#define GTIM_IFR_TI_Msk                                     (0x1UL << GTIM_IFR_TI_Pos)
#define GTIM_IFR_TI                                         GTIM_IFR_TI_Msk
#define GTIM_IFR_CC0_Pos                                    (2U)
#define GTIM_IFR_CC0_Msk                                    (0x1UL << GTIM_IFR_CC0_Pos)
#define GTIM_IFR_CC0                                        GTIM_IFR_CC0_Msk
#define GTIM_IFR_CC1_Pos                                    (3U)
#define GTIM_IFR_CC1_Msk                                    (0x1UL << GTIM_IFR_CC1_Pos)
#define GTIM_IFR_CC1                                        GTIM_IFR_CC1_Msk
#define GTIM_IFR_CC2_Pos                                    (4U)
#define GTIM_IFR_CC2_Msk                                    (0x1UL << GTIM_IFR_CC2_Pos)
#define GTIM_IFR_CC2                                        GTIM_IFR_CC2_Msk
#define GTIM_IFR_CC3_Pos                                    (5U)
#define GTIM_IFR_CC3_Msk                                    (0x1UL << GTIM_IFR_CC3_Pos)
#define GTIM_IFR_CC3                                        GTIM_IFR_CC3_Msk

// GTIM_ICR
#define GTIM_ICR_UI_Pos                                     (0U)
#define GTIM_ICR_UI_Msk                                     (0x1UL << GTIM_ICR_UI_Pos)
#define GTIM_ICR_UI                                         GTIM_ICR_UI_Msk
#define GTIM_ICR_TI_Pos                                     (1U)
#define GTIM_ICR_TI_Msk                                     (0x1UL << GTIM_ICR_TI_Pos)
#define GTIM_ICR_TI                                         GTIM_ICR_TI_Msk
#define GTIM_ICR_CC0_Pos                                    (2U)
#define GTIM_ICR_CC0_Msk                                    (0x1UL << GTIM_ICR_CC0_Pos)
#define GTIM_ICR_CC0                                        GTIM_ICR_CC0_Msk
#define GTIM_ICR_CC1_Pos                                    (3U)
#define GTIM_ICR_CC1_Msk                                    (0x1UL << GTIM_ICR_CC1_Pos)
#define GTIM_ICR_CC1                                        GTIM_ICR_CC1_Msk
#define GTIM_ICR_CC2_Pos                                    (4U)
#define GTIM_ICR_CC2_Msk                                    (0x1UL << GTIM_ICR_CC2_Pos)
#define GTIM_ICR_CC2                                        GTIM_ICR_CC2_Msk
#define GTIM_ICR_CC3_Pos                                    (5U)
#define GTIM_ICR_CC3_Msk                                    (0x1UL << GTIM_ICR_CC3_Pos)
#define GTIM_ICR_CC3                                        GTIM_ICR_CC3_Msk

// GTIM_CCR0
#define GTIM_CCR0_CCR_Pos                                   (0U)
#define GTIM_CCR0_CCR_Msk                                   (0xFFFFUL << GTIM_CCR0_CCR_Pos)
#define GTIM_CCR0_CCR                                       GTIM_CCR0_CCR_Msk

// GTIM_CCR1
#define GTIM_CCR1_CCR_Pos                                   (0U)
#define GTIM_CCR1_CCR_Msk                                   (0xFFFFUL << GTIM_CCR1_CCR_Pos)
#define GTIM_CCR1_CCR                                       GTIM_CCR1_CCR_Msk

// GTIM_CCR2
#define GTIM_CCR2_CCR_Pos                                   (0U)
#define GTIM_CCR2_CCR_Msk                                   (0xFFFFUL << GTIM_CCR2_CCR_Pos)
#define GTIM_CCR2_CCR                                       GTIM_CCR2_CCR_Msk

// GTIM_CCR3
#define GTIM_CCR3_CCR_Pos                                   (0U)
#define GTIM_CCR3_CCR_Msk                                   (0xFFFFUL << GTIM_CCR3_CCR_Pos)
#define GTIM_CCR3_CCR                                       GTIM_CCR3_CCR_Msk



//********************    Bits Define For Peripheral HSI2C    ********************//
// HSI2C_MCR
#define HSI2C_MCR_MEN_Pos                                   (0U)
#define HSI2C_MCR_MEN_Msk                                   (0x1UL << HSI2C_MCR_MEN_Pos)
#define HSI2C_MCR_MEN                                       HSI2C_MCR_MEN_Msk
#define HSI2C_MCR_RST_Pos                                   (1U)
#define HSI2C_MCR_RST_Msk                                   (0x1UL << HSI2C_MCR_RST_Pos)
#define HSI2C_MCR_RST                                       HSI2C_MCR_RST_Msk
#define HSI2C_MCR_DBGEN_Pos                                 (3U)
#define HSI2C_MCR_DBGEN_Msk                                 (0x1UL << HSI2C_MCR_DBGEN_Pos)
#define HSI2C_MCR_DBGEN                                     HSI2C_MCR_DBGEN_Msk

