yuer-12342/sx1280-test/mcu/common/hc32l021.h
// HSI2C_MSR
#define HSI2C_MSR_TDF_Pos                                   (0U)
#define HSI2C_MSR_TDF_Msk                                   (0x1UL << HSI2C_MSR_TDF_Pos)
#define HSI2C_MSR_TDF                                       HSI2C_MSR_TDF_Msk
#define HSI2C_MSR_RDF_Pos                                   (1U)
#define HSI2C_MSR_RDF_Msk                                   (0x1UL << HSI2C_MSR_RDF_Pos)
#define HSI2C_MSR_RDF                                       HSI2C_MSR_RDF_Msk
#define HSI2C_MSR_EPF_Pos                                   (8U)
#define HSI2C_MSR_EPF_Msk                                   (0x1UL << HSI2C_MSR_EPF_Pos)
#define HSI2C_MSR_EPF                                       HSI2C_MSR_EPF_Msk
#define HSI2C_MSR_SDF_Pos                                   (9U)
#define HSI2C_MSR_SDF_Msk                                   (0x1UL << HSI2C_MSR_SDF_Pos)
#define HSI2C_MSR_SDF                                       HSI2C_MSR_SDF_Msk
#define HSI2C_MSR_NDF_Pos                                   (10U)
#define HSI2C_MSR_NDF_Msk                                   (0x1UL << HSI2C_MSR_NDF_Pos)
#define HSI2C_MSR_NDF                                       HSI2C_MSR_NDF_Msk
#define HSI2C_MSR_ALF_Pos                                   (11U)
#define HSI2C_MSR_ALF_Msk                                   (0x1UL << HSI2C_MSR_ALF_Pos)
#define HSI2C_MSR_ALF                                       HSI2C_MSR_ALF_Msk
#define HSI2C_MSR_FEF_Pos                                   (12U)
#define HSI2C_MSR_FEF_Msk                                   (0x1UL << HSI2C_MSR_FEF_Pos)
#define HSI2C_MSR_FEF                                       HSI2C_MSR_FEF_Msk
#define HSI2C_MSR_PLTF_Pos                                  (13U)
#define HSI2C_MSR_PLTF_Msk                                  (0x1UL << HSI2C_MSR_PLTF_Pos)
#define HSI2C_MSR_PLTF                                      HSI2C_MSR_PLTF_Msk
#define HSI2C_MSR_DMF_Pos                                   (14U)
#define HSI2C_MSR_DMF_Msk                                   (0x1UL << HSI2C_MSR_DMF_Pos)
#define HSI2C_MSR_DMF                                       HSI2C_MSR_DMF_Msk
#define HSI2C_MSR_MBF_Pos                                   (24U)
#define HSI2C_MSR_MBF_Msk                                   (0x1UL << HSI2C_MSR_MBF_Pos)
#define HSI2C_MSR_MBF                                       HSI2C_MSR_MBF_Msk
#define HSI2C_MSR_BBF_Pos                                   (25U)
#define HSI2C_MSR_BBF_Msk                                   (0x1UL << HSI2C_MSR_BBF_Pos)
#define HSI2C_MSR_BBF                                       HSI2C_MSR_BBF_Msk

// HSI2C_MIER
#define HSI2C_MIER_TDIE_Pos                                 (0U)
#define HSI2C_MIER_TDIE_Msk                                 (0x1UL << HSI2C_MIER_TDIE_Pos)
#define HSI2C_MIER_TDIE                                     HSI2C_MIER_TDIE_Msk
#define HSI2C_MIER_RDIE_Pos                                 (1U)
#define HSI2C_MIER_RDIE_Msk                                 (0x1UL << HSI2C_MIER_RDIE_Pos)
#define HSI2C_MIER_RDIE                                     HSI2C_MIER_RDIE_Msk
#define HSI2C_MIER_EPIE_Pos                                 (8U)
#define HSI2C_MIER_EPIE_Msk                                 (0x1UL << HSI2C_MIER_EPIE_Pos)
#define HSI2C_MIER_EPIE                                     HSI2C_MIER_EPIE_Msk
#define HSI2C_MIER_SDIE_Pos                                 (9U)
#define HSI2C_MIER_SDIE_Msk                                 (0x1UL << HSI2C_MIER_SDIE_Pos)
#define HSI2C_MIER_SDIE                                     HSI2C_MIER_SDIE_Msk
#define HSI2C_MIER_NDIE_Pos                                 (10U)
#define HSI2C_MIER_NDIE_Msk                                 (0x1UL << HSI2C_MIER_NDIE_Pos)
#define HSI2C_MIER_NDIE                                     HSI2C_MIER_NDIE_Msk
#define HSI2C_MIER_ALIE_Pos                                 (11U)
#define HSI2C_MIER_ALIE_Msk                                 (0x1UL << HSI2C_MIER_ALIE_Pos)
#define HSI2C_MIER_ALIE                                     HSI2C_MIER_ALIE_Msk
#define HSI2C_MIER_FEIE_Pos                                 (12U)
#define HSI2C_MIER_FEIE_Msk                                 (0x1UL << HSI2C_MIER_FEIE_Pos)
#define HSI2C_MIER_FEIE                                     HSI2C_MIER_FEIE_Msk
#define HSI2C_MIER_PLTIE_Pos                                (13U)
#define HSI2C_MIER_PLTIE_Msk                                (0x1UL << HSI2C_MIER_PLTIE_Pos)
#define HSI2C_MIER_PLTIE                                    HSI2C_MIER_PLTIE_Msk
#define HSI2C_MIER_DMIE_Pos                                 (14U)
#define HSI2C_MIER_DMIE_Msk                                 (0x1UL << HSI2C_MIER_DMIE_Pos)
#define HSI2C_MIER_DMIE                                     HSI2C_MIER_DMIE_Msk

// HSI2C_MSCR
#define HSI2C_MSCR_EPC_Pos                                  (8U)
#define HSI2C_MSCR_EPC_Msk                                  (0x1UL << HSI2C_MSCR_EPC_Pos)
#define HSI2C_MSCR_EPC                                      HSI2C_MSCR_EPC_Msk
#define HSI2C_MSCR_SDC_Pos                                  (9U)
#define HSI2C_MSCR_SDC_Msk                                  (0x1UL << HSI2C_MSCR_SDC_Pos)
#define HSI2C_MSCR_SDC                                      HSI2C_MSCR_SDC_Msk
#define HSI2C_MSCR_NDC_Pos                                  (10U)
#define HSI2C_MSCR_NDC_Msk                                  (0x1UL << HSI2C_MSCR_NDC_Pos)
#define HSI2C_MSCR_NDC                                      HSI2C_MSCR_NDC_Msk
#define HSI2C_MSCR_ALC_Pos                                  (11U)
#define HSI2C_MSCR_ALC_Msk                                  (0x1UL << HSI2C_MSCR_ALC_Pos)
#define HSI2C_MSCR_ALC                                      HSI2C_MSCR_ALC_Msk
#define HSI2C_MSCR_FEC_Pos                                  (12U)
#define HSI2C_MSCR_FEC_Msk                                  (0x1UL << HSI2C_MSCR_FEC_Pos)
#define HSI2C_MSCR_FEC                                      HSI2C_MSCR_FEC_Msk
#define HSI2C_MSCR_PLTC_Pos                                 (13U)
#define HSI2C_MSCR_PLTC_Msk                                 (0x1UL << HSI2C_MSCR_PLTC_Pos)
#define HSI2C_MSCR_PLTC                                     HSI2C_MSCR_PLTC_Msk
#define HSI2C_MSCR_DMC_Pos                                  (14U)
#define HSI2C_MSCR_DMC_Msk                                  (0x1UL << HSI2C_MSCR_DMC_Pos)
#define HSI2C_MSCR_DMC                                      HSI2C_MSCR_DMC_Msk

// HSI2C_MCFGR1
#define HSI2C_MCFGR1_PRESCALE_Pos                           (0U)
#define HSI2C_MCFGR1_PRESCALE_Msk                           (0x7UL << HSI2C_MCFGR1_PRESCALE_Pos)
#define HSI2C_MCFGR1_PRESCALE                               HSI2C_MCFGR1_PRESCALE_Msk
#define HSI2C_MCFGR1_AUTOSTOP_Pos                           (8U)
#define HSI2C_MCFGR1_AUTOSTOP_Msk                           (0x1UL << HSI2C_MCFGR1_AUTOSTOP_Pos)
#define HSI2C_MCFGR1_AUTOSTOP                               HSI2C_MCFGR1_AUTOSTOP_Msk
#define HSI2C_MCFGR1_IGNACK_Pos                             (9U)
#define HSI2C_MCFGR1_IGNACK_Msk                             (0x1UL << HSI2C_MCFGR1_IGNACK_Pos)
#define HSI2C_MCFGR1_IGNACK                                 HSI2C_MCFGR1_IGNACK_Msk
#define HSI2C_MCFGR1_TIMECFG_Pos                            (10U)
#define HSI2C_MCFGR1_TIMECFG_Msk                            (0x1UL << HSI2C_MCFGR1_TIMECFG_Pos)
#define HSI2C_MCFGR1_TIMECFG                                HSI2C_MCFGR1_TIMECFG_Msk
#define HSI2C_MCFGR1_RDMO_Pos                               (12U)
#define HSI2C_MCFGR1_RDMO_Msk                               (0x1UL << HSI2C_MCFGR1_RDMO_Pos)
#define HSI2C_MCFGR1_RDMO                                   HSI2C_MCFGR1_RDMO_Msk
#define HSI2C_MCFGR1_MATCFG_Pos                             (13U)
#define HSI2C_MCFGR1_MATCFG_Msk                             (0x7UL << HSI2C_MCFGR1_MATCFG_Pos)
#define HSI2C_MCFGR1_MATCFG                                 HSI2C_MCFGR1_MATCFG_Msk

// HSI2C_MCFGR2
#define HSI2C_MCFGR2_BUSIDLE_Pos                            (0U)
#define HSI2C_MCFGR2_BUSIDLE_Msk                            (0xFFFUL << HSI2C_MCFGR2_BUSIDLE_Pos)
#define HSI2C_MCFGR2_BUSIDLE                                HSI2C_MCFGR2_BUSIDLE_Msk
#define HSI2C_MCFGR2_FILTSCL_Pos                            (16U)
#define HSI2C_MCFGR2_FILTSCL_Msk                            (0xFUL << HSI2C_MCFGR2_FILTSCL_Pos)
#define HSI2C_MCFGR2_FILTSCL                                HSI2C_MCFGR2_FILTSCL_Msk
#define HSI2C_MCFGR2_FILTBPSCL_Pos                          (23U)
#define HSI2C_MCFGR2_FILTBPSCL_Msk                          (0x1UL << HSI2C_MCFGR2_FILTBPSCL_Pos)
#define HSI2C_MCFGR2_FILTBPSCL                              HSI2C_MCFGR2_FILTBPSCL_Msk
#define HSI2C_MCFGR2_FILTSDA_Pos                            (24U)
#define HSI2C_MCFGR2_FILTSDA_Msk                            (0xFUL << HSI2C_MCFGR2_FILTSDA_Pos)
#define HSI2C_MCFGR2_FILTSDA                                HSI2C_MCFGR2_FILTSDA_Msk
#define HSI2C_MCFGR2_FILTBPSDA_Pos                          (31U)
#define HSI2C_MCFGR2_FILTBPSDA_Msk                          (0x1UL << HSI2C_MCFGR2_FILTBPSDA_Pos)
#define HSI2C_MCFGR2_FILTBPSDA                              HSI2C_MCFGR2_FILTBPSDA_Msk

// HSI2C_MCFGR3
#define HSI2C_MCFGR3_PINLOW_Pos                             (8U)
#define HSI2C_MCFGR3_PINLOW_Msk                             (0xFFFUL << HSI2C_MCFGR3_PINLOW_Pos)
#define HSI2C_MCFGR3_PINLOW                                 HSI2C_MCFGR3_PINLOW_Msk

// HSI2C_MCCR0
#define HSI2C_MCCR0_CLKLO_Pos                               (0U)
#define HSI2C_MCCR0_CLKLO_Msk                               (0x3FUL << HSI2C_MCCR0_CLKLO_Pos)
#define HSI2C_MCCR0_CLKLO                                   HSI2C_MCCR0_CLKLO_Msk
#define HSI2C_MCCR0_CLKHI_Pos                               (8U)
#define HSI2C_MCCR0_CLKHI_Msk                               (0x3FUL << HSI2C_MCCR0_CLKHI_Pos)
#define HSI2C_MCCR0_CLKHI                                   HSI2C_MCCR0_CLKHI_Msk
#define HSI2C_MCCR0_SETHOLD_Pos                             (16U)
#define HSI2C_MCCR0_SETHOLD_Msk                             (0x3FUL << HSI2C_MCCR0_SETHOLD_Pos)
#define HSI2C_MCCR0_SETHOLD                                 HSI2C_MCCR0_SETHOLD_Msk
#define HSI2C_MCCR0_DATAVD_Pos                              (24U)
#define HSI2C_MCCR0_DATAVD_Msk                              (0x3FUL << HSI2C_MCCR0_DATAVD_Pos)
#define HSI2C_MCCR0_DATAVD                                  HSI2C_MCCR0_DATAVD_Msk

