yuer-12342/sx1280-test/mcu/common/hc32l021.h
// HSI2C_MCCR1
#define HSI2C_MCCR1_CLKLO_Pos                               (0U)
#define HSI2C_MCCR1_CLKLO_Msk                               (0x3FUL << HSI2C_MCCR1_CLKLO_Pos)
#define HSI2C_MCCR1_CLKLO                                   HSI2C_MCCR1_CLKLO_Msk
#define HSI2C_MCCR1_CLKHI_Pos                               (8U)
#define HSI2C_MCCR1_CLKHI_Msk                               (0x3FUL << HSI2C_MCCR1_CLKHI_Pos)
#define HSI2C_MCCR1_CLKHI                                   HSI2C_MCCR1_CLKHI_Msk
#define HSI2C_MCCR1_SETHOLD_Pos                             (16U)
#define HSI2C_MCCR1_SETHOLD_Msk                             (0x3FUL << HSI2C_MCCR1_SETHOLD_Pos)
#define HSI2C_MCCR1_SETHOLD                                 HSI2C_MCCR1_SETHOLD_Msk
#define HSI2C_MCCR1_DATAVD_Pos                              (24U)
#define HSI2C_MCCR1_DATAVD_Msk                              (0x3FUL << HSI2C_MCCR1_DATAVD_Pos)
#define HSI2C_MCCR1_DATAVD                                  HSI2C_MCCR1_DATAVD_Msk

// HSI2C_MTDR
#define HSI2C_MTDR_DATA_Pos                                 (0U)
#define HSI2C_MTDR_DATA_Msk                                 (0xFFUL << HSI2C_MTDR_DATA_Pos)
#define HSI2C_MTDR_DATA                                     HSI2C_MTDR_DATA_Msk
#define HSI2C_MTDR_CMD_Pos                                  (8U)
#define HSI2C_MTDR_CMD_Msk                                  (0x7UL << HSI2C_MTDR_CMD_Pos)
#define HSI2C_MTDR_CMD                                      HSI2C_MTDR_CMD_Msk

// HSI2C_MRDR
#define HSI2C_MRDR_DATA_Pos                                 (0U)
#define HSI2C_MRDR_DATA_Msk                                 (0xFFUL << HSI2C_MRDR_DATA_Pos)
#define HSI2C_MRDR_DATA                                     HSI2C_MRDR_DATA_Msk
#define HSI2C_MRDR_RXEMPTY_Pos                              (14U)
#define HSI2C_MRDR_RXEMPTY_Msk                              (0x1UL << HSI2C_MRDR_RXEMPTY_Pos)
#define HSI2C_MRDR_RXEMPTY                                  HSI2C_MRDR_RXEMPTY_Msk

// HSI2C_MDMR
#define HSI2C_MDMR_MATCH0_Pos                               (0U)
#define HSI2C_MDMR_MATCH0_Msk                               (0xFFUL << HSI2C_MDMR_MATCH0_Pos)
#define HSI2C_MDMR_MATCH0                                   HSI2C_MDMR_MATCH0_Msk
#define HSI2C_MDMR_MATCH1_Pos                               (16U)
#define HSI2C_MDMR_MATCH1_Msk                               (0xFFUL << HSI2C_MDMR_MATCH1_Pos)
#define HSI2C_MDMR_MATCH1                                   HSI2C_MDMR_MATCH1_Msk

// HSI2C_SCR0
#define HSI2C_SCR0_SEN_Pos                                  (0U)
#define HSI2C_SCR0_SEN_Msk                                  (0x1UL << HSI2C_SCR0_SEN_Pos)
#define HSI2C_SCR0_SEN                                      HSI2C_SCR0_SEN_Msk
#define HSI2C_SCR0_RST_Pos                                  (1U)
#define HSI2C_SCR0_RST_Msk                                  (0x1UL << HSI2C_SCR0_RST_Pos)
#define HSI2C_SCR0_RST                                      HSI2C_SCR0_RST_Msk

// HSI2C_SSR
#define HSI2C_SSR_TDF_Pos                                   (0U)
#define HSI2C_SSR_TDF_Msk                                   (0x1UL << HSI2C_SSR_TDF_Pos)
#define HSI2C_SSR_TDF                                       HSI2C_SSR_TDF_Msk
#define HSI2C_SSR_RDF_Pos                                   (1U)
#define HSI2C_SSR_RDF_Msk                                   (0x1UL << HSI2C_SSR_RDF_Pos)
#define HSI2C_SSR_RDF                                       HSI2C_SSR_RDF_Msk
#define HSI2C_SSR_AVF_Pos                                   (2U)
#define HSI2C_SSR_AVF_Msk                                   (0x1UL << HSI2C_SSR_AVF_Pos)
#define HSI2C_SSR_AVF                                       HSI2C_SSR_AVF_Msk
#define HSI2C_SSR_TAF_Pos                                   (3U)
#define HSI2C_SSR_TAF_Msk                                   (0x1UL << HSI2C_SSR_TAF_Pos)
#define HSI2C_SSR_TAF                                       HSI2C_SSR_TAF_Msk
#define HSI2C_SSR_RSF_Pos                                   (8U)
#define HSI2C_SSR_RSF_Msk                                   (0x1UL << HSI2C_SSR_RSF_Pos)
#define HSI2C_SSR_RSF                                       HSI2C_SSR_RSF_Msk
#define HSI2C_SSR_SDF_Pos                                   (9U)
#define HSI2C_SSR_SDF_Msk                                   (0x1UL << HSI2C_SSR_SDF_Pos)
#define HSI2C_SSR_SDF                                       HSI2C_SSR_SDF_Msk
#define HSI2C_SSR_BEF_Pos                                   (10U)
#define HSI2C_SSR_BEF_Msk                                   (0x1UL << HSI2C_SSR_BEF_Pos)
#define HSI2C_SSR_BEF                                       HSI2C_SSR_BEF_Msk
#define HSI2C_SSR_FEF_Pos                                   (11U)
#define HSI2C_SSR_FEF_Msk                                   (0x1UL << HSI2C_SSR_FEF_Pos)
#define HSI2C_SSR_FEF                                       HSI2C_SSR_FEF_Msk
#define HSI2C_SSR_AM0F_Pos                                  (12U)
#define HSI2C_SSR_AM0F_Msk                                  (0x1UL << HSI2C_SSR_AM0F_Pos)
#define HSI2C_SSR_AM0F                                      HSI2C_SSR_AM0F_Msk
#define HSI2C_SSR_AM1F_Pos                                  (13U)
#define HSI2C_SSR_AM1F_Msk                                  (0x1UL << HSI2C_SSR_AM1F_Pos)
#define HSI2C_SSR_AM1F                                      HSI2C_SSR_AM1F_Msk
#define HSI2C_SSR_GCF_Pos                                   (14U)
#define HSI2C_SSR_GCF_Msk                                   (0x1UL << HSI2C_SSR_GCF_Pos)
#define HSI2C_SSR_GCF                                       HSI2C_SSR_GCF_Msk
#define HSI2C_SSR_SARF_Pos                                  (15U)
#define HSI2C_SSR_SARF_Msk                                  (0x1UL << HSI2C_SSR_SARF_Pos)
#define HSI2C_SSR_SARF                                      HSI2C_SSR_SARF_Msk
#define HSI2C_SSR_SBF_Pos                                   (24U)
#define HSI2C_SSR_SBF_Msk                                   (0x1UL << HSI2C_SSR_SBF_Pos)
#define HSI2C_SSR_SBF                                       HSI2C_SSR_SBF_Msk
#define HSI2C_SSR_BBF_Pos                                   (25U)
#define HSI2C_SSR_BBF_Msk                                   (0x1UL << HSI2C_SSR_BBF_Pos)
#define HSI2C_SSR_BBF                                       HSI2C_SSR_BBF_Msk

// HSI2C_SIER
#define HSI2C_SIER_TDIE_Pos                                 (0U)
#define HSI2C_SIER_TDIE_Msk                                 (0x1UL << HSI2C_SIER_TDIE_Pos)
#define HSI2C_SIER_TDIE                                     HSI2C_SIER_TDIE_Msk
#define HSI2C_SIER_RDIE_Pos                                 (1U)
#define HSI2C_SIER_RDIE_Msk                                 (0x1UL << HSI2C_SIER_RDIE_Pos)
#define HSI2C_SIER_RDIE                                     HSI2C_SIER_RDIE_Msk
#define HSI2C_SIER_AVIE_Pos                                 (2U)
#define HSI2C_SIER_AVIE_Msk                                 (0x1UL << HSI2C_SIER_AVIE_Pos)
#define HSI2C_SIER_AVIE                                     HSI2C_SIER_AVIE_Msk
#define HSI2C_SIER_TAIE_Pos                                 (3U)
#define HSI2C_SIER_TAIE_Msk                                 (0x1UL << HSI2C_SIER_TAIE_Pos)
#define HSI2C_SIER_TAIE                                     HSI2C_SIER_TAIE_Msk
#define HSI2C_SIER_RSIE_Pos                                 (8U)
#define HSI2C_SIER_RSIE_Msk                                 (0x1UL << HSI2C_SIER_RSIE_Pos)
#define HSI2C_SIER_RSIE                                     HSI2C_SIER_RSIE_Msk
#define HSI2C_SIER_SDIE_Pos                                 (9U)
#define HSI2C_SIER_SDIE_Msk                                 (0x1UL << HSI2C_SIER_SDIE_Pos)
#define HSI2C_SIER_SDIE                                     HSI2C_SIER_SDIE_Msk
#define HSI2C_SIER_BEIE_Pos                                 (10U)
#define HSI2C_SIER_BEIE_Msk                                 (0x1UL << HSI2C_SIER_BEIE_Pos)
#define HSI2C_SIER_BEIE                                     HSI2C_SIER_BEIE_Msk
#define HSI2C_SIER_FEIE_Pos                                 (11U)
#define HSI2C_SIER_FEIE_Msk                                 (0x1UL << HSI2C_SIER_FEIE_Pos)
#define HSI2C_SIER_FEIE                                     HSI2C_SIER_FEIE_Msk
#define HSI2C_SIER_AM0IE_Pos                                (12U)
#define HSI2C_SIER_AM0IE_Msk                                (0x1UL << HSI2C_SIER_AM0IE_Pos)
#define HSI2C_SIER_AM0IE                                    HSI2C_SIER_AM0IE_Msk
#define HSI2C_SIER_AM1IE_Pos                                (13U)
#define HSI2C_SIER_AM1IE_Msk                                (0x1UL << HSI2C_SIER_AM1IE_Pos)
#define HSI2C_SIER_AM1IE                                    HSI2C_SIER_AM1IE_Msk
#define HSI2C_SIER_GCIE_Pos                                 (14U)
#define HSI2C_SIER_GCIE_Msk                                 (0x1UL << HSI2C_SIER_GCIE_Pos)
#define HSI2C_SIER_GCIE                                     HSI2C_SIER_GCIE_Msk
#define HSI2C_SIER_SARIE_Pos                                (15U)
#define HSI2C_SIER_SARIE_Msk                                (0x1UL << HSI2C_SIER_SARIE_Pos)
#define HSI2C_SIER_SARIE                                    HSI2C_SIER_SARIE_Msk

// HSI2C_SSCR
#define HSI2C_SSCR_RSC_Pos                                  (8U)
#define HSI2C_SSCR_RSC_Msk                                  (0x1UL << HSI2C_SSCR_RSC_Pos)
#define HSI2C_SSCR_RSC                                      HSI2C_SSCR_RSC_Msk
#define HSI2C_SSCR_SDC_Pos                                  (9U)
#define HSI2C_SSCR_SDC_Msk                                  (0x1UL << HSI2C_SSCR_SDC_Pos)
#define HSI2C_SSCR_SDC                                      HSI2C_SSCR_SDC_Msk
#define HSI2C_SSCR_BEC_Pos                                  (10U)
#define HSI2C_SSCR_BEC_Msk                                  (0x1UL << HSI2C_SSCR_BEC_Pos)
#define HSI2C_SSCR_BEC                                      HSI2C_SSCR_BEC_Msk
#define HSI2C_SSCR_FEC_Pos                                  (11U)
#define HSI2C_SSCR_FEC_Msk                                  (0x1UL << HSI2C_SSCR_FEC_Pos)
#define HSI2C_SSCR_FEC                                      HSI2C_SSCR_FEC_Msk

// HSI2C_SCR1
#define HSI2C_SCR1_ADRSTALL_Pos                             (0U)
#define HSI2C_SCR1_ADRSTALL_Msk                             (0x1UL << HSI2C_SCR1_ADRSTALL_Pos)
#define HSI2C_SCR1_ADRSTALL                                 HSI2C_SCR1_ADRSTALL_Msk
#define HSI2C_SCR1_RXSTALL_Pos                              (1U)
#define HSI2C_SCR1_RXSTALL_Msk                              (0x1UL << HSI2C_SCR1_RXSTALL_Pos)
#define HSI2C_SCR1_RXSTALL                                  HSI2C_SCR1_RXSTALL_Msk
#define HSI2C_SCR1_TXDSTALL_Pos                             (2U)
#define HSI2C_SCR1_TXDSTALL_Msk                             (0x1UL << HSI2C_SCR1_TXDSTALL_Pos)
#define HSI2C_SCR1_TXDSTALL                                 HSI2C_SCR1_TXDSTALL_Msk
#define HSI2C_SCR1_ACKSTALL_Pos                             (3U)
#define HSI2C_SCR1_ACKSTALL_Msk                             (0x1UL << HSI2C_SCR1_ACKSTALL_Pos)
#define HSI2C_SCR1_ACKSTALL                                 HSI2C_SCR1_ACKSTALL_Msk
#define HSI2C_SCR1_GCEN_Pos                                 (8U)
#define HSI2C_SCR1_GCEN_Msk                                 (0x1UL << HSI2C_SCR1_GCEN_Pos)
#define HSI2C_SCR1_GCEN                                     HSI2C_SCR1_GCEN_Msk
#define HSI2C_SCR1_SAEN_Pos                                 (9U)
#define HSI2C_SCR1_SAEN_Msk                                 (0x1UL << HSI2C_SCR1_SAEN_Pos)
#define HSI2C_SCR1_SAEN                                     HSI2C_SCR1_SAEN_Msk
#define HSI2C_SCR1_TXCFG_Pos                                (10U)
#define HSI2C_SCR1_TXCFG_Msk                                (0x1UL << HSI2C_SCR1_TXCFG_Pos)
#define HSI2C_SCR1_TXCFG                                    HSI2C_SCR1_TXCFG_Msk
#define HSI2C_SCR1_RXCFG_Pos                                (11U)
#define HSI2C_SCR1_RXCFG_Msk                                (0x1UL << HSI2C_SCR1_RXCFG_Pos)
#define HSI2C_SCR1_RXCFG                                    HSI2C_SCR1_RXCFG_Msk
#define HSI2C_SCR1_IGNACK_Pos                               (12U)
#define HSI2C_SCR1_IGNACK_Msk                               (0x1UL << HSI2C_SCR1_IGNACK_Pos)
#define HSI2C_SCR1_IGNACK                                   HSI2C_SCR1_IGNACK_Msk
#define HSI2C_SCR1_HSMEN_Pos                                (13U)
#define HSI2C_SCR1_HSMEN_Msk                                (0x1UL << HSI2C_SCR1_HSMEN_Pos)
#define HSI2C_SCR1_HSMEN                                    HSI2C_SCR1_HSMEN_Msk
#define HSI2C_SCR1_ADDRMODE_Pos                             (16U)
#define HSI2C_SCR1_ADDRMODE_Msk                             (0x7UL << HSI2C_SCR1_ADDRMODE_Pos)
#define HSI2C_SCR1_ADDRMODE                                 HSI2C_SCR1_ADDRMODE_Msk

// HSI2C_SCR2
#define HSI2C_SCR2_CLKHOLD_Pos                              (0U)
#define HSI2C_SCR2_CLKHOLD_Msk                              (0xFUL << HSI2C_SCR2_CLKHOLD_Pos)
#define HSI2C_SCR2_CLKHOLD                                  HSI2C_SCR2_CLKHOLD_Msk
#define HSI2C_SCR2_DATAVD_Pos                               (8U)
#define HSI2C_SCR2_DATAVD_Msk                               (0x3FUL << HSI2C_SCR2_DATAVD_Pos)
#define HSI2C_SCR2_DATAVD                                   HSI2C_SCR2_DATAVD_Msk
#define HSI2C_SCR2_FILTEN_Pos                               (14U)
#define HSI2C_SCR2_FILTEN_Msk                               (0x1UL << HSI2C_SCR2_FILTEN_Pos)
#define HSI2C_SCR2_FILTEN                                   HSI2C_SCR2_FILTEN_Msk
#define HSI2C_SCR2_FILTSCL_Pos                              (16U)
#define HSI2C_SCR2_FILTSCL_Msk                              (0xFUL << HSI2C_SCR2_FILTSCL_Pos)
#define HSI2C_SCR2_FILTSCL                                  HSI2C_SCR2_FILTSCL_Msk
#define HSI2C_SCR2_FILTSDA_Pos                              (20U)
#define HSI2C_SCR2_FILTSDA_Msk                              (0xFUL << HSI2C_SCR2_FILTSDA_Pos)
#define HSI2C_SCR2_FILTSDA                                  HSI2C_SCR2_FILTSDA_Msk

// HSI2C_STAR
#define HSI2C_STAR_TXNACK_Pos                               (0U)
#define HSI2C_STAR_TXNACK_Msk                               (0x1UL << HSI2C_STAR_TXNACK_Pos)
#define HSI2C_STAR_TXNACK                                   HSI2C_STAR_TXNACK_Msk

// HSI2C_STDR
#define HSI2C_STDR_DATA_Pos                                 (0U)
#define HSI2C_STDR_DATA_Msk                                 (0xFFUL << HSI2C_STDR_DATA_Pos)
#define HSI2C_STDR_DATA                                     HSI2C_STDR_DATA_Msk

// HSI2C_SRDR
#define HSI2C_SRDR_DATA_Pos                                 (0U)
#define HSI2C_SRDR_DATA_Msk                                 (0xFFUL << HSI2C_SRDR_DATA_Pos)
#define HSI2C_SRDR_DATA                                     HSI2C_SRDR_DATA_Msk
#define HSI2C_SRDR_REMP_Pos                                 (14U)
#define HSI2C_SRDR_REMP_Msk                                 (0x1UL << HSI2C_SRDR_REMP_Pos)
#define HSI2C_SRDR_REMP                                     HSI2C_SRDR_REMP_Msk
#define HSI2C_SRDR_SOF_Pos                                  (15U)
#define HSI2C_SRDR_SOF_Msk                                  (0x1UL << HSI2C_SRDR_SOF_Pos)
#define HSI2C_SRDR_SOF                                      HSI2C_SRDR_SOF_Msk

