yuer-12342/sx1280-test/mcu/common/hc32l021.h
// HSI2C_SADDR
#define HSI2C_SADDR_ADDR0_Pos                               (1U)
#define HSI2C_SADDR_ADDR0_Msk                               (0x3FFUL << HSI2C_SADDR_ADDR0_Pos)
#define HSI2C_SADDR_ADDR0                                   HSI2C_SADDR_ADDR0_Msk
#define HSI2C_SADDR_ADDR1_Pos                               (17U)
#define HSI2C_SADDR_ADDR1_Msk                               (0x3FFUL << HSI2C_SADDR_ADDR1_Pos)
#define HSI2C_SADDR_ADDR1                                   HSI2C_SADDR_ADDR1_Msk

// HSI2C_SASR
#define HSI2C_SASR_RADDR_Pos                                (0U)
#define HSI2C_SASR_RADDR_Msk                                (0x7FFUL << HSI2C_SASR_RADDR_Pos)
#define HSI2C_SASR_RADDR                                    HSI2C_SASR_RADDR_Msk
#define HSI2C_SASR_ANV_Pos                                  (14U)
#define HSI2C_SASR_ANV_Msk                                  (0x1UL << HSI2C_SASR_ANV_Pos)
#define HSI2C_SASR_ANV                                      HSI2C_SASR_ANV_Msk



//********************    Bits Define For Peripheral IWDT    ********************//
// IWDT_KR
#define IWDT_KR_KR_Pos                                      (0U)
#define IWDT_KR_KR_Msk                                      (0xFFFFUL << IWDT_KR_KR_Pos)
#define IWDT_KR_KR                                          IWDT_KR_KR_Msk

// IWDT_CR
#define IWDT_CR_PRS_Pos                                     (0U)
#define IWDT_CR_PRS_Msk                                     (0x7UL << IWDT_CR_PRS_Pos)
#define IWDT_CR_PRS                                         IWDT_CR_PRS_Msk
#define IWDT_CR_IE_Pos                                      (4U)
#define IWDT_CR_IE_Msk                                      (0x1UL << IWDT_CR_IE_Pos)
#define IWDT_CR_IE                                          IWDT_CR_IE_Msk
#define IWDT_CR_ACTION_Pos                                  (5U)
#define IWDT_CR_ACTION_Msk                                  (0x1UL << IWDT_CR_ACTION_Pos)
#define IWDT_CR_ACTION                                      IWDT_CR_ACTION_Msk
#define IWDT_CR_PAUSE_Pos                                   (6U)
#define IWDT_CR_PAUSE_Msk                                   (0x1UL << IWDT_CR_PAUSE_Pos)
#define IWDT_CR_PAUSE                                       IWDT_CR_PAUSE_Msk

// IWDT_ARR
#define IWDT_ARR_ARR_Pos                                    (0U)
#define IWDT_ARR_ARR_Msk                                    (0xFFFUL << IWDT_ARR_ARR_Pos)
#define IWDT_ARR_ARR                                        IWDT_ARR_ARR_Msk

// IWDT_SR
#define IWDT_SR_CRF_Pos                                     (0U)
#define IWDT_SR_CRF_Msk                                     (0x1UL << IWDT_SR_CRF_Pos)
#define IWDT_SR_CRF                                         IWDT_SR_CRF_Msk
#define IWDT_SR_ARRF_Pos                                    (1U)
#define IWDT_SR_ARRF_Msk                                    (0x1UL << IWDT_SR_ARRF_Pos)
#define IWDT_SR_ARRF                                        IWDT_SR_ARRF_Msk
#define IWDT_SR_WINRF_Pos                                   (2U)
#define IWDT_SR_WINRF_Msk                                   (0x1UL << IWDT_SR_WINRF_Pos)
#define IWDT_SR_WINRF                                       IWDT_SR_WINRF_Msk
#define IWDT_SR_OV_Pos                                      (3U)
#define IWDT_SR_OV_Msk                                      (0x1UL << IWDT_SR_OV_Pos)
#define IWDT_SR_OV                                          IWDT_SR_OV_Msk
#define IWDT_SR_RUN_Pos                                     (4U)
#define IWDT_SR_RUN_Msk                                     (0x1UL << IWDT_SR_RUN_Pos)
#define IWDT_SR_RUN                                         IWDT_SR_RUN_Msk

// IWDT_WINR
#define IWDT_WINR_WINR_Pos                                  (0U)
#define IWDT_WINR_WINR_Msk                                  (0xFFFUL << IWDT_WINR_WINR_Pos)
#define IWDT_WINR_WINR                                      IWDT_WINR_WINR_Msk



//********************    Bits Define For Peripheral LPUART    ********************//
// LPUART_SBUF
#define LPUART_SBUF_DATA_Pos                                (0U)
#define LPUART_SBUF_DATA_Msk                                (0xFFUL << LPUART_SBUF_DATA_Pos)
#define LPUART_SBUF_DATA                                    LPUART_SBUF_DATA_Msk
#define LPUART_SBUF_DATA8_Pos                               (8U)
#define LPUART_SBUF_DATA8_Msk                               (0x1UL << LPUART_SBUF_DATA8_Pos)
#define LPUART_SBUF_DATA8                                   LPUART_SBUF_DATA8_Msk

// LPUART_SCON
#define LPUART_SCON_RCIE_Pos                                (0U)
#define LPUART_SCON_RCIE_Msk                                (0x1UL << LPUART_SCON_RCIE_Pos)
#define LPUART_SCON_RCIE                                    LPUART_SCON_RCIE_Msk
#define LPUART_SCON_TCIE_Pos                                (1U)
#define LPUART_SCON_TCIE_Msk                                (0x1UL << LPUART_SCON_TCIE_Pos)
#define LPUART_SCON_TCIE                                    LPUART_SCON_TCIE_Msk
#define LPUART_SCON_B8CONT_Pos                              (2U)
#define LPUART_SCON_B8CONT_Msk                              (0x3UL << LPUART_SCON_B8CONT_Pos)
#define LPUART_SCON_B8CONT                                  LPUART_SCON_B8CONT_Msk
#define LPUART_SCON_REN_Pos                                 (4U)
#define LPUART_SCON_REN_Msk                                 (0x1UL << LPUART_SCON_REN_Pos)
#define LPUART_SCON_REN                                     LPUART_SCON_REN_Msk
#define LPUART_SCON_ADRDET_Pos                              (5U)
#define LPUART_SCON_ADRDET_Msk                              (0x1UL << LPUART_SCON_ADRDET_Pos)
#define LPUART_SCON_ADRDET                                  LPUART_SCON_ADRDET_Msk
#define LPUART_SCON_SM_Pos                                  (6U)
#define LPUART_SCON_SM_Msk                                  (0x3UL << LPUART_SCON_SM_Pos)
#define LPUART_SCON_SM                                      LPUART_SCON_SM_Msk
#define LPUART_SCON_TXEIE_Pos                               (8U)
#define LPUART_SCON_TXEIE_Msk                               (0x1UL << LPUART_SCON_TXEIE_Pos)
#define LPUART_SCON_TXEIE                                   LPUART_SCON_TXEIE_Msk
#define LPUART_SCON_OVER_Pos                                (9U)
#define LPUART_SCON_OVER_Msk                                (0x3UL << LPUART_SCON_OVER_Pos)
#define LPUART_SCON_OVER                                    LPUART_SCON_OVER_Msk
#define LPUART_SCON_SCLKSEL_Pos                             (11U)
#define LPUART_SCON_SCLKSEL_Msk                             (0x3UL << LPUART_SCON_SCLKSEL_Pos)
#define LPUART_SCON_SCLKSEL                                 LPUART_SCON_SCLKSEL_Msk
#define LPUART_SCON_PEIE_Pos                                (13U)
#define LPUART_SCON_PEIE_Msk                                (0x1UL << LPUART_SCON_PEIE_Pos)
#define LPUART_SCON_PEIE                                    LPUART_SCON_PEIE_Msk
#define LPUART_SCON_STOPBIT_Pos                             (14U)
#define LPUART_SCON_STOPBIT_Msk                             (0x3UL << LPUART_SCON_STOPBIT_Pos)
#define LPUART_SCON_STOPBIT                                 LPUART_SCON_STOPBIT_Msk
#define LPUART_SCON_RTSEN_Pos                               (18U)
#define LPUART_SCON_RTSEN_Msk                               (0x1UL << LPUART_SCON_RTSEN_Pos)
#define LPUART_SCON_RTSEN                                   LPUART_SCON_RTSEN_Msk
#define LPUART_SCON_CTSEN_Pos                               (19U)
#define LPUART_SCON_CTSEN_Msk                               (0x1UL << LPUART_SCON_CTSEN_Pos)
#define LPUART_SCON_CTSEN                                   LPUART_SCON_CTSEN_Msk
#define LPUART_SCON_CTSIE_Pos                               (20U)
#define LPUART_SCON_CTSIE_Msk                               (0x1UL << LPUART_SCON_CTSIE_Pos)
#define LPUART_SCON_CTSIE                                   LPUART_SCON_CTSIE_Msk
#define LPUART_SCON_FEIE_Pos                                (21U)
#define LPUART_SCON_FEIE_Msk                                (0x1UL << LPUART_SCON_FEIE_Pos)
#define LPUART_SCON_FEIE                                    LPUART_SCON_FEIE_Msk
#define LPUART_SCON_HDSEL_Pos                               (22U)
#define LPUART_SCON_HDSEL_Msk                               (0x1UL << LPUART_SCON_HDSEL_Pos)
#define LPUART_SCON_HDSEL                                   LPUART_SCON_HDSEL_Msk

// LPUART_SADDR
#define LPUART_SADDR_ADDR_Pos                               (0U)
#define LPUART_SADDR_ADDR_Msk                               (0xFFUL << LPUART_SADDR_ADDR_Pos)
#define LPUART_SADDR_ADDR                                   LPUART_SADDR_ADDR_Msk

// LPUART_SADEN
#define LPUART_SADEN_MASK_Pos                               (0U)
#define LPUART_SADEN_MASK_Msk                               (0xFFUL << LPUART_SADEN_MASK_Pos)
#define LPUART_SADEN_MASK                                   LPUART_SADEN_MASK_Msk

