yuer-12342/sx1280-test/mcu/common/hc32l021.h
// LPUART_ISR
#define LPUART_ISR_RC_Pos                                   (0U)
#define LPUART_ISR_RC_Msk                                   (0x1UL << LPUART_ISR_RC_Pos)
#define LPUART_ISR_RC                                       LPUART_ISR_RC_Msk
#define LPUART_ISR_TC_Pos                                   (1U)
#define LPUART_ISR_TC_Msk                                   (0x1UL << LPUART_ISR_TC_Pos)
#define LPUART_ISR_TC                                       LPUART_ISR_TC_Msk
#define LPUART_ISR_FE_Pos                                   (2U)
#define LPUART_ISR_FE_Msk                                   (0x1UL << LPUART_ISR_FE_Pos)
#define LPUART_ISR_FE                                       LPUART_ISR_FE_Msk
#define LPUART_ISR_TXE_Pos                                  (3U)
#define LPUART_ISR_TXE_Msk                                  (0x1UL << LPUART_ISR_TXE_Pos)
#define LPUART_ISR_TXE                                      LPUART_ISR_TXE_Msk
#define LPUART_ISR_PE_Pos                                   (4U)
#define LPUART_ISR_PE_Msk                                   (0x1UL << LPUART_ISR_PE_Pos)
#define LPUART_ISR_PE                                       LPUART_ISR_PE_Msk
#define LPUART_ISR_CTSIF_Pos                                (5U)
#define LPUART_ISR_CTSIF_Msk                                (0x1UL << LPUART_ISR_CTSIF_Pos)
#define LPUART_ISR_CTSIF                                    LPUART_ISR_CTSIF_Msk
#define LPUART_ISR_CTS_Pos                                  (6U)
#define LPUART_ISR_CTS_Msk                                  (0x1UL << LPUART_ISR_CTS_Pos)
#define LPUART_ISR_CTS                                      LPUART_ISR_CTS_Msk

// LPUART_ICR
#define LPUART_ICR_RCCF_Pos                                 (0U)
#define LPUART_ICR_RCCF_Msk                                 (0x1UL << LPUART_ICR_RCCF_Pos)
#define LPUART_ICR_RCCF                                     LPUART_ICR_RCCF_Msk
#define LPUART_ICR_TCCF_Pos                                 (1U)
#define LPUART_ICR_TCCF_Msk                                 (0x1UL << LPUART_ICR_TCCF_Pos)
#define LPUART_ICR_TCCF                                     LPUART_ICR_TCCF_Msk
#define LPUART_ICR_FECF_Pos                                 (2U)
#define LPUART_ICR_FECF_Msk                                 (0x1UL << LPUART_ICR_FECF_Pos)
#define LPUART_ICR_FECF                                     LPUART_ICR_FECF_Msk
#define LPUART_ICR_PECF_Pos                                 (4U)
#define LPUART_ICR_PECF_Msk                                 (0x1UL << LPUART_ICR_PECF_Pos)
#define LPUART_ICR_PECF                                     LPUART_ICR_PECF_Msk
#define LPUART_ICR_CTSIFCF_Pos                              (5U)
#define LPUART_ICR_CTSIFCF_Msk                              (0x1UL << LPUART_ICR_CTSIFCF_Pos)
#define LPUART_ICR_CTSIFCF                                  LPUART_ICR_CTSIFCF_Msk

// LPUART_SCNT
#define LPUART_SCNT_SCNT_Pos                                (0U)
#define LPUART_SCNT_SCNT_Msk                                (0xFFFFUL << LPUART_SCNT_SCNT_Pos)
#define LPUART_SCNT_SCNT                                    LPUART_SCNT_SCNT_Msk

// LPUART_BSEL
#define LPUART_BSEL_BSEL_Pos                                (0U)
#define LPUART_BSEL_BSEL_Msk                                (0x3UL << LPUART_BSEL_BSEL_Pos)
#define LPUART_BSEL_BSEL                                    LPUART_BSEL_BSEL_Msk

// LPUART_MODU
#define LPUART_MODU_MODU_Pos                                (0U)
#define LPUART_MODU_MODU_Msk                                (0xFFFUL << LPUART_MODU_MODU_Pos)
#define LPUART_MODU_MODU                                    LPUART_MODU_MODU_Msk



//********************    Bits Define For Peripheral LVD    ********************//
// LVD_CR
#define LVD_CR_EN_Pos                                       (0U)
#define LVD_CR_EN_Msk                                       (0x1UL << LVD_CR_EN_Pos)
#define LVD_CR_EN                                           LVD_CR_EN_Msk
#define LVD_CR_ACT_Pos                                      (1U)
#define LVD_CR_ACT_Msk                                      (0x1UL << LVD_CR_ACT_Pos)
#define LVD_CR_ACT                                          LVD_CR_ACT_Msk
#define LVD_CR_SOURCE_Pos                                   (2U)
#define LVD_CR_SOURCE_Msk                                   (0x3UL << LVD_CR_SOURCE_Pos)
#define LVD_CR_SOURCE                                       LVD_CR_SOURCE_Msk
#define LVD_CR_VTDS_Pos                                     (4U)
#define LVD_CR_VTDS_Msk                                     (0xFUL << LVD_CR_VTDS_Pos)
#define LVD_CR_VTDS                                         LVD_CR_VTDS_Msk
#define LVD_CR_DEBOUNCE_TIME_Pos                            (8U)
#define LVD_CR_DEBOUNCE_TIME_Msk                            (0xFUL << LVD_CR_DEBOUNCE_TIME_Pos)
#define LVD_CR_DEBOUNCE_TIME                                LVD_CR_DEBOUNCE_TIME_Msk
#define LVD_CR_FTEN_Pos                                     (12U)
#define LVD_CR_FTEN_Msk                                     (0x1UL << LVD_CR_FTEN_Pos)
#define LVD_CR_FTEN                                         LVD_CR_FTEN_Msk
#define LVD_CR_RTEN_Pos                                     (13U)
#define LVD_CR_RTEN_Msk                                     (0x1UL << LVD_CR_RTEN_Pos)
#define LVD_CR_RTEN                                         LVD_CR_RTEN_Msk
#define LVD_CR_HTEN_Pos                                     (14U)
#define LVD_CR_HTEN_Msk                                     (0x1UL << LVD_CR_HTEN_Pos)
#define LVD_CR_HTEN                                         LVD_CR_HTEN_Msk
#define LVD_CR_IE_Pos                                       (15U)
#define LVD_CR_IE_Msk                                       (0x1UL << LVD_CR_IE_Pos)
#define LVD_CR_IE                                           LVD_CR_IE_Msk
#define LVD_CR_FLT_MODE_Pos                                 (17U)
#define LVD_CR_FLT_MODE_Msk                                 (0x3UL << LVD_CR_FLT_MODE_Pos)
#define LVD_CR_FLT_MODE                                     LVD_CR_FLT_MODE_Msk

// LVD_SR
#define LVD_SR_INTF_Pos                                     (0U)
#define LVD_SR_INTF_Msk                                     (0x1UL << LVD_SR_INTF_Pos)
#define LVD_SR_INTF                                         LVD_SR_INTF_Msk
#define LVD_SR_FLTV_Pos                                     (1U)
#define LVD_SR_FLTV_Msk                                     (0x1UL << LVD_SR_FLTV_Pos)
#define LVD_SR_FLTV                                         LVD_SR_FLTV_Msk



//********************    Bits Define For Peripheral RTC    ********************//
// RTC_CR0
#define RTC_CR0_PRDS_Pos                                    (0U)
#define RTC_CR0_PRDS_Msk                                    (0x7UL << RTC_CR0_PRDS_Pos)
#define RTC_CR0_PRDS                                        RTC_CR0_PRDS_Msk
#define RTC_CR0_AMPM_Pos                                    (3U)
#define RTC_CR0_AMPM_Msk                                    (0x1UL << RTC_CR0_AMPM_Pos)
#define RTC_CR0_AMPM                                        RTC_CR0_AMPM_Msk
#define RTC_CR0_HZ1OE_Pos                                   (5U)
#define RTC_CR0_HZ1OE_Msk                                   (0x1UL << RTC_CR0_HZ1OE_Pos)
#define RTC_CR0_HZ1OE                                       RTC_CR0_HZ1OE_Msk
#define RTC_CR0_HZ1SEL_Pos                                  (6U)
#define RTC_CR0_HZ1SEL_Msk                                  (0x1UL << RTC_CR0_HZ1SEL_Pos)
#define RTC_CR0_HZ1SEL                                      RTC_CR0_HZ1SEL_Msk
#define RTC_CR0_START_Pos                                   (7U)
#define RTC_CR0_START_Msk                                   (0x1UL << RTC_CR0_START_Pos)
#define RTC_CR0_START                                       RTC_CR0_START_Msk
#define RTC_CR0_PRDX_Pos                                    (8U)
#define RTC_CR0_PRDX_Msk                                    (0x3FUL << RTC_CR0_PRDX_Pos)
#define RTC_CR0_PRDX                                        RTC_CR0_PRDX_Msk
#define RTC_CR0_PRDSEL_Pos                                  (14U)
#define RTC_CR0_PRDSEL_Msk                                  (0x1UL << RTC_CR0_PRDSEL_Pos)
#define RTC_CR0_PRDSEL                                      RTC_CR0_PRDSEL_Msk

