yuer-12342/sx1280-test/mcu/common/hc32l021.h
// RTC_ALMB
#define RTC_ALMB_SECL_Pos                                   (0U)
#define RTC_ALMB_SECL_Msk                                   (0xFUL << RTC_ALMB_SECL_Pos)
#define RTC_ALMB_SECL                                       RTC_ALMB_SECL_Msk
#define RTC_ALMB_SECH_Pos                                   (4U)
#define RTC_ALMB_SECH_Msk                                   (0x7UL << RTC_ALMB_SECH_Pos)
#define RTC_ALMB_SECH                                       RTC_ALMB_SECH_Msk
#define RTC_ALMB_MSKS_Pos                                   (7U)
#define RTC_ALMB_MSKS_Msk                                   (0x1UL << RTC_ALMB_MSKS_Pos)
#define RTC_ALMB_MSKS                                       RTC_ALMB_MSKS_Msk
#define RTC_ALMB_MINL_Pos                                   (8U)
#define RTC_ALMB_MINL_Msk                                   (0xFUL << RTC_ALMB_MINL_Pos)
#define RTC_ALMB_MINL                                       RTC_ALMB_MINL_Msk
#define RTC_ALMB_MINH_Pos                                   (12U)
#define RTC_ALMB_MINH_Msk                                   (0x7UL << RTC_ALMB_MINH_Pos)
#define RTC_ALMB_MINH                                       RTC_ALMB_MINH_Msk
#define RTC_ALMB_MSKM_Pos                                   (15U)
#define RTC_ALMB_MSKM_Msk                                   (0x1UL << RTC_ALMB_MSKM_Pos)
#define RTC_ALMB_MSKM                                       RTC_ALMB_MSKM_Msk
#define RTC_ALMB_HOURL_Pos                                  (16U)
#define RTC_ALMB_HOURL_Msk                                  (0xFUL << RTC_ALMB_HOURL_Pos)
#define RTC_ALMB_HOURL                                      RTC_ALMB_HOURL_Msk
#define RTC_ALMB_HOURH_Pos                                  (20U)
#define RTC_ALMB_HOURH_Msk                                  (0x3UL << RTC_ALMB_HOURH_Pos)
#define RTC_ALMB_HOURH                                      RTC_ALMB_HOURH_Msk
#define RTC_ALMB_MSKH_Pos                                   (23U)
#define RTC_ALMB_MSKH_Msk                                   (0x1UL << RTC_ALMB_MSKH_Pos)
#define RTC_ALMB_MSKH                                       RTC_ALMB_MSKH_Msk
#define RTC_ALMB_WEEK_Pos                                   (24U)
#define RTC_ALMB_WEEK_Msk                                   (0x7FUL << RTC_ALMB_WEEK_Pos)
#define RTC_ALMB_WEEK                                       RTC_ALMB_WEEK_Msk

// RTC_TSTR
#define RTC_TSTR_SECL_Pos                                   (0U)
#define RTC_TSTR_SECL_Msk                                   (0xFUL << RTC_TSTR_SECL_Pos)
#define RTC_TSTR_SECL                                       RTC_TSTR_SECL_Msk
#define RTC_TSTR_SECH_Pos                                   (4U)
#define RTC_TSTR_SECH_Msk                                   (0x7UL << RTC_TSTR_SECH_Pos)
#define RTC_TSTR_SECH                                       RTC_TSTR_SECH_Msk
#define RTC_TSTR_MINL_Pos                                   (8U)
#define RTC_TSTR_MINL_Msk                                   (0xFUL << RTC_TSTR_MINL_Pos)
#define RTC_TSTR_MINL                                       RTC_TSTR_MINL_Msk
#define RTC_TSTR_MINH_Pos                                   (12U)
#define RTC_TSTR_MINH_Msk                                   (0x7UL << RTC_TSTR_MINH_Pos)
#define RTC_TSTR_MINH                                       RTC_TSTR_MINH_Msk
#define RTC_TSTR_HOURL_Pos                                  (16U)
#define RTC_TSTR_HOURL_Msk                                  (0xFUL << RTC_TSTR_HOURL_Pos)
#define RTC_TSTR_HOURL                                      RTC_TSTR_HOURL_Msk
#define RTC_TSTR_HOURH_Pos                                  (20U)
#define RTC_TSTR_HOURH_Msk                                  (0x3UL << RTC_TSTR_HOURH_Pos)
#define RTC_TSTR_HOURH                                      RTC_TSTR_HOURH_Msk

// RTC_TSDR
#define RTC_TSDR_DAYL_Pos                                   (0U)
#define RTC_TSDR_DAYL_Msk                                   (0xFUL << RTC_TSDR_DAYL_Pos)
#define RTC_TSDR_DAYL                                       RTC_TSDR_DAYL_Msk
#define RTC_TSDR_DAYH_Pos                                   (4U)
#define RTC_TSDR_DAYH_Msk                                   (0x3UL << RTC_TSDR_DAYH_Pos)
#define RTC_TSDR_DAYH                                       RTC_TSDR_DAYH_Msk
#define RTC_TSDR_MON_Pos                                    (8U)
#define RTC_TSDR_MON_Msk                                    (0x1FUL << RTC_TSDR_MON_Pos)
#define RTC_TSDR_MON                                        RTC_TSDR_MON_Msk
#define RTC_TSDR_WEEK_Pos                                   (13U)
#define RTC_TSDR_WEEK_Msk                                   (0x7UL << RTC_TSDR_WEEK_Pos)
#define RTC_TSDR_WEEK                                       RTC_TSDR_WEEK_Msk

// RTC_WUTR
#define RTC_WUTR_ARR_Pos                                    (0U)
#define RTC_WUTR_ARR_Msk                                    (0xFFFFUL << RTC_WUTR_ARR_Pos)
#define RTC_WUTR_ARR                                        RTC_WUTR_ARR_Msk

// RTC_IER
#define RTC_IER_ALMA_Pos                                    (0U)
#define RTC_IER_ALMA_Msk                                    (0x1UL << RTC_IER_ALMA_Pos)
#define RTC_IER_ALMA                                        RTC_IER_ALMA_Msk
#define RTC_IER_ALMB_Pos                                    (1U)
#define RTC_IER_ALMB_Msk                                    (0x1UL << RTC_IER_ALMB_Pos)
#define RTC_IER_ALMB                                        RTC_IER_ALMB_Msk
#define RTC_IER_WU_Pos                                      (2U)
#define RTC_IER_WU_Msk                                      (0x1UL << RTC_IER_WU_Pos)
#define RTC_IER_WU                                          RTC_IER_WU_Msk
#define RTC_IER_TS_Pos                                      (3U)
#define RTC_IER_TS_Msk                                      (0x1UL << RTC_IER_TS_Pos)
#define RTC_IER_TS                                          RTC_IER_TS_Msk
#define RTC_IER_PRD_Pos                                     (6U)
#define RTC_IER_PRD_Msk                                     (0x1UL << RTC_IER_PRD_Pos)
#define RTC_IER_PRD                                         RTC_IER_PRD_Msk

// RTC_IFR
#define RTC_IFR_ALMA_Pos                                    (0U)
#define RTC_IFR_ALMA_Msk                                    (0x1UL << RTC_IFR_ALMA_Pos)
#define RTC_IFR_ALMA                                        RTC_IFR_ALMA_Msk
#define RTC_IFR_ALMB_Pos                                    (1U)
#define RTC_IFR_ALMB_Msk                                    (0x1UL << RTC_IFR_ALMB_Pos)
#define RTC_IFR_ALMB                                        RTC_IFR_ALMB_Msk
#define RTC_IFR_WU_Pos                                      (2U)
#define RTC_IFR_WU_Msk                                      (0x1UL << RTC_IFR_WU_Pos)
#define RTC_IFR_WU                                          RTC_IFR_WU_Msk
#define RTC_IFR_TS_Pos                                      (3U)
#define RTC_IFR_TS_Msk                                      (0x1UL << RTC_IFR_TS_Pos)
#define RTC_IFR_TS                                          RTC_IFR_TS_Msk
#define RTC_IFR_TSOV_Pos                                    (4U)
#define RTC_IFR_TSOV_Msk                                    (0x1UL << RTC_IFR_TSOV_Pos)
#define RTC_IFR_TSOV                                        RTC_IFR_TSOV_Msk
#define RTC_IFR_PRD_Pos                                     (6U)
#define RTC_IFR_PRD_Msk                                     (0x1UL << RTC_IFR_PRD_Pos)
#define RTC_IFR_PRD                                         RTC_IFR_PRD_Msk

