yuer-12342/sx1280-test/mcu/common/hc32l021.h
// RTC_ICR
#define RTC_ICR_ALMA_Pos                                    (0U)
#define RTC_ICR_ALMA_Msk                                    (0x1UL << RTC_ICR_ALMA_Pos)
#define RTC_ICR_ALMA                                        RTC_ICR_ALMA_Msk
#define RTC_ICR_ALMB_Pos                                    (1U)
#define RTC_ICR_ALMB_Msk                                    (0x1UL << RTC_ICR_ALMB_Pos)
#define RTC_ICR_ALMB                                        RTC_ICR_ALMB_Msk
#define RTC_ICR_WU_Pos                                      (2U)
#define RTC_ICR_WU_Msk                                      (0x1UL << RTC_ICR_WU_Pos)
#define RTC_ICR_WU                                          RTC_ICR_WU_Msk
#define RTC_ICR_TS_Pos                                      (3U)
#define RTC_ICR_TS_Msk                                      (0x1UL << RTC_ICR_TS_Pos)
#define RTC_ICR_TS                                          RTC_ICR_TS_Msk
#define RTC_ICR_TSOV_Pos                                    (4U)
#define RTC_ICR_TSOV_Msk                                    (0x1UL << RTC_ICR_TSOV_Pos)
#define RTC_ICR_TSOV                                        RTC_ICR_TSOV_Msk
#define RTC_ICR_PRD_Pos                                     (6U)
#define RTC_ICR_PRD_Msk                                     (0x1UL << RTC_ICR_PRD_Pos)
#define RTC_ICR_PRD                                         RTC_ICR_PRD_Msk

// RTC_WPR
#define RTC_WPR_WPR_Pos                                     (0U)
#define RTC_WPR_WPR_Msk                                     (0xFFUL << RTC_WPR_WPR_Pos)
#define RTC_WPR_WPR                                         RTC_WPR_WPR_Msk



//********************    Bits Define For Peripheral SPI    ********************//
// SPI_CR0
#define SPI_CR0_EN_Pos                                      (0U)
#define SPI_CR0_EN_Msk                                      (0x1UL << SPI_CR0_EN_Pos)
#define SPI_CR0_EN                                          SPI_CR0_EN_Msk
#define SPI_CR0_BRR_Pos                                     (1U)
#define SPI_CR0_BRR_Msk                                     (0x7UL << SPI_CR0_BRR_Pos)
#define SPI_CR0_BRR                                         SPI_CR0_BRR_Msk
#define SPI_CR0_CPHA_Pos                                    (4U)
#define SPI_CR0_CPHA_Msk                                    (0x1UL << SPI_CR0_CPHA_Pos)
#define SPI_CR0_CPHA                                        SPI_CR0_CPHA_Msk
#define SPI_CR0_CPOL_Pos                                    (5U)
#define SPI_CR0_CPOL_Msk                                    (0x1UL << SPI_CR0_CPOL_Pos)
#define SPI_CR0_CPOL                                        SPI_CR0_CPOL_Msk
#define SPI_CR0_MSTR_Pos                                    (6U)
#define SPI_CR0_MSTR_Msk                                    (0x1UL << SPI_CR0_MSTR_Pos)
#define SPI_CR0_MSTR                                        SPI_CR0_MSTR_Msk
#define SPI_CR0_LSBF_Pos                                    (7U)
#define SPI_CR0_LSBF_Msk                                    (0x1UL << SPI_CR0_LSBF_Pos)
#define SPI_CR0_LSBF                                        SPI_CR0_LSBF_Msk
#define SPI_CR0_WIDTH_Pos                                   (8U)
#define SPI_CR0_WIDTH_Msk                                   (0xFUL << SPI_CR0_WIDTH_Pos)
#define SPI_CR0_WIDTH                                       SPI_CR0_WIDTH_Msk
#define SPI_CR0_SSM_Pos                                     (12U)
#define SPI_CR0_SSM_Msk                                     (0x1UL << SPI_CR0_SSM_Pos)
#define SPI_CR0_SSM                                         SPI_CR0_SSM_Msk
#define SPI_CR0_CM_Pos                                      (13U)
#define SPI_CR0_CM_Msk                                      (0x3UL << SPI_CR0_CM_Pos)
#define SPI_CR0_CM                                          SPI_CR0_CM_Msk
#define SPI_CR0_SMP_Pos                                     (15U)
#define SPI_CR0_SMP_Msk                                     (0x1UL << SPI_CR0_SMP_Pos)
#define SPI_CR0_SMP                                         SPI_CR0_SMP_Msk

// SPI_CR1
#define SPI_CR1_TXEIE_Pos                                   (0U)
#define SPI_CR1_TXEIE_Msk                                   (0x1UL << SPI_CR1_TXEIE_Pos)
#define SPI_CR1_TXEIE                                       SPI_CR1_TXEIE_Msk
#define SPI_CR1_RXNEIE_Pos                                  (1U)
#define SPI_CR1_RXNEIE_Msk                                  (0x1UL << SPI_CR1_RXNEIE_Pos)
#define SPI_CR1_RXNEIE                                      SPI_CR1_RXNEIE_Msk
#define SPI_CR1_SSFIE_Pos                                   (2U)
#define SPI_CR1_SSFIE_Msk                                   (0x1UL << SPI_CR1_SSFIE_Pos)
#define SPI_CR1_SSFIE                                       SPI_CR1_SSFIE_Msk
#define SPI_CR1_SSRIE_Pos                                   (3U)
#define SPI_CR1_SSRIE_Msk                                   (0x1UL << SPI_CR1_SSRIE_Pos)
#define SPI_CR1_SSRIE                                       SPI_CR1_SSRIE_Msk
#define SPI_CR1_UDFIE_Pos                                   (4U)
#define SPI_CR1_UDFIE_Msk                                   (0x1UL << SPI_CR1_UDFIE_Pos)
#define SPI_CR1_UDFIE                                       SPI_CR1_UDFIE_Msk
#define SPI_CR1_OVFIE_Pos                                   (5U)
#define SPI_CR1_OVFIE_Msk                                   (0x1UL << SPI_CR1_OVFIE_Pos)
#define SPI_CR1_OVFIE                                       SPI_CR1_OVFIE_Msk
#define SPI_CR1_SSERRIE_Pos                                 (6U)
#define SPI_CR1_SSERRIE_Msk                                 (0x1UL << SPI_CR1_SSERRIE_Pos)
#define SPI_CR1_SSERRIE                                     SPI_CR1_SSERRIE_Msk
#define SPI_CR1_MODFIE_Pos                                  (7U)
#define SPI_CR1_MODFIE_Msk                                  (0x1UL << SPI_CR1_MODFIE_Pos)
#define SPI_CR1_MODFIE                                      SPI_CR1_MODFIE_Msk

// SPI_HDOE
#define SPI_HDOE_HDOE_Pos                                   (0U)
#define SPI_HDOE_HDOE_Msk                                   (0x1UL << SPI_HDOE_HDOE_Pos)
#define SPI_HDOE_HDOE                                       SPI_HDOE_HDOE_Msk

