yuer-12342/sx1280-test/mcu/common/hc32l021.h
// SPI_SSI
#define SPI_SSI_SSI_Pos                                     (0U)
#define SPI_SSI_SSI_Msk                                     (0x1UL << SPI_SSI_SSI_Pos)
#define SPI_SSI_SSI                                         SPI_SSI_SSI_Msk

// SPI_SR
#define SPI_SR_TXE_Pos                                      (0U)
#define SPI_SR_TXE_Msk                                      (0x1UL << SPI_SR_TXE_Pos)
#define SPI_SR_TXE                                          SPI_SR_TXE_Msk
#define SPI_SR_RXNE_Pos                                     (1U)
#define SPI_SR_RXNE_Msk                                     (0x1UL << SPI_SR_RXNE_Pos)
#define SPI_SR_RXNE                                         SPI_SR_RXNE_Msk
#define SPI_SR_SSF_Pos                                      (2U)
#define SPI_SR_SSF_Msk                                      (0x1UL << SPI_SR_SSF_Pos)
#define SPI_SR_SSF                                          SPI_SR_SSF_Msk
#define SPI_SR_SSR_Pos                                      (3U)
#define SPI_SR_SSR_Msk                                      (0x1UL << SPI_SR_SSR_Pos)
#define SPI_SR_SSR                                          SPI_SR_SSR_Msk
#define SPI_SR_UDF_Pos                                      (4U)
#define SPI_SR_UDF_Msk                                      (0x1UL << SPI_SR_UDF_Pos)
#define SPI_SR_UDF                                          SPI_SR_UDF_Msk
#define SPI_SR_OVF_Pos                                      (5U)
#define SPI_SR_OVF_Msk                                      (0x1UL << SPI_SR_OVF_Pos)
#define SPI_SR_OVF                                          SPI_SR_OVF_Msk
#define SPI_SR_SSERR_Pos                                    (6U)
#define SPI_SR_SSERR_Msk                                    (0x1UL << SPI_SR_SSERR_Pos)
#define SPI_SR_SSERR                                        SPI_SR_SSERR_Msk
#define SPI_SR_MODF_Pos                                     (7U)
#define SPI_SR_MODF_Msk                                     (0x1UL << SPI_SR_MODF_Pos)
#define SPI_SR_MODF                                         SPI_SR_MODF_Msk
#define SPI_SR_BUSY_Pos                                     (8U)
#define SPI_SR_BUSY_Msk                                     (0x1UL << SPI_SR_BUSY_Pos)
#define SPI_SR_BUSY                                         SPI_SR_BUSY_Msk
#define SPI_SR_SSLVL_Pos                                    (9U)
#define SPI_SR_SSLVL_Msk                                    (0x1UL << SPI_SR_SSLVL_Pos)
#define SPI_SR_SSLVL                                        SPI_SR_SSLVL_Msk

// SPI_ICR
#define SPI_ICR_TXE_Pos                                     (0U)
#define SPI_ICR_TXE_Msk                                     (0x1UL << SPI_ICR_TXE_Pos)
#define SPI_ICR_TXE                                         SPI_ICR_TXE_Msk
#define SPI_ICR_RXNE_Pos                                    (1U)
#define SPI_ICR_RXNE_Msk                                    (0x1UL << SPI_ICR_RXNE_Pos)
#define SPI_ICR_RXNE                                        SPI_ICR_RXNE_Msk
#define SPI_ICR_SSF_Pos                                     (2U)
#define SPI_ICR_SSF_Msk                                     (0x1UL << SPI_ICR_SSF_Pos)
#define SPI_ICR_SSF                                         SPI_ICR_SSF_Msk
#define SPI_ICR_SSR_Pos                                     (3U)
#define SPI_ICR_SSR_Msk                                     (0x1UL << SPI_ICR_SSR_Pos)
#define SPI_ICR_SSR                                         SPI_ICR_SSR_Msk
#define SPI_ICR_UDF_Pos                                     (4U)
#define SPI_ICR_UDF_Msk                                     (0x1UL << SPI_ICR_UDF_Pos)
#define SPI_ICR_UDF                                         SPI_ICR_UDF_Msk
#define SPI_ICR_OVF_Pos                                     (5U)
#define SPI_ICR_OVF_Msk                                     (0x1UL << SPI_ICR_OVF_Pos)
#define SPI_ICR_OVF                                         SPI_ICR_OVF_Msk
#define SPI_ICR_SSERR_Pos                                   (6U)
#define SPI_ICR_SSERR_Msk                                   (0x1UL << SPI_ICR_SSERR_Pos)
#define SPI_ICR_SSERR                                       SPI_ICR_SSERR_Msk
#define SPI_ICR_MODF_Pos                                    (7U)
#define SPI_ICR_MODF_Msk                                    (0x1UL << SPI_ICR_MODF_Pos)
#define SPI_ICR_MODF                                        SPI_ICR_MODF_Msk

// SPI_DR
#define SPI_DR_DR_Pos                                       (0U)
#define SPI_DR_DR_Msk                                       (0xFFFFUL << SPI_DR_DR_Pos)
#define SPI_DR_DR                                           SPI_DR_DR_Msk



//********************    Bits Define For Peripheral SYSCTRL    ********************//
// SYSCTRL_SYSCTRL0
#define SYSCTRL_SYSCTRL0_RC48M_EN_Pos                       (0U)
#define SYSCTRL_SYSCTRL0_RC48M_EN_Msk                       (0x1UL << SYSCTRL_SYSCTRL0_RC48M_EN_Pos)
#define SYSCTRL_SYSCTRL0_RC48M_EN                           SYSCTRL_SYSCTRL0_RC48M_EN_Msk
#define SYSCTRL_SYSCTRL0_RCL_EN_Pos                         (2U)
#define SYSCTRL_SYSCTRL0_RCL_EN_Msk                         (0x1UL << SYSCTRL_SYSCTRL0_RCL_EN_Pos)
#define SYSCTRL_SYSCTRL0_RCL_EN                             SYSCTRL_SYSCTRL0_RCL_EN_Msk
#define SYSCTRL_SYSCTRL0_XTL_EN_Pos                         (3U)
#define SYSCTRL_SYSCTRL0_XTL_EN_Msk                         (0x1UL << SYSCTRL_SYSCTRL0_XTL_EN_Pos)
#define SYSCTRL_SYSCTRL0_XTL_EN                             SYSCTRL_SYSCTRL0_XTL_EN_Msk
#define SYSCTRL_SYSCTRL0_CLKSW_Pos                          (5U)
#define SYSCTRL_SYSCTRL0_CLKSW_Msk                          (0x7UL << SYSCTRL_SYSCTRL0_CLKSW_Pos)
#define SYSCTRL_SYSCTRL0_CLKSW                              SYSCTRL_SYSCTRL0_CLKSW_Msk
#define SYSCTRL_SYSCTRL0_HCLK_PRS_Pos                       (8U)
#define SYSCTRL_SYSCTRL0_HCLK_PRS_Msk                       (0x7UL << SYSCTRL_SYSCTRL0_HCLK_PRS_Pos)
#define SYSCTRL_SYSCTRL0_HCLK_PRS                           SYSCTRL_SYSCTRL0_HCLK_PRS_Msk
#define SYSCTRL_SYSCTRL0_WAKEUP_BYRC48M_Pos                 (15U)
#define SYSCTRL_SYSCTRL0_WAKEUP_BYRC48M_Msk                 (0x1UL << SYSCTRL_SYSCTRL0_WAKEUP_BYRC48M_Pos)
#define SYSCTRL_SYSCTRL0_WAKEUP_BYRC48M                     SYSCTRL_SYSCTRL0_WAKEUP_BYRC48M_Msk

// SYSCTRL_SYSCTRL1
#define SYSCTRL_SYSCTRL1_RESET_USE_IO_Pos                   (0U)
#define SYSCTRL_SYSCTRL1_RESET_USE_IO_Msk                   (0x1UL << SYSCTRL_SYSCTRL1_RESET_USE_IO_Pos)
#define SYSCTRL_SYSCTRL1_RESET_USE_IO                       SYSCTRL_SYSCTRL1_RESET_USE_IO_Msk
#define SYSCTRL_SYSCTRL1_EXTH_EN_Pos                        (1U)
#define SYSCTRL_SYSCTRL1_EXTH_EN_Msk                        (0x1UL << SYSCTRL_SYSCTRL1_EXTH_EN_Pos)
#define SYSCTRL_SYSCTRL1_EXTH_EN                            SYSCTRL_SYSCTRL1_EXTH_EN_Msk
#define SYSCTRL_SYSCTRL1_EXTL_EN_Pos                        (2U)
#define SYSCTRL_SYSCTRL1_EXTL_EN_Msk                        (0x1UL << SYSCTRL_SYSCTRL1_EXTL_EN_Pos)
#define SYSCTRL_SYSCTRL1_EXTL_EN                            SYSCTRL_SYSCTRL1_EXTL_EN_Msk
#define SYSCTRL_SYSCTRL1_XTL_ALWAYS_ON_Pos                  (3U)
#define SYSCTRL_SYSCTRL1_XTL_ALWAYS_ON_Msk                  (0x1UL << SYSCTRL_SYSCTRL1_XTL_ALWAYS_ON_Pos)
#define SYSCTRL_SYSCTRL1_XTL_ALWAYS_ON                      SYSCTRL_SYSCTRL1_XTL_ALWAYS_ON_Msk
#define SYSCTRL_SYSCTRL1_CLOCK_FAULT_EN_Pos                 (4U)
#define SYSCTRL_SYSCTRL1_CLOCK_FAULT_EN_Msk                 (0x1UL << SYSCTRL_SYSCTRL1_CLOCK_FAULT_EN_Pos)
#define SYSCTRL_SYSCTRL1_CLOCK_FAULT_EN                     SYSCTRL_SYSCTRL1_CLOCK_FAULT_EN_Msk
#define SYSCTRL_SYSCTRL1_LOCKUP_EN_Pos                      (6U)
#define SYSCTRL_SYSCTRL1_LOCKUP_EN_Msk                      (0x1UL << SYSCTRL_SYSCTRL1_LOCKUP_EN_Pos)
#define SYSCTRL_SYSCTRL1_LOCKUP_EN                          SYSCTRL_SYSCTRL1_LOCKUP_EN_Msk
#define SYSCTRL_SYSCTRL1_SPI_PCTRL_Pos                      (7U)
#define SYSCTRL_SYSCTRL1_SPI_PCTRL_Msk                      (0x1UL << SYSCTRL_SYSCTRL1_SPI_PCTRL_Pos)
#define SYSCTRL_SYSCTRL1_SPI_PCTRL                          SYSCTRL_SYSCTRL1_SPI_PCTRL_Msk
#define SYSCTRL_SYSCTRL1_SWD_USE_IO_Pos                     (8U)
#define SYSCTRL_SYSCTRL1_SWD_USE_IO_Msk                     (0x1UL << SYSCTRL_SYSCTRL1_SWD_USE_IO_Pos)
#define SYSCTRL_SYSCTRL1_SWD_USE_IO                         SYSCTRL_SYSCTRL1_SWD_USE_IO_Msk
#define SYSCTRL_SYSCTRL1_CTIMER0_FUN_SEL_Pos                (9U)
#define SYSCTRL_SYSCTRL1_CTIMER0_FUN_SEL_Msk                (0x1UL << SYSCTRL_SYSCTRL1_CTIMER0_FUN_SEL_Pos)
#define SYSCTRL_SYSCTRL1_CTIMER0_FUN_SEL                    SYSCTRL_SYSCTRL1_CTIMER0_FUN_SEL_Msk
#define SYSCTRL_SYSCTRL1_CTIMER1_FUN_SEL_Pos                (10U)
#define SYSCTRL_SYSCTRL1_CTIMER1_FUN_SEL_Msk                (0x1UL << SYSCTRL_SYSCTRL1_CTIMER1_FUN_SEL_Pos)
#define SYSCTRL_SYSCTRL1_CTIMER1_FUN_SEL                    SYSCTRL_SYSCTRL1_CTIMER1_FUN_SEL_Msk

// SYSCTRL_SYSCTRL2
#define SYSCTRL_SYSCTRL2_SYSCTRL2_Pos                       (0U)
#define SYSCTRL_SYSCTRL2_SYSCTRL2_Msk                       (0xFFFFUL << SYSCTRL_SYSCTRL2_SYSCTRL2_Pos)
#define SYSCTRL_SYSCTRL2_SYSCTRL2                           SYSCTRL_SYSCTRL2_SYSCTRL2_Msk

