yuer-12342/sx1280-test/mcu/common/hc32l021.h
// SYSCTRL_RC48M_CR
#define SYSCTRL_RC48M_CR_TRIMF_Pos                          (2U)
#define SYSCTRL_RC48M_CR_TRIMF_Msk                          (0x3FUL << SYSCTRL_RC48M_CR_TRIMF_Pos)
#define SYSCTRL_RC48M_CR_TRIMF                              SYSCTRL_RC48M_CR_TRIMF_Msk
#define SYSCTRL_RC48M_CR_TRIMC_Pos                          (8U)
#define SYSCTRL_RC48M_CR_TRIMC_Msk                          (0xFFUL << SYSCTRL_RC48M_CR_TRIMC_Pos)
#define SYSCTRL_RC48M_CR_TRIMC                              SYSCTRL_RC48M_CR_TRIMC_Msk
#define SYSCTRL_RC48M_CR_FSEL_Pos                           (16U)
#define SYSCTRL_RC48M_CR_FSEL_Msk                           (0x3UL << SYSCTRL_RC48M_CR_FSEL_Pos)
#define SYSCTRL_RC48M_CR_FSEL                               SYSCTRL_RC48M_CR_FSEL_Msk
#define SYSCTRL_RC48M_CR_STABLE_Pos                         (31U)
#define SYSCTRL_RC48M_CR_STABLE_Msk                         (0x1UL << SYSCTRL_RC48M_CR_STABLE_Pos)
#define SYSCTRL_RC48M_CR_STABLE                             SYSCTRL_RC48M_CR_STABLE_Msk

// SYSCTRL_RCL_CR
#define SYSCTRL_RCL_CR_TRIM_Pos                             (0U)
#define SYSCTRL_RCL_CR_TRIM_Msk                             (0x3FFUL << SYSCTRL_RCL_CR_TRIM_Pos)
#define SYSCTRL_RCL_CR_TRIM                                 SYSCTRL_RCL_CR_TRIM_Msk
#define SYSCTRL_RCL_CR_STABLE_Pos                           (12U)
#define SYSCTRL_RCL_CR_STABLE_Msk                           (0x1UL << SYSCTRL_RCL_CR_STABLE_Pos)
#define SYSCTRL_RCL_CR_STABLE                               SYSCTRL_RCL_CR_STABLE_Msk
#define SYSCTRL_RCL_CR_MSEL_Pos                             (16U)
#define SYSCTRL_RCL_CR_MSEL_Msk                             (0x1UL << SYSCTRL_RCL_CR_MSEL_Pos)
#define SYSCTRL_RCL_CR_MSEL                                 SYSCTRL_RCL_CR_MSEL_Msk

// SYSCTRL_XTL_CR
#define SYSCTRL_XTL_CR_DRIVER_Pos                           (0U)
#define SYSCTRL_XTL_CR_DRIVER_Msk                           (0x3UL << SYSCTRL_XTL_CR_DRIVER_Pos)
#define SYSCTRL_XTL_CR_DRIVER                               SYSCTRL_XTL_CR_DRIVER_Msk
#define SYSCTRL_XTL_CR_AMP_SEL_Pos                          (2U)
#define SYSCTRL_XTL_CR_AMP_SEL_Msk                          (0x3UL << SYSCTRL_XTL_CR_AMP_SEL_Pos)
#define SYSCTRL_XTL_CR_AMP_SEL                              SYSCTRL_XTL_CR_AMP_SEL_Msk
#define SYSCTRL_XTL_CR_STARTUP_Pos                          (4U)
#define SYSCTRL_XTL_CR_STARTUP_Msk                          (0x3UL << SYSCTRL_XTL_CR_STARTUP_Pos)
#define SYSCTRL_XTL_CR_STARTUP                              SYSCTRL_XTL_CR_STARTUP_Msk
#define SYSCTRL_XTL_CR_STABLE_Pos                           (6U)
#define SYSCTRL_XTL_CR_STABLE_Msk                           (0x1UL << SYSCTRL_XTL_CR_STABLE_Pos)
#define SYSCTRL_XTL_CR_STABLE                               SYSCTRL_XTL_CR_STABLE_Msk
#define SYSCTRL_XTL_CR_DETIE_Pos                            (7U)
#define SYSCTRL_XTL_CR_DETIE_Msk                            (0x1UL << SYSCTRL_XTL_CR_DETIE_Pos)
#define SYSCTRL_XTL_CR_DETIE                                SYSCTRL_XTL_CR_DETIE_Msk
#define SYSCTRL_XTL_CR_DETTIME_Pos                          (8U)
#define SYSCTRL_XTL_CR_DETTIME_Msk                          (0x1UL << SYSCTRL_XTL_CR_DETTIME_Pos)
#define SYSCTRL_XTL_CR_DETTIME                              SYSCTRL_XTL_CR_DETTIME_Msk
#define SYSCTRL_XTL_CR_DETEN_Pos                            (9U)
#define SYSCTRL_XTL_CR_DETEN_Msk                            (0x1UL << SYSCTRL_XTL_CR_DETEN_Pos)
#define SYSCTRL_XTL_CR_DETEN                                SYSCTRL_XTL_CR_DETEN_Msk
#define SYSCTRL_XTL_CR_FAULT_STATE_Pos                      (10U)
#define SYSCTRL_XTL_CR_FAULT_STATE_Msk                      (0x1UL << SYSCTRL_XTL_CR_FAULT_STATE_Pos)
#define SYSCTRL_XTL_CR_FAULT_STATE                          SYSCTRL_XTL_CR_FAULT_STATE_Msk

// SYSCTRL_RESET_FLAG
#define SYSCTRL_RESET_FLAG_POR5V_Pos                        (0U)
#define SYSCTRL_RESET_FLAG_POR5V_Msk                        (0x1UL << SYSCTRL_RESET_FLAG_POR5V_Pos)
#define SYSCTRL_RESET_FLAG_POR5V                            SYSCTRL_RESET_FLAG_POR5V_Msk
#define SYSCTRL_RESET_FLAG_POR15V_Pos                       (1U)
#define SYSCTRL_RESET_FLAG_POR15V_Msk                       (0x1UL << SYSCTRL_RESET_FLAG_POR15V_Pos)
#define SYSCTRL_RESET_FLAG_POR15V                           SYSCTRL_RESET_FLAG_POR15V_Msk
#define SYSCTRL_RESET_FLAG_LVD_FLAG_Pos                     (2U)
#define SYSCTRL_RESET_FLAG_LVD_FLAG_Msk                     (0x1UL << SYSCTRL_RESET_FLAG_LVD_FLAG_Pos)
#define SYSCTRL_RESET_FLAG_LVD_FLAG                         SYSCTRL_RESET_FLAG_LVD_FLAG_Msk
#define SYSCTRL_RESET_FLAG_IWDT_FLAG_Pos                    (3U)
#define SYSCTRL_RESET_FLAG_IWDT_FLAG_Msk                    (0x1UL << SYSCTRL_RESET_FLAG_IWDT_FLAG_Pos)
#define SYSCTRL_RESET_FLAG_IWDT_FLAG                        SYSCTRL_RESET_FLAG_IWDT_FLAG_Msk
#define SYSCTRL_RESET_FLAG_LOCKUP_Pos                       (5U)
#define SYSCTRL_RESET_FLAG_LOCKUP_Msk                       (0x1UL << SYSCTRL_RESET_FLAG_LOCKUP_Pos)
#define SYSCTRL_RESET_FLAG_LOCKUP                           SYSCTRL_RESET_FLAG_LOCKUP_Msk
#define SYSCTRL_RESET_FLAG_SYSREQ_Pos                       (6U)
#define SYSCTRL_RESET_FLAG_SYSREQ_Msk                       (0x1UL << SYSCTRL_RESET_FLAG_SYSREQ_Pos)
#define SYSCTRL_RESET_FLAG_SYSREQ                           SYSCTRL_RESET_FLAG_SYSREQ_Msk
#define SYSCTRL_RESET_FLAG_RSTB_Pos                         (7U)
#define SYSCTRL_RESET_FLAG_RSTB_Msk                         (0x1UL << SYSCTRL_RESET_FLAG_RSTB_Pos)
#define SYSCTRL_RESET_FLAG_RSTB                             SYSCTRL_RESET_FLAG_RSTB_Msk

// SYSCTRL_PERI_CLKEN0
#define SYSCTRL_PERI_CLKEN0_LPUART0_EN_Pos                  (2U)
#define SYSCTRL_PERI_CLKEN0_LPUART0_EN_Msk                  (0x1UL << SYSCTRL_PERI_CLKEN0_LPUART0_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_LPUART0_EN                      SYSCTRL_PERI_CLKEN0_LPUART0_EN_Msk
#define SYSCTRL_PERI_CLKEN0_LPUART1_EN_Pos                  (3U)
#define SYSCTRL_PERI_CLKEN0_LPUART1_EN_Msk                  (0x1UL << SYSCTRL_PERI_CLKEN0_LPUART1_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_LPUART1_EN                      SYSCTRL_PERI_CLKEN0_LPUART1_EN_Msk
#define SYSCTRL_PERI_CLKEN0_SPI_EN_Pos                      (6U)
#define SYSCTRL_PERI_CLKEN0_SPI_EN_Msk                      (0x1UL << SYSCTRL_PERI_CLKEN0_SPI_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_SPI_EN                          SYSCTRL_PERI_CLKEN0_SPI_EN_Msk
#define SYSCTRL_PERI_CLKEN0_ATIM3_EN_Pos                    (11U)
#define SYSCTRL_PERI_CLKEN0_ATIM3_EN_Msk                    (0x1UL << SYSCTRL_PERI_CLKEN0_ATIM3_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_ATIM3_EN                        SYSCTRL_PERI_CLKEN0_ATIM3_EN_Msk
#define SYSCTRL_PERI_CLKEN0_IWDT_EN_Pos                     (15U)
#define SYSCTRL_PERI_CLKEN0_IWDT_EN_Msk                     (0x1UL << SYSCTRL_PERI_CLKEN0_IWDT_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_IWDT_EN                         SYSCTRL_PERI_CLKEN0_IWDT_EN_Msk
#define SYSCTRL_PERI_CLKEN0_ADC_EN_Pos                      (16U)
#define SYSCTRL_PERI_CLKEN0_ADC_EN_Msk                      (0x1UL << SYSCTRL_PERI_CLKEN0_ADC_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_ADC_EN                          SYSCTRL_PERI_CLKEN0_ADC_EN_Msk
#define SYSCTRL_PERI_CLKEN0_VC_EN_Pos                       (17U)
#define SYSCTRL_PERI_CLKEN0_VC_EN_Msk                       (0x1UL << SYSCTRL_PERI_CLKEN0_VC_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_VC_EN                           SYSCTRL_PERI_CLKEN0_VC_EN_Msk
#define SYSCTRL_PERI_CLKEN0_TRNG_EN_Pos                     (18U)
#define SYSCTRL_PERI_CLKEN0_TRNG_EN_Msk                     (0x1UL << SYSCTRL_PERI_CLKEN0_TRNG_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_TRNG_EN                         SYSCTRL_PERI_CLKEN0_TRNG_EN_Msk
#define SYSCTRL_PERI_CLKEN0_RTC_EN_Pos                      (20U)
#define SYSCTRL_PERI_CLKEN0_RTC_EN_Msk                      (0x1UL << SYSCTRL_PERI_CLKEN0_RTC_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_RTC_EN                          SYSCTRL_PERI_CLKEN0_RTC_EN_Msk
#define SYSCTRL_PERI_CLKEN0_GPIO_EN_Pos                     (28U)
#define SYSCTRL_PERI_CLKEN0_GPIO_EN_Msk                     (0x1UL << SYSCTRL_PERI_CLKEN0_GPIO_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_GPIO_EN                         SYSCTRL_PERI_CLKEN0_GPIO_EN_Msk
#define SYSCTRL_PERI_CLKEN0_HSI2C_EN_Pos                    (30U)
#define SYSCTRL_PERI_CLKEN0_HSI2C_EN_Msk                    (0x1UL << SYSCTRL_PERI_CLKEN0_HSI2C_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_HSI2C_EN                        SYSCTRL_PERI_CLKEN0_HSI2C_EN_Msk
#define SYSCTRL_PERI_CLKEN0_FLASH_EN_Pos                    (31U)
#define SYSCTRL_PERI_CLKEN0_FLASH_EN_Msk                    (0x1UL << SYSCTRL_PERI_CLKEN0_FLASH_EN_Pos)
#define SYSCTRL_PERI_CLKEN0_FLASH_EN                        SYSCTRL_PERI_CLKEN0_FLASH_EN_Msk

// SYSCTRL_PERI_CLKEN1
#define SYSCTRL_PERI_CLKEN1_CTIM0_EN_Pos                    (0U)
#define SYSCTRL_PERI_CLKEN1_CTIM0_EN_Msk                    (0x1UL << SYSCTRL_PERI_CLKEN1_CTIM0_EN_Pos)
#define SYSCTRL_PERI_CLKEN1_CTIM0_EN                        SYSCTRL_PERI_CLKEN1_CTIM0_EN_Msk
#define SYSCTRL_PERI_CLKEN1_CTIM1_EN_Pos                    (1U)
#define SYSCTRL_PERI_CLKEN1_CTIM1_EN_Msk                    (0x1UL << SYSCTRL_PERI_CLKEN1_CTIM1_EN_Pos)
#define SYSCTRL_PERI_CLKEN1_CTIM1_EN                        SYSCTRL_PERI_CLKEN1_CTIM1_EN_Msk
#define SYSCTRL_PERI_CLKEN1_CTRIM_EN_Pos                    (2U)
#define SYSCTRL_PERI_CLKEN1_CTRIM_EN_Msk                    (0x1UL << SYSCTRL_PERI_CLKEN1_CTRIM_EN_Pos)
#define SYSCTRL_PERI_CLKEN1_CTRIM_EN                        SYSCTRL_PERI_CLKEN1_CTRIM_EN_Msk

// SYSCTRL_PERI_RESET0
#define SYSCTRL_PERI_RESET0_LPUART0_RST_Pos                 (2U)
#define SYSCTRL_PERI_RESET0_LPUART0_RST_Msk                 (0x1UL << SYSCTRL_PERI_RESET0_LPUART0_RST_Pos)
#define SYSCTRL_PERI_RESET0_LPUART0_RST                     SYSCTRL_PERI_RESET0_LPUART0_RST_Msk
#define SYSCTRL_PERI_RESET0_LPUART1_RST_Pos                 (3U)
#define SYSCTRL_PERI_RESET0_LPUART1_RST_Msk                 (0x1UL << SYSCTRL_PERI_RESET0_LPUART1_RST_Pos)
#define SYSCTRL_PERI_RESET0_LPUART1_RST                     SYSCTRL_PERI_RESET0_LPUART1_RST_Msk
#define SYSCTRL_PERI_RESET0_SPI_RST_Pos                     (6U)
#define SYSCTRL_PERI_RESET0_SPI_RST_Msk                     (0x1UL << SYSCTRL_PERI_RESET0_SPI_RST_Pos)
#define SYSCTRL_PERI_RESET0_SPI_RST                         SYSCTRL_PERI_RESET0_SPI_RST_Msk
#define SYSCTRL_PERI_RESET0_ATIM3_RST_Pos                   (11U)
#define SYSCTRL_PERI_RESET0_ATIM3_RST_Msk                   (0x1UL << SYSCTRL_PERI_RESET0_ATIM3_RST_Pos)
#define SYSCTRL_PERI_RESET0_ATIM3_RST                       SYSCTRL_PERI_RESET0_ATIM3_RST_Msk
#define SYSCTRL_PERI_RESET0_ADC_RST_Pos                     (16U)
#define SYSCTRL_PERI_RESET0_ADC_RST_Msk                     (0x1UL << SYSCTRL_PERI_RESET0_ADC_RST_Pos)
#define SYSCTRL_PERI_RESET0_ADC_RST                         SYSCTRL_PERI_RESET0_ADC_RST_Msk
#define SYSCTRL_PERI_RESET0_VC_RST_Pos                      (17U)
#define SYSCTRL_PERI_RESET0_VC_RST_Msk                      (0x1UL << SYSCTRL_PERI_RESET0_VC_RST_Pos)
#define SYSCTRL_PERI_RESET0_VC_RST                          SYSCTRL_PERI_RESET0_VC_RST_Msk
#define SYSCTRL_PERI_RESET0_TRNG_RST_Pos                    (18U)
#define SYSCTRL_PERI_RESET0_TRNG_RST_Msk                    (0x1UL << SYSCTRL_PERI_RESET0_TRNG_RST_Pos)
#define SYSCTRL_PERI_RESET0_TRNG_RST                        SYSCTRL_PERI_RESET0_TRNG_RST_Msk
#define SYSCTRL_PERI_RESET0_RTC_RST_Pos                     (20U)
#define SYSCTRL_PERI_RESET0_RTC_RST_Msk                     (0x1UL << SYSCTRL_PERI_RESET0_RTC_RST_Pos)
#define SYSCTRL_PERI_RESET0_RTC_RST                         SYSCTRL_PERI_RESET0_RTC_RST_Msk
#define SYSCTRL_PERI_RESET0_GPIO_RST_Pos                    (28U)
#define SYSCTRL_PERI_RESET0_GPIO_RST_Msk                    (0x1UL << SYSCTRL_PERI_RESET0_GPIO_RST_Pos)
#define SYSCTRL_PERI_RESET0_GPIO_RST                        SYSCTRL_PERI_RESET0_GPIO_RST_Msk
#define SYSCTRL_PERI_RESET0_HSI2C_RST_Pos                   (30U)
#define SYSCTRL_PERI_RESET0_HSI2C_RST_Msk                   (0x1UL << SYSCTRL_PERI_RESET0_HSI2C_RST_Pos)
#define SYSCTRL_PERI_RESET0_HSI2C_RST                       SYSCTRL_PERI_RESET0_HSI2C_RST_Msk

// SYSCTRL_PERI_RESET1
#define SYSCTRL_PERI_RESET1_CTIM0_RST_Pos                   (0U)
#define SYSCTRL_PERI_RESET1_CTIM0_RST_Msk                   (0x1UL << SYSCTRL_PERI_RESET1_CTIM0_RST_Pos)
#define SYSCTRL_PERI_RESET1_CTIM0_RST                       SYSCTRL_PERI_RESET1_CTIM0_RST_Msk
#define SYSCTRL_PERI_RESET1_CTIM1_RST_Pos                   (1U)
#define SYSCTRL_PERI_RESET1_CTIM1_RST_Msk                   (0x1UL << SYSCTRL_PERI_RESET1_CTIM1_RST_Pos)
#define SYSCTRL_PERI_RESET1_CTIM1_RST                       SYSCTRL_PERI_RESET1_CTIM1_RST_Msk
#define SYSCTRL_PERI_RESET1_CTRIM_RST_Pos                   (2U)
#define SYSCTRL_PERI_RESET1_CTRIM_RST_Msk                   (0x1UL << SYSCTRL_PERI_RESET1_CTRIM_RST_Pos)
#define SYSCTRL_PERI_RESET1_CTRIM_RST                       SYSCTRL_PERI_RESET1_CTRIM_RST_Msk

