yuer-12342/sx1280-test/mcu/common/hc32l021.h
// SYSCTRL_DEBUG_ACTIVE
#define SYSCTRL_DEBUG_ACTIVE_IWDT_DEBUG_Pos                 (8U)
#define SYSCTRL_DEBUG_ACTIVE_IWDT_DEBUG_Msk                 (0x1UL << SYSCTRL_DEBUG_ACTIVE_IWDT_DEBUG_Pos)
#define SYSCTRL_DEBUG_ACTIVE_IWDT_DEBUG                     SYSCTRL_DEBUG_ACTIVE_IWDT_DEBUG_Msk
#define SYSCTRL_DEBUG_ACTIVE_RTC_DEBUG_Pos                  (9U)
#define SYSCTRL_DEBUG_ACTIVE_RTC_DEBUG_Msk                  (0x1UL << SYSCTRL_DEBUG_ACTIVE_RTC_DEBUG_Pos)
#define SYSCTRL_DEBUG_ACTIVE_RTC_DEBUG                      SYSCTRL_DEBUG_ACTIVE_RTC_DEBUG_Msk
#define SYSCTRL_DEBUG_ACTIVE_ATIM3_DEBUG_Pos                (11U)
#define SYSCTRL_DEBUG_ACTIVE_ATIM3_DEBUG_Msk                (0x1UL << SYSCTRL_DEBUG_ACTIVE_ATIM3_DEBUG_Pos)
#define SYSCTRL_DEBUG_ACTIVE_ATIM3_DEBUG                    SYSCTRL_DEBUG_ACTIVE_ATIM3_DEBUG_Msk
#define SYSCTRL_DEBUG_ACTIVE_CTIM0_DEBUG_Pos                (16U)
#define SYSCTRL_DEBUG_ACTIVE_CTIM0_DEBUG_Msk                (0x1UL << SYSCTRL_DEBUG_ACTIVE_CTIM0_DEBUG_Pos)
#define SYSCTRL_DEBUG_ACTIVE_CTIM0_DEBUG                    SYSCTRL_DEBUG_ACTIVE_CTIM0_DEBUG_Msk
#define SYSCTRL_DEBUG_ACTIVE_CTIM1_DEBUG_Pos                (17U)
#define SYSCTRL_DEBUG_ACTIVE_CTIM1_DEBUG_Msk                (0x1UL << SYSCTRL_DEBUG_ACTIVE_CTIM1_DEBUG_Pos)
#define SYSCTRL_DEBUG_ACTIVE_CTIM1_DEBUG                    SYSCTRL_DEBUG_ACTIVE_CTIM1_DEBUG_Msk



//********************    Bits Define For Peripheral TRNG    ********************//
// TRNG_CR
#define TRNG_CR_RNGCIR_EN_Pos                               (0U)
#define TRNG_CR_RNGCIR_EN_Msk                               (0x1UL << TRNG_CR_RNGCIR_EN_Pos)
#define TRNG_CR_RNGCIR_EN                                   TRNG_CR_RNGCIR_EN_Msk
#define TRNG_CR_RNG_RUN_Pos                                 (1U)
#define TRNG_CR_RNG_RUN_Msk                                 (0x1UL << TRNG_CR_RNG_RUN_Pos)
#define TRNG_CR_RNG_RUN                                     TRNG_CR_RNG_RUN_Msk

// TRNG_MODE
#define TRNG_MODE_LOAD_Pos                                  (0U)
#define TRNG_MODE_LOAD_Msk                                  (0x1UL << TRNG_MODE_LOAD_Pos)
#define TRNG_MODE_LOAD                                      TRNG_MODE_LOAD_Msk
#define TRNG_MODE_FDBK_Pos                                  (1U)
#define TRNG_MODE_FDBK_Msk                                  (0x1UL << TRNG_MODE_FDBK_Pos)
#define TRNG_MODE_FDBK                                      TRNG_MODE_FDBK_Msk
#define TRNG_MODE_CNT_Pos                                   (2U)
#define TRNG_MODE_CNT_Msk                                   (0x7UL << TRNG_MODE_CNT_Pos)
#define TRNG_MODE_CNT                                       TRNG_MODE_CNT_Msk

// TRNG_DATA0
#define TRNG_DATA0_DATA0_Pos                                (0U)
#define TRNG_DATA0_DATA0_Msk                                (0xFFFFFFFFUL << TRNG_DATA0_DATA0_Pos)
#define TRNG_DATA0_DATA0                                    TRNG_DATA0_DATA0_Msk

// TRNG_DATA1
#define TRNG_DATA1_DATA1_Pos                                (0U)
#define TRNG_DATA1_DATA1_Msk                                (0xFFFFFFFFUL << TRNG_DATA1_DATA1_Pos)
#define TRNG_DATA1_DATA1                                    TRNG_DATA1_DATA1_Msk



//********************    Bits Define For Peripheral VC    ********************//
// VC_VC0_CR0
#define VC_VC0_CR0_DIV_Pos                                  (0U)
#define VC_VC0_CR0_DIV_Msk                                  (0x3FUL << VC_VC0_CR0_DIV_Pos)
#define VC_VC0_CR0_DIV                                      VC_VC0_CR0_DIV_Msk
#define VC_VC0_CR0_DIV_EN_Pos                               (6U)
#define VC_VC0_CR0_DIV_EN_Msk                               (0x1UL << VC_VC0_CR0_DIV_EN_Pos)
#define VC_VC0_CR0_DIV_EN                                   VC_VC0_CR0_DIV_EN_Msk
#define VC_VC0_CR0_BIAS_Pos                                 (8U)
#define VC_VC0_CR0_BIAS_Msk                                 (0x3UL << VC_VC0_CR0_BIAS_Pos)
#define VC_VC0_CR0_BIAS                                     VC_VC0_CR0_BIAS_Msk
#define VC_VC0_CR0_HYS_Pos                                  (10U)
#define VC_VC0_CR0_HYS_Msk                                  (0x3UL << VC_VC0_CR0_HYS_Pos)
#define VC_VC0_CR0_HYS                                      VC_VC0_CR0_HYS_Msk

// VC_VC0_CR1
#define VC_VC0_CR1_PSEL_Pos                                 (0U)
#define VC_VC0_CR1_PSEL_Msk                                 (0xFUL << VC_VC0_CR1_PSEL_Pos)
#define VC_VC0_CR1_PSEL                                     VC_VC0_CR1_PSEL_Msk
#define VC_VC0_CR1_NSEL_Pos                                 (4U)
#define VC_VC0_CR1_NSEL_Msk                                 (0xFUL << VC_VC0_CR1_NSEL_Pos)
#define VC_VC0_CR1_NSEL                                     VC_VC0_CR1_NSEL_Msk
#define VC_VC0_CR1_FLTTIME_Pos                              (8U)
#define VC_VC0_CR1_FLTTIME_Msk                              (0xFUL << VC_VC0_CR1_FLTTIME_Pos)
#define VC_VC0_CR1_FLTTIME                                  VC_VC0_CR1_FLTTIME_Msk
#define VC_VC0_CR1_FALLING_Pos                              (12U)
#define VC_VC0_CR1_FALLING_Msk                              (0x1UL << VC_VC0_CR1_FALLING_Pos)
#define VC_VC0_CR1_FALLING                                  VC_VC0_CR1_FALLING_Msk
#define VC_VC0_CR1_RISING_Pos                               (13U)
#define VC_VC0_CR1_RISING_Msk                               (0x1UL << VC_VC0_CR1_RISING_Pos)
#define VC_VC0_CR1_RISING                                   VC_VC0_CR1_RISING_Msk
#define VC_VC0_CR1_LEVEL_Pos                                (14U)
#define VC_VC0_CR1_LEVEL_Msk                                (0x1UL << VC_VC0_CR1_LEVEL_Pos)
#define VC_VC0_CR1_LEVEL                                    VC_VC0_CR1_LEVEL_Msk
#define VC_VC0_CR1_IE_Pos                                   (15U)
#define VC_VC0_CR1_IE_Msk                                   (0x1UL << VC_VC0_CR1_IE_Pos)
#define VC_VC0_CR1_IE                                       VC_VC0_CR1_IE_Msk
#define VC_VC0_CR1_EN_Pos                                   (16U)
#define VC_VC0_CR1_EN_Msk                                   (0x1UL << VC_VC0_CR1_EN_Pos)
#define VC_VC0_CR1_EN                                       VC_VC0_CR1_EN_Msk
#define VC_VC0_CR1_FLTCLK_Pos                               (17U)
#define VC_VC0_CR1_FLTCLK_Msk                               (0x1UL << VC_VC0_CR1_FLTCLK_Pos)
#define VC_VC0_CR1_FLTCLK                                   VC_VC0_CR1_FLTCLK_Msk
#define VC_VC0_CR1_FLT_MODE_Pos                             (18U)
#define VC_VC0_CR1_FLT_MODE_Msk                             (0x3UL << VC_VC0_CR1_FLT_MODE_Pos)
#define VC_VC0_CR1_FLT_MODE                                 VC_VC0_CR1_FLT_MODE_Msk

// VC_VC0_CR2
#define VC_VC0_CR2_POL_Pos                                  (0U)
#define VC_VC0_CR2_POL_Msk                                  (0x1UL << VC_VC0_CR2_POL_Pos)
#define VC_VC0_CR2_POL                                      VC_VC0_CR2_POL_Msk
#define VC_VC0_CR2_ATIM3CLR_Pos                             (4U)
#define VC_VC0_CR2_ATIM3CLR_Msk                             (0x1UL << VC_VC0_CR2_ATIM3CLR_Pos)
#define VC_VC0_CR2_ATIM3CLR                                 VC_VC0_CR2_ATIM3CLR_Msk
#define VC_VC0_CR2_ATIMBK_Pos                               (5U)
#define VC_VC0_CR2_ATIMBK_Msk                               (0x1UL << VC_VC0_CR2_ATIMBK_Pos)
#define VC_VC0_CR2_ATIMBK                                   VC_VC0_CR2_ATIMBK_Msk
#define VC_VC0_CR2_WINDOW_Pos                               (6U)
#define VC_VC0_CR2_WINDOW_Msk                               (0x1UL << VC_VC0_CR2_WINDOW_Pos)
#define VC_VC0_CR2_WINDOW                                   VC_VC0_CR2_WINDOW_Msk
#define VC_VC0_CR2_BLANK_Pos                                (8U)
#define VC_VC0_CR2_BLANK_Msk                                (0x7UL << VC_VC0_CR2_BLANK_Pos)
#define VC_VC0_CR2_BLANK                                    VC_VC0_CR2_BLANK_Msk

// VC_VC0_SR
#define VC_VC0_SR_INTF_Pos                                  (0U)
#define VC_VC0_SR_INTF_Msk                                  (0x1UL << VC_VC0_SR_INTF_Pos)
#define VC_VC0_SR_INTF                                      VC_VC0_SR_INTF_Msk
#define VC_VC0_SR_FLTV_Pos                                  (1U)
#define VC_VC0_SR_FLTV_Msk                                  (0x1UL << VC_VC0_SR_FLTV_Pos)
#define VC_VC0_SR_FLTV                                      VC_VC0_SR_FLTV_Msk

// VC_VC1_CR0
#define VC_VC1_CR0_DIV_Pos                                  (0U)
#define VC_VC1_CR0_DIV_Msk                                  (0x3FUL << VC_VC1_CR0_DIV_Pos)
#define VC_VC1_CR0_DIV                                      VC_VC1_CR0_DIV_Msk
#define VC_VC1_CR0_DIV_EN_Pos                               (6U)
#define VC_VC1_CR0_DIV_EN_Msk                               (0x1UL << VC_VC1_CR0_DIV_EN_Pos)
#define VC_VC1_CR0_DIV_EN                                   VC_VC1_CR0_DIV_EN_Msk
#define VC_VC1_CR0_BIAS_Pos                                 (8U)
#define VC_VC1_CR0_BIAS_Msk                                 (0x3UL << VC_VC1_CR0_BIAS_Pos)
#define VC_VC1_CR0_BIAS                                     VC_VC1_CR0_BIAS_Msk
#define VC_VC1_CR0_HYS_Pos                                  (10U)
#define VC_VC1_CR0_HYS_Msk                                  (0x3UL << VC_VC1_CR0_HYS_Pos)
#define VC_VC1_CR0_HYS                                      VC_VC1_CR0_HYS_Msk

// VC_VC1_CR1
#define VC_VC1_CR1_PSEL_Pos                                 (0U)
#define VC_VC1_CR1_PSEL_Msk                                 (0xFUL << VC_VC1_CR1_PSEL_Pos)
#define VC_VC1_CR1_PSEL                                     VC_VC1_CR1_PSEL_Msk
#define VC_VC1_CR1_NSEL_Pos                                 (4U)
#define VC_VC1_CR1_NSEL_Msk                                 (0xFUL << VC_VC1_CR1_NSEL_Pos)
#define VC_VC1_CR1_NSEL                                     VC_VC1_CR1_NSEL_Msk
#define VC_VC1_CR1_FLTTIME_Pos                              (8U)
#define VC_VC1_CR1_FLTTIME_Msk                              (0xFUL << VC_VC1_CR1_FLTTIME_Pos)
#define VC_VC1_CR1_FLTTIME                                  VC_VC1_CR1_FLTTIME_Msk
#define VC_VC1_CR1_FALLING_Pos                              (12U)
#define VC_VC1_CR1_FALLING_Msk                              (0x1UL << VC_VC1_CR1_FALLING_Pos)
#define VC_VC1_CR1_FALLING                                  VC_VC1_CR1_FALLING_Msk
#define VC_VC1_CR1_RISING_Pos                               (13U)
#define VC_VC1_CR1_RISING_Msk                               (0x1UL << VC_VC1_CR1_RISING_Pos)
#define VC_VC1_CR1_RISING                                   VC_VC1_CR1_RISING_Msk
#define VC_VC1_CR1_LEVEL_Pos                                (14U)
#define VC_VC1_CR1_LEVEL_Msk                                (0x1UL << VC_VC1_CR1_LEVEL_Pos)
#define VC_VC1_CR1_LEVEL                                    VC_VC1_CR1_LEVEL_Msk
#define VC_VC1_CR1_IE_Pos                                   (15U)
#define VC_VC1_CR1_IE_Msk                                   (0x1UL << VC_VC1_CR1_IE_Pos)
#define VC_VC1_CR1_IE                                       VC_VC1_CR1_IE_Msk
#define VC_VC1_CR1_EN_Pos                                   (16U)
#define VC_VC1_CR1_EN_Msk                                   (0x1UL << VC_VC1_CR1_EN_Pos)
#define VC_VC1_CR1_EN                                       VC_VC1_CR1_EN_Msk
#define VC_VC1_CR1_FLTCLK_Pos                               (17U)
#define VC_VC1_CR1_FLTCLK_Msk                               (0x1UL << VC_VC1_CR1_FLTCLK_Pos)
#define VC_VC1_CR1_FLTCLK                                   VC_VC1_CR1_FLTCLK_Msk
#define VC_VC1_CR1_FLT_MODE_Pos                             (18U)
#define VC_VC1_CR1_FLT_MODE_Msk                             (0x3UL << VC_VC1_CR1_FLT_MODE_Pos)
#define VC_VC1_CR1_FLT_MODE                                 VC_VC1_CR1_FLT_MODE_Msk

// VC_VC1_CR2
#define VC_VC1_CR2_POL_Pos                                  (0U)
#define VC_VC1_CR2_POL_Msk                                  (0x1UL << VC_VC1_CR2_POL_Pos)
#define VC_VC1_CR2_POL                                      VC_VC1_CR2_POL_Msk
#define VC_VC1_CR2_ATIM3CLR_Pos                             (4U)
#define VC_VC1_CR2_ATIM3CLR_Msk                             (0x1UL << VC_VC1_CR2_ATIM3CLR_Pos)
#define VC_VC1_CR2_ATIM3CLR                                 VC_VC1_CR2_ATIM3CLR_Msk
#define VC_VC1_CR2_ATIMBK_Pos                               (5U)
#define VC_VC1_CR2_ATIMBK_Msk                               (0x1UL << VC_VC1_CR2_ATIMBK_Pos)
#define VC_VC1_CR2_ATIMBK                                   VC_VC1_CR2_ATIMBK_Msk
#define VC_VC1_CR2_WINDOW_Pos                               (6U)
#define VC_VC1_CR2_WINDOW_Msk                               (0x1UL << VC_VC1_CR2_WINDOW_Pos)
#define VC_VC1_CR2_WINDOW                                   VC_VC1_CR2_WINDOW_Msk
#define VC_VC1_CR2_BLANK_Pos                                (8U)
#define VC_VC1_CR2_BLANK_Msk                                (0x7UL << VC_VC1_CR2_BLANK_Pos)
#define VC_VC1_CR2_BLANK                                    VC_VC1_CR2_BLANK_Msk

// VC_VC1_SR
#define VC_VC1_SR_INTF_Pos                                  (0U)
#define VC_VC1_SR_INTF_Msk                                  (0x1UL << VC_VC1_SR_INTF_Pos)
#define VC_VC1_SR_INTF                                      VC_VC1_SR_INTF_Msk
#define VC_VC1_SR_FLTV_Pos                                  (1U)
#define VC_VC1_SR_FLTV_Msk                                  (0x1UL << VC_VC1_SR_FLTV_Pos)
#define VC_VC1_SR_FLTV                                      VC_VC1_SR_FLTV_Msk

// VC_VC_TRIM
#define VC_VC_TRIM_TRIM0_Pos                                (0U)
#define VC_VC_TRIM_TRIM0_Msk                                (0xFUL << VC_VC_TRIM_TRIM0_Pos)
#define VC_VC_TRIM_TRIM0                                    VC_VC_TRIM_TRIM0_Msk
#define VC_VC_TRIM_TRIM1_Pos                                (4U)
#define VC_VC_TRIM_TRIM1_Msk                                (0xFUL << VC_VC_TRIM_TRIM1_Pos)
#define VC_VC_TRIM_TRIM1                                    VC_VC_TRIM_TRIM1_Msk





#ifdef __cplusplus
}
#endif

#endif /* __HC32L021_H__ */

